[
    "Context:\n\nBillie Eilish Pirate Baird O'Connell (/ˈaɪlɪʃ/ EYE-lish; born December 18, 2001) is an American singer and songwriter. She first gained public attention in 2015 with her debut single \"Ocean Eyes\", written and produced by her brother Finneas O'Connell, with whom she collaborates on music and live shows. In 2017, she released her debut extended play (EP), titled Don't Smile at Me. Commercially successful, it reached the top 15 of record charts in numerous countries, including the US, UK, Canada, and Australia.\n\nEilish's first studio album, When We All Fall Asleep, Where Do We Go? (2019), debuted atop the US Billboard 200 and UK Albums Chart. It was one of the best-selling albums of the year, buoyed by the success of its fifth single \"Bad Guy\", Eilish's first number-one on the US Billboard Hot 100. This made her the first artist born in the 21st century to release a chart-topping single. The following year, Eilish performed the theme song \"No Time to Die\" for the James Bond film of the same name, which topped the UK Singles Chart and won the Academy Award for Best Original Song in 2022. Her subsequent singles \"Everything I Wanted\", \"My Future\", \"Therefore I Am\", and \"Your Power\" peaked in the top 10 in the US and UK. Her second studio album, Happier Than Ever (2021), topped charts in 25 countries.\n\nInstruction:\n\nGiven this paragraph about Billie Eilish, tell me who produced her debut single, also tell me what is her chart-topping single?\n\nAnswer:\n\nHer brother Finneas O'Connell produced her debut single \"Ocean Eyes\", and her chart topping single is \"Bad Guy\"\n\n",
    "Context:\n\nShibuya Station is a railway station in Shibuya, Tokyo, Japan, operated jointly by East Japan Railway Company (JR East), Keio Corporation, Tokyu Corporation, and Tokyo Metro. With 2.4 million passengers on an average weekday in 2004, it is the fourth-busiest commuter rail station in Japan and the world (after Shinjuku, Ikebukuro, and Ōsaka / Umeda) handling a large amount of commuter traffic between the city center and suburbs to the south and west.\n\nInstruction:\n\nIn which country are the world's four busiest commuter rail stations located?\n\nAnswer:\n\nJapan\n\n",
    "Context:\n\nThe Cuban Missile Crisis, also known as the October Crisis (of 1962) (Spanish: Crisis de Octubre) in Cuba, the Caribbean Crisis (Russian: Карибский кризис, tr. Karibsky krizis, IPA: [kɐˈrʲipskʲɪj ˈkrʲizʲɪs]) in Russia, or the Missile Scare, was a 35-day (October 16 – November 20, 1962) confrontation between the United States and the Soviet Union, which escalated into an international crisis when American deployments of missiles in Italy and Turkey were matched by Soviet deployments of similar ballistic missiles in Cuba. Despite the short time frame, the Cuban Missile Crisis remains a defining moment in national security and nuclear war preparation. The confrontation is often considered the closest the Cold War came to escalating into a full-scale nuclear war.\n\nInstruction:\n\nGiven a reference text about the Cuban Missile Crisis, when did the crisis occur and how long did it last?\n\nAnswer:\n\nThe Cuban Missile crises lasted 35 days, from October 16 to November 20, 1962.\n\n",
    "Context:\n\nHigh-functioning autism (HFA) is an autism classification where a person exhibits no intellectual disability but may show deficits in communication, emotion recognition and expression, and social interaction.HFA is not included in the American Psychological Association's DSM-5 or the World Health Organization's ICD-10, subdividing autism based on intellectual capabilities. High-functioning autism is characterised by features similar to those of Asperger syndrome. The defining characteristic psychologists recognise there is a significant delay in developing early speech and language skills before three years. The diagnostic criteria of Asperger syndrome exclude a general language delay.\n\nOther differences in features of people with high-functioning autism from those with Asperger syndrome include the following:\n\nLower verbal reasoning ability\nBetter visual/spatial skills (Being uniquely artistically talented)\nLess deviating locomotion (e.g. clumsiness)\nProblems functioning independently\nCuriosity and interest in many different things\nNot as good at empathising with other people\nMale to female ratio (4:1) is much smaller\n\nAs of 2013, Asperger syndrome and high-functioning autism are no longer terms the American Psychological Association uses and have been merged into autism spectrum disorder (ASD). As of 2021, the World Health Organization also retired the terms and merged them into autism spectrum disorder.\n\nInstruction:\n\nWhat is High-functioning autism?\n\nAnswer:\n\nHigh-functioning autism (HFA) is an autism classification where a person exhibits no intellectual disability but may show deficits in communication, emotion recognition and expression, and social interaction. High-functioning autism is characterised by features similar to those of Asperger syndrome. The defining characteristic psychologists recognise there is a significant delay in developing early speech and language skills before three years. The diagnostic criteria of Asperger syndrome exclude a general language delay.\n\n",
    "Context:\n\nJelly Roll is married to Bunnie DeFord aka Bunnie XO and has two children from a previous relationship.\n\nInstruction:\n\nBy what other name does Bunnie DeFord go by?\n\nAnswer:\n\nBunnie XO\n\n",
    "Context:\n\nBy the ninth century CE, a string of dynastic states, including the earliest Hausa states, stretched across the sub-Saharan savannah from the western regions to central Sudan. The most powerful of these states were Ghana, Gao, and the Kanem-Bornu Empire. Ghana declined in the eleventh century, but was succeeded by the Mali Empire which consolidated much of western Sudan in the thirteenth century. Kanem accepted Islam in the eleventh century.\n\nInstruction:\n\nHow many years passed from Ghana's decline to the Mali Empire consolidating western Sudan?\n\nAnswer:\n\nGhana declined in the 11th century, Mali Empire consolidated much of western Sudan in the 13th century, so 2 centuries passed which equals 200 years.\n\n",
    "Context:\n\nMaskavas Forštate (German: Moskauer Vorstadt) also known as Maskavas priekšpilsēta and colloquially as Maskačka, is a suburb of Riga situated on the right bank of the Daugava. The neighborhood is located to the south of Old Riga along the road historically connecting Riga to Moscow, from which its name is derived.\n\nHistory\nSee also: Riga Ghetto\nThe history of Maskavas Forštate, whose name in English literally means Moscow Suburb goes back to at least the 14th century, in some parts the medieval street network has been preserved. However, the area is first mentioned in 1348 by the name of Lastādija (German: Lastadie).\n\nArchitecturally, the neighborhood reflects its history as an area of Russian, Belarusian and Jewish migration, especially characteristic wooden homes.\n\nDuring the Nazi occupation of Riga, the neighborhood was turned into a ghetto for Jews. Today, there are memorials on the site of the Great Choral Synagogue and the Old Jewish cemetery. Most of the prewar buildings remain standing.\n\nInstruction:\n\nWhat's the architecture in Maskavas Forstate look like?\n\nAnswer:\n\nThe architecture of Maskavas Forštate reflects the history of Russian, Belarusian, and Jewish migration.\n\n",
    "Context:\n\nIn late January 2017, Rahm won the Farmers Insurance Open with a 60-foot eagle putt on the final hole to notch his maiden PGA Tour title. He jumped from 137th to 46th in the Official World Golf Ranking with the win, and also gained entry into the Masters Tournament, The Players Championship, the PGA Championship, and World Golf Championships events. On 2 March, Rahm played in his first World Golf Championships event at the WGC-Mexico Championship where he shot rounds of 67-70-67-68 (−12) to finish T3, two strokes behind winner Dustin Johnson.\n\nInstruction:\n\nHow did Jon Rahm win the Farmers Insurance Open?\n\nAnswer:\n\na 60-foot eagle putt on the final hole\n\n",
    "Context:\n\nThe Stade Louis-II, also known as Louis II (French pronunciation: ​[stad(ə) lwi dø]) is a stadium located in the Fontvieille district of Monaco. It serves primarily as a venue for football, being the home of AS Monaco and the Monaco national football team. The stadium is most notable for its distinctive nine arches at the away end of the ground. The arena is also used for the Herculis, a track and field meet of the Diamond League. The stadium hosted the 1986 and 1998–2012 UEFA Super Cup matches. Due to Monaco's small size, the stadium is the only football and athletics stadium in the country.\n\nInstruction:\n\nWhere is the Stade Louis-ll located?\n\nAnswer:\n\nThe Stade Louis-ll is located in the Fontvielle district of Monaco.\n\n",
    "Context:\n\nIrina Vysheslavska was born in Kiev on February 20, 1939, into a family of great cultural traditions. Her father Leonid Vysheslavsky was a noted poet and her mother Agnes Baltaga was a writer. Several of her ancestors were priests in Greece, Romania and Ukraine.\n\nInstruction:\n\nWhen was Irina Vysheslavska born?\n\nAnswer:\n\nIrina Vysheslavska was born on February 20, 1939.\n\n",
    "Context:\n\nLondon is a 2005 Indian Tamil-language comedy-drama film written by Badri and directed by Sundar C.  Bhaskaran hides the money before getting arrested, and the place is known only to his lawyer Vedimuthu. Aishwarya pretends to be in love with Vedimuthu to find where the money is hidden.\n\nInstruction:\n\nIn which movie or plot the character vedimuthu was established\n\nAnswer:\n\nVedimuthu character was potrayed by Vadivelu and become famous for his comic potrayal of act of love with mistress Aishwarya (potrayed by mumtaz) and getting caught in the act to his wife Baby(potrayed by Nalini).\n\n",
    "Context:\n\nIn the United States between 1973 and 1999, September 16 is the most common birthday in the United States and December 25 the least common birthday (other than February 29, because of leap years). In 2011, October 5 and 6 were reported as the most frequently occurring birthdays.\n\nInstruction:\n\nWhat is the least common birthday in the US other than Feb 29?\n\nAnswer:\n\nThe least common birthday in the United States between 1973 and 1999, excluding February 29, is December 25.\n\n",
    "Context:\n\nIn the 21st century alone, UVA teams have won seventeen NCAA championships. The men's teams have won recent NCAA titles in basketball (2019); lacrosse (2003, 2006, 2011, 2019, and 2021); baseball (2015); soccer (2009 and 2014); and tennis (2013, 2015, 2016, 2017, and 2022). UVA women have won recent NCAA titles in rowing (2010 and 2012) and swimming & diving (2021 and 2022). The Cavaliers rank first in the ACC (a power conference) with 22 men's NCAA Championships, and rank second in the conference with nine women's NCAA Championships.\n\nInstruction:\n\nAccording to this reference text about UVA, what years have UVA women won NCAA titles in rowing?\n\nAnswer:\n\nUVA women won NCAA titles in rowing in 2010 and 2012.\n\n",
    "Context:\n\nOn April 6, 2009 (starting with the 9:00 a.m. to 12:00 p.m. Eastern Time edition, which was anchored by Hannah Storm and Sage Steele), SportsCenter debuted a new graphics package that saw the \"rundown\" graphic – shown during the daytime editions – being shifted to the left side of the screen. On that same date, SportsCenter began producing its 1:00 a.m. Eastern Time edition of SportsCenter live from ESPN's production facilities in the newly constructed L.A. Live complex (just across from the Staples Center) in Los Angeles. The set is virtually identical to the setup at the main facilities in Bristol, and the late-night West Coast broadcast would be produced as simply another edition of the program. Neil Everett and Stan Verrett were appointed as the primary anchors for the Los Angeles-based editions of SportsCenter. A new BottomLine ticker was also unveiled that day on four of the five ESPN networks (ESPN, ESPN2, ESPN Classic and ESPNU); the redesigned ticker was quickly dropped, reverting to the old BottomLine design – which had been in use since April 2003 – due to an equipment failure (however, this ticker was operational for the 2009 NFL Draft and the 2009 NBA draft). After technical issues with the revamped BottomLine were fixed, the new BottomLine was reinstated on July 8.\n\nInstruction:\n\nGiven this paragraph about ESPN's SportsCenter in 2009, in what west coast city did ESPN begin producing it's 1:00 a.m. Eastern Time edition of SportsCenter?\n\nAnswer:\n\nLos Angeles is the west coast city that ESPN began producing it's 1:00 a.m. Eastern Time edition of SportsCenter.\n\n",
    "Context:\n\nDartmouth Workshop 1956: the birth of AI\nThe Dartmouth Workshop of 1956 was organized by Marvin Minsky, John McCarthy and two senior scientists: Claude Shannon and Nathan Rochester of IBM. The proposal for the conference included this assertion: \"every aspect of learning or any other feature of intelligence can be so precisely described that a machine can be made to simulate it\". The participants included Ray Solomonoff, Oliver Selfridge, Trenchard More, Arthur Samuel, Allen Newell and Herbert A. Simon, all of whom would create important programs during the first decades of AI research. At the workshop Newell and Simon debuted the \"Logic Theorist\" and McCarthy persuaded the attendees to accept \"Artificial Intelligence\" as the name of the field. The 1956 Dartmouth workshop was the moment that AI gained its name, its mission, its first success and its major players, and is widely considered the birth of AI. The term \"Artificial Intelligence\" was chosen by McCarthy to avoid associations with cybernetics and connections with the influential cyberneticist Norbert Wiener.\n\nInstruction:\n\nWhen and where was the field of AI officially born?\n\nAnswer:\n\nThe field of AI was officially born in 1956 during a workshop organised at Dartmouth College\n\n",
    "Context:\n\nVoorhees Chapel is one of two chapels on the campus of Rutgers, The State University of New Jersey in New Brunswick, New Jersey. Built in 1925 with a donation from Elizabeth Rodman Voorhees, wife of Rutgers trustee Ralph Voorhees, the chapel once served the community of Douglass College. Douglass, founded the New Jersey College for Women (founded in 1918), was the women's residential college at Rutgers.\n\nInstruction:\n\nWhich chapel on Rutger's campus was built 7 years after the New Jersey College for Women?\n\nAnswer:\n\nThe Voorhees Chapel was built in 1925, seven years after the New Jersey College for Women was founded by Elizabeth Rodman Voorhees.\n\n",
    "Context:\n\nPompeii (/pɒmˈpeɪ(i)/, Latin: [pɔmˈpei̯.iː]) was an ancient city located in what is now the comune of Pompei near Naples in the Campania region of Italy. Pompeii, along with Herculaneum and many villas in the surrounding area (e.g. at Boscoreale, Stabiae), was buried under 4 to 6 m (13 to 20 ft) of volcanic ash and pumice in the Eruption of Mount Vesuvius in 79 AD.\n\nInstruction:\n\nWhere is Pompeii located?\n\nAnswer:\n\nThe ancient city of Pompeii is located near Naples in the Campania region of Italy.\n\n",
    "Context:\n\nIt was the arrival of the Price Brothers and Company (of William Evan Price) that the village of Price was founded at the end of the 19th century. It was a suburb of Saint-Octave-de-Métis, which constituted a community of workers, who were employed at the saw mill.\n\nInstruction:\n\nWho founded the city of Price, Quebec?\n\nAnswer:\n\nThe Price Brothers and Company\n\n",
    "Context:\n\nSeinfeld (/ˈsaɪnfɛld/ SYNE-feld) is an American television sitcom created by Larry David and Jerry Seinfeld. It aired on NBC from July 5, 1989, to May 14, 1998, over nine seasons and 180 episodes. It stars Seinfeld as a fictionalized version of himself and focuses on his personal life with three of his friends: best friend George Costanza (Jason Alexander), former girlfriend Elaine Benes (Julia Louis-Dreyfus) and his neighbor from across the hall, Cosmo Kramer (Michael Richards). It is set mostly in an apartment building in Manhattan's Upper West Side in New York City. It has been described as \"a show about nothing\", often focusing on the minutiae of daily life. Interspersed in earlier episodes are moments of stand-up comedy from the fictional Jerry Seinfeld, frequently using the episode's events for material.\n\nInstruction:\n\nWho is the main cast in Seinfeld TV show?\n\nAnswer:\n\nJerry Seinfeld\nJason Alexander\nJulia Louis-Dreyfus\nMichael Richards\n\n",
    "Context:\n\nA druid was a member of the high-ranking class in ancient Celtic cultures. Druids were religious leaders as well as legal authorities, adjudicators, lorekeepers, medical professionals and political advisors. Druids left no written accounts. While they were reported to have been literate, they are believed to have been prevented by doctrine from recording their knowledge in written form. Their beliefs and practices are attested in some detail by their contemporaries from other cultures, such as the Romans and the Greeks.\n\nInstruction:\n\nWhat is a Druid?\n\nAnswer:\n\nA druid was a member of the high-ranking class in ancient Celtic cultures.\n\n",
    "Context:\n\nIn the 1994–95 season, Jágr won his first Art Ross Trophy after finishing the regular season with the most points in the NHL; he tied Eric Lindros with 70 points but won based on his 32 goals to Lindros' 29. The next year, Jágr set a record for most points, 149, by a European-born player. Both his 62 goals and 87 assists from that season still stand as career-highs. His 1995–96 totals for assists and points stand as the records for right-wingers in those categories. After the 1997–98 season, Penguins captain Ron Francis signed with the Carolina Hurricanes, leaving Jágr the Penguins' captaincy. From 1997–98 to 2000–01, Jágr would win four-straight NHL scoring titles. In 1999, he would win the Hart Memorial Trophy as the NHL's most valuable player, as well as the Lester B. Pearson Award. In 1998, he led the Czech Republic to a gold medal at the 1998 Winter Olympics.\n\nInstruction:\n\nHow many points did Jaromír Jágr score in the 1995-1996 season?\n\nAnswer:\n\nIn a record-setting year, Jaromír Jágr scored 149 points in the 1995-96 season.\n\n",
    "Context:\n\nLong short-term memory (LSTM) is an artificial neural network used in the fields of artificial intelligence and deep learning. Unlike standard feedforward neural networks, LSTM has feedback connections. Such a recurrent neural network (RNN) can process not only single data points (such as images), but also entire sequences of data (such as speech or video). This characteristic makes LSTM networks ideal for processing and predicting data. For example, LSTM is applicable to tasks such as unsegmented, connected handwriting recognition, speech recognition, machine translation, speech activity detection, robot control, video games, and healthcare.\n\nInstruction:\n\nGiven this paragraph, what are some examples of long short-term memory (LSTM) use cases?\n\nAnswer:\n\nLong short-term memory  is used for handwriting recognition,  speech recognition, machine translation, speech activity detection, robot control, video games and healthcare.\n\n",
    "Context:\n\nIn 2019, Virginia men's basketball won the NCAA Championship in \"March Madness\", the single-elimination national college basketball tournament considered by YouGov polled American viewers (as of the same year) to be the most exciting collegiate sporting event. In 2015, when Virginia first won its first Capital One Cup its teams won the 2014 College Cup, the 2015 College World Series, and the 2015 NCAA Tennis Championships. When it repeated the feat in 2019, the program won both March Madness and the 2019 Men's Lacrosse Championship.\n\nInstruction:\n\nAccording to this paragraph, tell me what is referred to as the most exciting collegiate sporting event.\n\nAnswer:\n\nWhat is referred to as the most exciting collegiate sporting event is when the Virginia men's basketball team won the NCAA Championship in 2019.\n\n",
    "Context:\n\nThe Western Iranian languages themselves are divided into two subgroups: Southwestern Iranian languages, of which Persian is the most widely spoken, and Northwestern Iranian languages, of which Kurdish and Balochi are the most widely spoken\n\nInstruction:\n\nGiven this paragraph on the Persian language, which are the 2 sub groups of the Western Iranian language?\n\nAnswer:\n\nSouthwestern and Northwestern Iranian language\n\n",
    "Context:\n\nThe Cycle Messenger World Championships, or CMWCs, are an annual urban cycling competition whereby cycle messengers and cycling enthusiasts showcase their skills in an array of events, many of which simulate everyday tasks for a cycle messenger. Each year, the CMWCs are held in a different city around the world, with each host city designing its own unique course. The highlight of the CMWCs is the main race in which cyclists are given manifests and must pickup and deliver items to various locations around the host city as quickly and efficiently as possible. The total number of pickups and deliveries, or \"drop offs\" is unknown to the messengers before the race, but has been known to reach up to 100 stops and usually takes between 3–4 hours to complete. The cyclist who completes all of the assigned deliveries in the least amount of time wins the race. In addition to the main race there are also several side events which have become increasingly popular over the past few years. These events change yearly depending on the discretion of the host city but usually include backward circles, bike polo, bunnyhop, cargo race, longest skid, sprints, and trackstand.\n\nInstruction:\n\nWhat does CMWCs stand for?\n\nAnswer:\n\nThe Cycle Messenger World Championships\n\n"
]