[
    "Context:\n\nSamuel Barry Jones (8 July 1923 – 26 January 1999) was an Australian politician. He was a member of the New South Wales Legislative Assembly from 1965 until 1984 and a member of the ALP.\n\nEarly life\nSamuel Barry Jones was born in Newcastle. He was the son of a steelworker and a brother of Charlie Jones. He was educated to intermediate level at Newcastle Boys' High School and trained as a fitter and turner. He was an office-holder in the Amalgamated Engineering Union.\n\nPolitical career\nSam Jones joined the Labor Party in 1945 and served as vice president and secretary of Tighes Hill branch, vice president of Newcastle and Waratah State Electorate Councils and secretary of Newcastle Federal Electorate Council.\n\nInstruction:\n\nWhich party Sam Jones was part of?\n\nAnswer:\n\nSam Jones (Samuel Barry Jones) served as vice president and secretary of the Labor Party in 1945.\n\n",
    "Context:\n\nPinot Gris, Pinot Grigio (US: /ˈpiːnoʊ ˈɡriːdʒioʊ, -dʒoʊ/, UK: /ˈɡrɪdʒioʊ/) or Grauburgunder is a white wine grape variety of the species Vitis vinifera. Thought to be a mutant clone of the Pinot Noir variety, it normally has a grayish-blue fruit, accounting for its name, but the grapes can have a brownish pink to black and even white appearance. The word pinot could have been given to it because the grapes grow in small pinecone-shaped clusters. The wines produced from this grape also vary in color from a deep golden yellow to copper and even a light shade of pink, and it is one of the more popular grapes for skin-contact wine.\n\nPinot Gris is grown around the globe, with the \"spicy\" full-bodied Alsatian and lighter-bodied, more acidic Italian styles being most widely recognized. The Alsatian style, often duplicated in New World wine regions such as Marlborough, Tasmania, South Australia, Washington, Oregon, and South Africa tend to have moderate to low acidity, higher alcohol levels and an almost \"oily\" texture that contributes to the full-bodied nature of the wine. The flavors can range from ripe tropical fruit notes of melon and mango to some botrytis-influenced flavors. In Italy, Pinot grigio grapes are often harvested early to retain the refreshing acidity and minimize some of the overt-fruitiness of the variety, creating a more neutral flavor profile. This style is often imitated in other Old World wine regions, such as Germany, where the grape is known as Ruländer, or more commonly, Grauburgunder.\n\nInstruction:\n\nWhat is Pinot Grigio?\n\nAnswer:\n\nPinot Gris, Pinot Grigio (US: /ˈpiːnoʊ ˈɡriːdʒioʊ, -dʒoʊ/, UK: /ˈɡrɪdʒioʊ/) or Grauburgunder is a white wine grape variety of the species Vitis vinifera. Pinot Gris is grown around the globe, with the \"spicy\" full-bodied Alsatian and lighter-bodied, more acidic Italian styles being most widely recognized.\n\n",
    "Context:\n\nSimón José Antonio de la Santísima Trinidad Bolívar y Palacios (24 July 1783 – 17 December 1830) was a Venezuelan military and political leader who led what are currently the countries of Colombia, Venezuela, Ecuador, Peru, Panama and Bolivia to independence from the Spanish Empire. He is known colloquially as El Libertador, or the Liberator of America. Simón Bolívar was born in Caracas in the Captaincy General of Venezuela into a wealthy family of American-born Spaniards (criollo), but lost both parents as a child. Bolívar was educated abroad and lived in Spain, as was common for men of upper-class families in his day. While living in Madrid from 1800 to 1802, he was introduced to Enlightenment philosophy and married María Teresa Rodríguez del Toro y Alaysa, who died in Venezuela from yellow fever in 1803. From 1803 to 1805, Bolívar embarked on a Grand Tour that ended in Rome, where he swore to end the Spanish rule in the Americas. In 1807, Bolívar returned to Venezuela and proposed gaining Venezuelan independence to other wealthy creoles. When the Spanish authority in the Americas weakened due to Napoleon's Peninsular War, Bolívar became a zealous combatant and politician in the Spanish American wars of independence.\n\nInstruction:\n\nGiven this paragraph about Simon Bolivar, tell me when and where they were born, and what they are known for\n\nAnswer:\n\nSimon Bolivar was born in Caracas, Venezuela on 24 July 1783. He is known for leading the wars of independence from the Spanish Empire from what are currently the countries of Colombia, Venezuela, Ecuador, Peru, Panama and Bolivia\n\n",
    "Context:\n\nChinese cuisine encompasses the numerous cuisines originating from China, as well as overseas cuisines created by the Chinese diaspora. Because of the Chinese diaspora and historical power of the country, Chinese cuisine has influenced many other cuisines in Asia and beyond, with modifications made to cater to local palates. Chinese food staples such as rice, soy sauce, noodles, tea, chili oil, and tofu, and utensils such as chopsticks and the wok, can now be found worldwide.\n\nThe preferences for seasoning and cooking techniques of Chinese provinces depend on differences in social class, religion, historical background, and ethnic groups. Geographic features including mountains, rivers, forests, and deserts also have a strong effect on the local available ingredients, considering that the climate of China varies from tropical in the south to subarctic in the northeast. Imperial royal and noble preference also plays a role in the change of Chinese cuisine. Because of imperial expansion and trading, ingredients and cooking techniques from other cultures have been integrated into Chinese cuisines over time.\n\nThere are numerous regional, religious, and ethnic styles of Chinese cuisine found within China and abroad. Chinese cuisine is highly diverse and most frequently categorized into provincial divisions, although these province-level classifications consist of many more styles within themselves. The most praised Four Great Traditions in Chinese cuisine are Chuan, Lu, Yue, and Huaiyang, representing cuisines of West, North, South, and East China, respectively. The modern Eight Cuisines of China are Anhui (徽菜; Huīcài), Guangdong (粤菜; Yuècài), Fujian (闽菜; Mǐncài), Hunan (湘菜; Xiāngcài), Jiangsu (苏菜; Sūcài), Shandong (鲁菜; Lǔcài), Sichuan (川菜; Chuāncài), and Zhejiang (浙菜; Zhècài) cuisines.\n\n\nA Quanjude cook is slicing Peking roast duck. Peking duck is eaten by rolling pieces of duck with scallion, cucumber and sweet bean sauce using steamed pancakes.\nColor, scent and taste are the three traditional aspects used to describe Chinese food, as well as the meaning, appearance, and nutrition of the food. Cooking should be appraised with respect to the ingredients used, knife work, cooking time, and seasoning.\n\nInstruction:\n\nGiven this paragraph about Chinese cuisine, tell me what are the sub-cuisines, and what made them different.\n\nAnswer:\n\nThe modern Chinese cuisine were broken down into 8 different styles of local cuisine, which are Anhui, Guangdong, Fujian, Hunan , Jiangsu , Shandong, Sichuan, and Zhejiang cuisines. They are different because of many reasons, such as geographic features and climate which shaped the locals to specialize in certain ingredients or flavors, as well as religion and ethnic groups.\n\n",
    "Context:\n\nFounded in 1902 as Madrid Football Club, the club has traditionally worn a white home kit since its inception. The honorific title real is Spanish for \"royal\" and was bestowed to the club by King Alfonso XIII in 1920 together with the royal crown in the emblem. Real Madrid have played their home matches in the 81,044-capacity Santiago Bernabéu Stadium in downtown Madrid since 1947. Unlike most European sporting entities, Real Madrid's members (socios) have owned and operated the club throughout its history. The club is one of the most widely supported in the world, and was estimated to be worth $5.1 billion in 2022, making it the world's most valuable football team. In 2021, it was the second highest-earning football club in the world, with an annual revenue of €640.7 million.\n\nInstruction:\n\nGiven a reference text about the history of Real Madrid Football Club, tell me the year it was founded and the name of its current stadium.\n\nAnswer:\n\nReal Madrid was founded in 1902 as Madrid Football Club. Its current stadium, where they play their home matches, is Santiago Bernabeu Stadium.\n\n",
    "Context:\n\nThe Driftwood River is a 15.5-mile-long (24.9 km) tributary of the East Fork of the White River in central Indiana in the United States. Via the White, Wabash and Ohio rivers, it is part of the watershed of the Mississippi River. It is a short river, formed by the confluence of two longer streams a short distance upstream of its mouth.\n\nCourse\nThe Driftwood River is formed in southeastern Johnson County, 1 mile (1.6 km) west of Edinburgh, by the confluence of Sugar Creek and the Big Blue River. It flows generally southwardly through northwestern Bartholomew County to Columbus, where it joins the Flatrock River to form the East Fork of the White River.\n\nNear Edinburgh, IN, Driftwood River has a mean annual discharge of 1,210 cubic feet per second.[\n\nInstruction:\n\nGiven a reference text about the Driftwood River, tell me what main river it is part of.\n\nAnswer:\n\nThe Driftwood River is part of the Mississippi River.\n\n",
    "Context:\n\nThe domestication of cattle in Africa preceded agriculture and seems to have existed alongside hunter-gatherer cultures. It is speculated that by 6000 BCE, cattle were domesticated in North Africa. In the Sahara-Nile complex, people domesticated many animals, including the donkey and a small screw-horned goat which was common from Algeria to Nubia.\nBetween 10,000 and 9,000 BCE, pottery was independently invented in the region of Mali in the savannah of West Africa.\nIn the steppes and savannahs of the Sahara and Sahel in Northern West Africa, people possibly ancestral to modern Nilo-Saharan and Mandé cultures started to collect wild millet, around 8000 to 6000 BCE. Later, gourds, watermelons, castor beans, and cotton were also collected. Sorghum was first domesticated in Eastern Sudan around 4000 BCE, in one of the earliest instances of agriculture in human history. Its cultivation would gradually spread across Africa, before spreading to India around 2000 BCE.\n\nInstruction:\n\nIn Africa, were cattle domesticated before or after agriculture?\n\nAnswer:\n\nIn Africa, cattle were domesticated before agriculture.\n\n",
    "Context:\n\nOver the years, experimentalists have constructed small-scale quantum computers using trapped ions and superconductors. In 1998, a two-qubit quantum computer demonstrated the feasibility of the technology, and subsequent experiments have increased the number of qubits and reduced error rates. In 2019, Google AI and NASA announced that they had achieved quantum supremacy with a 54-qubit machine, performing a computation that is impossible for any classical computer. However, the validity of this claim is still being actively researched.\n\nInstruction:\n\nWhich year was quantum computer demonstrated to be possible?\n\nAnswer:\n\n1998\n\n",
    "Context:\n\nIngwelala is a private stakeholder nature reserve on the bank of the Nhlaralumi River in the heart of the lowveld, about 65 km from the town of Hoedspruit. The reserve of some 3,000 hectares forms part of the Bushbuckridge Municipality, and adjoins the Umbabat Nature Reserve and the unfenced Kruger National Park.\n\nIngwelala includes the following game farms:\n\nArgyle – 1,499 ha registered as Ingwelala Shareblock Ltd.\nBuffelsbed – 1,018 ha registered as Buffelsbed Shareblock Ltd.\nGoedehoop – 372 ha registered as Ingwelala Holdings Ltd.\nSi Bon – 257 ha registered as Si Bon Property Holdings Ltd\n\nInstruction:\n\nGiven a reference text about Ingwelala, tell me which game farms are on the reserve.\n\nAnswer:\n\nArgyle, Buffelsbed, Goedehoop, and Si Bon are the game farms on Ingwelala.\n\n",
    "Context:\n\n\"Chard or Swiss chard (/tʃɑːrd/; Beta vulgaris subsp. vulgaris, Cicla Group and Flavescens Group) is a green leafy vegetable. In the cultivars of the Flavescens Group, the leaf stalks are large and often prepared separately from the leaf blade; the Cicla Group is the leafy spinach beet. The leaf blade can be green or reddish; the leaf stalks are usually white, yellow or red.\n\nChard, like other green leafy vegetables, has highly nutritious leaves. Chard has been used in cooking for centuries, but because it is the same species as beetroot, the common names that cooks and cultures have used for chard may be confusing; it has many common names, such as silver beet, perpetual spinach, beet spinach, seakale beet, or leaf beet.\"\n\nInstruction:\n\nWhat color is Perpetual Spinach?\n\nAnswer:\n\nThe leaf blade can be green or reddish; the leaf stalks are usually white, yellow or red.\n\n",
    "Context:\n\nThe franchise was founded in Philadelphia in 1883, replacing the team from Worcester, Massachusetts, in the National League. The team has played at several stadiums in the city, beginning with Recreation Park (1883–1886) and continuing at Baker Bowl (1887–1938); Shibe Park (which was renamed Connie Mack Stadium in 1953 in honor of the longtime Philadelphia Athletics manager Connie Mack) (1938–1970); Veterans Stadium (1971–2003), and now Citizens Bank Park (2004-present).\n\nInstruction:\n\nGiven this reference text about the Philadelphia Phillies, how many stadiums have they had and where do they play currently?\n\nAnswer:\n\nThe Phillies have played in five different stadium throughout their history in Philadelphia. They currently play at Citizens Bank Park.\n\n",
    "Context:\n\nBlockchains are typically managed by a peer-to-peer (P2P) computer network for use as a public distributed ledger, where nodes collectively adhere to a consensus algorithm protocol to add and validate new transaction blocks. Although blockchain records are not unalterable, since blockchain forks are possible, blockchains may be considered secure by design and exemplify a distributed computing system with high Byzantine fault tolerance. A blockchain was created by a person (or group of people) using the name (or pseudonym) Satoshi Nakamoto in 2008 to serve as the public distributed ledger for bitcoin cryptocurrency transactions, based on previous work by Stuart Haber, W. Scott Stornetta, and Dave Bayer. The implementation of the blockchain within bitcoin made it the first digital currency to solve the double-spending problem without the need of a trusted authority or central server. The bitcoin design has inspired other applications and blockchains that are readable by the public and are widely used by cryptocurrencies. The blockchain may be considered a type of payment rail.\n\nInstruction:\n\nGiven this paragraph about blockchain, how did blockchain influence bitcoin cryptocurrency?\n\nAnswer:\n\nBlockchain is the technology that enables the existence of cryptocurrency and bitcoin is the name of the best-known cryptocurrency. The implementation of bitcoin using blockchain made it the first digital currency to solve the double-spending problem without the need of a trusted authority or central server. Bitcoin has inspired other applications and blockchains that are highly available, public, and are widely used by cryptocurrencies.\n\n",
    "Context:\n\nAlthough Rome was successful in the first two Punic Wars, as it vied for dominance with the seafaring Punic city-state of Carthage in North Africa (now Tunisia), it suffered a number of humiliations and damaging reverses in the course of these engagements, especially at the Battle of Cannae in 216 BC. Rome nonetheless managed to win the Second Punic War thanks to Scipio Africanus in 201 BC. After its defeat, Carthage ceased to be a threat to Rome and was reduced to a small territory that was equivalent to what is now northeastern Tunisia.\n\nHowever, Cato the Censor visited Carthage in 152 BC as a member of a senatorial embassy, which was sent to arbitrate a conflict between the Punic city and Massinissa, the king of Numidia. Cato, a veteran of the Second Punic War, was shocked by Carthage's wealth, which he considered dangerous for Rome. He then relentlessly called for its destruction and ended all of his speeches with the phrase, even when the debate was on a completely different matter. The Senate refused to follow him though, especially Publius Cornelius Scipio Nasica Corculum, the son-in-law of Scipio Africanus and the most influential senator. Corculum opposed the war to preserve Roman unity and argued that the fear of a common enemy was necessary to keep the people in check. Like Cato, he ended all his speeches with the same phrase, \"Carthage must be saved\" (Carthago servanda est).\n\nInstruction:\n\nWhy did Cato think that Carthage must be destroyed?\n\nAnswer:\n\nCato felt that Carthage had bounced back too quickly from its defeats in the first two Punic wars, and would have remembered the disastrous defeat at Cannae. He thought that only completely destroying Carthage would remove it as a threat to Rome.\n\n",
    "Context:\n\nA first-degree relative (FDR) is a person's parent (father or mother), full sibling (brother or sister) or child. It constitutes a category of family members that largely overlaps with the term nuclear family, but without spouses.\n\nInstruction:\n\nHow do the definitions of \"first-degree relative\" and \"nuclear family\" differ?\n\nAnswer:\n\nNuclear family includes spouses while first-degree relatives are only blood related.\n\n",
    "Context:\n\nUntil the last ice age, the basin which is now filled by the San Francisco Bay was a large linear valley with small hills, similar to most of the valleys of the Coast Ranges. As the great ice sheets began to melt, around 11,000 years ago, the sea level started to rise. By 5000 BC the sea level rose 300 feet (90 m), filling the valley with water from the Pacific. The valley became a bay, and the small hills became islands.\n\nInstruction:\n\nHow was the San Francisco bay created?\n\nAnswer:\n\nAround 11,000 years ago the earth began to wam and melt the great ice sheets, raising sea levels and filling the valley that the San Francisco Bay now lives in.\n\n",
    "Context:\n\nRound\tCircuit\tDate\n1\tUnited States Circuit of the Americas, Elroy, Texas\t2–3 March\n2\tUnited States Virginia International Raceway, Alton, Virginia\t27–28 April\n3\tCanada Canadian Tire Motorsport Park, Bowmanville, Ontario\t18–19 May\n4\tUnited States Sonoma Raceway, Sonoma, California\t8–9 June\n5\tUnited States Watkins Glen International, Watkins Glen, New York\t31 August–1 September\n6\tUnited States Road America, Elkhart Lake, Wisconsin\t21–22 September\n7\tUnited States Las Vegas Motor Speedway, Las Vegas, Nevada\t19–20 October\n\nInstruction:\n\nGiven this table of races and dates, how many races took place after July? Give the answer as a number.\n\nAnswer:\n\n3\n\n",
    "Context:\n\nThe system was proclaimed complete in 1992, but two of the original Interstates—I-95 and I-70—were not continuous: both of these discontinuities were due to local opposition, which blocked efforts to build the necessary connections to fully complete the system. I-95 was made a continuous freeway in 2018, and thus I-70 remains the only original Interstate with a discontinuity.\n\nI-95 was discontinuous in New Jersey because of the cancellation of the Somerset Freeway. This situation was remedied when the construction of the Pennsylvania Turnpike/Interstate 95 Interchange Project started in 2010 and partially opened on September 22, 2018, which was already enough to fill the gap.\n\nHowever, I-70 remains discontinuous in Pennsylvania, because of the lack of a direct interchange with the Pennsylvania Turnpike at the eastern end of the concurrency near Breezewood. Traveling in either direction, I-70 traffic must exit the freeway and use a short stretch of US-30 (which includes a number of roadside services) to rejoin I-70. The interchange was not originally built because of a legacy federal funding rule, since relaxed, which restricted the use of federal funds to improve roads financed with tolls. Solutions have been proposed to eliminate the discontinuity, but they have been blocked by local opposition, fearing a loss of business.\n\nInstruction:\n\nGiven this paragraph, which two US interstates were not originally continuous? Have they now been made continuous?\n\nAnswer:\n\nThe two discontinuous interstates were the I-95 and the I-70. The I-95 was discontinuous up until September 22, 2018 when the construction of the Pennsylvania Turnpike/Interstate was completed. The I-70, however, remains discontinuous.\n\n",
    "Context:\n\nThe winners were announced during the awards ceremony on February 26, 2017. Moonlight became the first film with an all-black cast and the first LGBT-themed film to win Best Picture. In an event unprecedented in the history of the Oscars, La La Land was incorrectly announced as the Best Picture, and, a few minutes later, the error was corrected and Moonlight was declared the winner. O.J.: Made in America, at 467 minutes, became the longest film to win an Academy Award, surpassing the 431-minute long War and Peace, which won the Academy Award for Best Foreign Language Film in 1969. Following the five-part documentary's win, new academy rules barred any \"multi-part or limited series\" from being eligible for documentary categories. With Casey Affleck winning the Oscar for Best Actor, he and his older brother, Ben Affleck, became the 16th pair of siblings to win Academy Awards. Mahershala Ali became the first Muslim actor to win an Oscar. Viola Davis became the first black person to achieve the Triple Crown of Acting with her Oscar, Emmy, and Tony wins.\n\nInstruction:\n\nHow many parts did O.J.: Made in America have, and could a documentary with the same length win an Oscar today?\n\nAnswer:\n\nO.J.: Made in America had 5 parts. Today, documentaries cannot be multi part, so a 5 part documentary could no longer win an Oscar.\n\n",
    "Context:\n\nSean Dunphy (30 November 1937 – 17 May 2011) was an Irish singer who represented Ireland at the 1967 Eurovision Song Contest, achieving second place with \"If I Could Choose\". He was also the first Irish singer to record in Nashville.\n\nCareer\nBorn in Whitehall, Dublin, Dunphy first became famous in his home country as lead singer with The Hoedowners, a showband led by trumpeter Earl Gill. Between 1966 and 1973, fourteen singles by Sean Dunphy and The Hoedowners entered the Irish Charts including, in 1969, two number ones: \"Lonely Woods of Upton\" and \"When The Fields Were White With Daisies\". In the late 1970s, Dunphy went on to have two further hits as a solo artist.\n\nDespite undergoing a quadruple heart bypass operation in 2007, Sean Dunphy continued to give live performances. In March 2009, he sang many of his greatest hits in a one-off concert at Dublin's National Concert Hall. His last public engagement was at a charity event twenty-four hours before his death.\n\nDunphy died at his home in Baldoyle, County Dublin and is buried at Greenogue cemetery in Ashbourne, County Meath.\n\nSean Dunphy and his wife Lily had four children. His son Brian is a member of the Irish band, The High Kings.\n\nInstruction:\n\nGiven a reference text about Sean Dunphy, tell me where he is buried.\n\nAnswer:\n\nSean Dunphy is buried at Greenogue cemetery in Ashbourne, County Meath.\n\n",
    "Context:\n\nThe Battle of Kuningtou or Battle of Guningtou, also known as the Battle of Kinmen, was a battle fought over Kinmen in the Taiwan Strait during the Chinese Civil War in 1949. The failure of the Communists to take the island left it in the hands of the Kuomintang (Nationalists) and crushed their chances of taking Taiwan to destroy the Nationalists completely in the war.\n\nInstruction:\n\nWho were fighting each other in this battle and what's the consequence of it\n\nAnswer:\n\nChinese Nationalist and Chinese Communists fought this battle during Chinese Civil War in 1949. Chinese Nationalist won the battle which deterred Chinese Communists from taking over Taiwan, the last stronghold of Chinese Nationalist government fled from mainland in 1949 until today.\n\n",
    "Context:\n\nStanley Franklin Browne, DFC & Bar (29 October 1919 – 13 January 2011) was a New Zealand flying ace of the Royal New Zealand Air Force (RNZAF) during the Second World War. He was officially credited with at least five aerial victories.\n\nBorn in Wellington, Browne was a university student when he joined the RNZAF in March 1941. Once his flight training in New Zealand was completed, he proceeded to the United Kingdom to serve with the Royal Air Force. He was posted to No. 485 Squadron in early 1942 but was shot down later in the year over Germany-occupied France. With the help of the French Resistance he avoided the Germans and made his way to the south of France. He was caught when crossing the border into Vichy France and was interned for several weeks. He escaped captivity and eventually back to the United Kingdom. He was transferred to the Middle East where he ferried aircraft before being posted to No. 93 Squadron. He flew Supermarine Spitfires in the Tunisian campaign and in the Allied invasion of Sicily, shooting down a number of German aircraft before being rested in December 1943. After a spell on instructing duties he returned to operational flying with No. 485 Squadron during the final stages of the war in Europe. He briefly commanded the squadron before it was disbanded in August 1945.\n\nReturning to civilian life after the war, he returned to his university studies, becoming a chemist. He briefly served in the New Zealand Territorial Air Force and later became a farmer and then a teacher. He died in 2011, aged 91, at Tauranga.\n\nInstruction:\n\nGiven a reference text about Stanley Franklin Browne, how many aerial victories during World War II did he have and what did he do when he returned from the war.\n\nAnswer:\n\nStanley Franklin Browne was credited with five aerial victories during World War II. After the war, he returned to university and became a chemist.\n\n",
    "Context:\n\nWith sales of over 250 million records worldwide, Rihanna is the second-best-selling female music artist of all time. She has earned 14 number-ones and 32 top-ten singles in the US and 31 top-ten entries in the UK. Her accolades include nine Grammy Awards, 13 American Music Awards (including the Icon Award), 12 Billboard Music Awards, six Guinness World Records, the NAACP's President's Award, and an Academy Award nomination. Time named her one of the 100 most influential people in the world in 2012 and 2018. Forbes ranked her among the top ten highest-paid celebrities in 2012 and 2014. As of 2023, she is the wealthiest female musician, with an estimated net worth of $1.4 billion.\n\nInstruction:\n\nBased on this paragraph about a singer, how many top-ten singles has Rihanna had in the United States?\n\nAnswer:\n\n32\n\n",
    "Context:\n\nThe TV series was starred and created by Justin Fletcher, who plays the characters in all of the comedy sketches and also wrote a few sketches in its first series. Some of the sketches are filmed in the studio, while other sketches are filmed outside; for example, one is filmed at Portmeirion, used for the fictional town of Wiggyville where Captain Adorable's sketches are set from Series 1 to 2. The show is interspersed with a selection of children called the Gigglekids, who tell jokes to Justin himself, in their own section called 'Giggle Box'.\n\nInstruction:\n\nWhat happens during the section called \"Giggle Box\"?\n\nAnswer:\n\nChildren called the Gigglekids tell jokes to Justin.\n\n",
    "Context:\n\nPandemonium 2 is a psychedelic 2.5D game; specifically, it renders characters and environments with polygons and uses a 3D camera to create the appearance of 3-D, while gameplay is actually on a 2-D plane. Players can choose to be either Nikki or Fargus - who each have different specialties - with the option to change for each level. The player characters' abilities have been expanded over those in Pandemonium! with the ability to climb ropes, crawl, and pull themselves up ledges. During the quest, players can earn extra lives by collecting treasure.\n\nUnique powers collected during gameplay may replace, extend or add to previous powers, depending on which character is in play and which power has been obtained. The characters handle the unique powers differently. For instance, collecting the \"fire power\" allows Nikki to shoot destructive fireballs, while it grants Fargus invincibility and a deadly touch, but requires him to constantly move forward. Machines and equipment are also available throughout the game, although they are tied to certain areas.\n\nInstruction:\n\nHow does the \"fire power\" help Fargus?\n\nAnswer:\n\nIt grants Fargus invincibility and a deadly touch.\n\n",
    "Context:\n\nAs an amateur, Fury represented both England and Ireland. Fury represented Ireland three times at international level. He was based out of the Holy Family Boxing Club in Belfast, Northern Ireland, and later switched to the Smithboro Club in County Monaghan, Ireland. In a double international match against an experienced Polish team in 2007, the Irish team lost 12–6 overall; Fury, however, was victorious in both his fights in Rzeszów and Białystok. In another Irish match against the US, Fury won his bout by knockout. He won bronze at the AIBA Youth World Boxing Championships in 2006.\n\nIn England, while representing Jimmy Egan's Boxing Academy in Wythenshawe, Manchester, he participated in the senior national championships in 2006 but was beaten by David Price 22–8. In May 2007, he won the EU Junior Championship, defeating Istvan Bernath in the final. In July 2007 he won silver at the European Junior Championship, losing to Maxim Babanin in the final.\n\nAs a junior, Fury was ranked number three in the world behind the Russians Maxim Babanin and Andrey Volkov, but did not get the chance to represent Great Britain at the 2008 Olympics because each country is restricted to one boxer per weight division and David Price was selected. Price came up through the amateur Olympic programme. Fury also unsuccessfully tried to qualify for Ireland. Speaking in 2011, Fury said \"I should have gone to the Olympic games in 2008 and won a gold medal for Ireland, but I was denied the chance to go and do it\" He was also forced to withdraw from the Irish national championships after officials from the Holy Trinity Boxing Club in West Belfast, the club of the then Irish amateur heavyweight champion, submitted a protest regarding his eligibility as he was not born in Ireland.\n\nFury won the ABA super-heavyweight title in 2008 by defeating Damien Campbell 19:1. He turned professional later that year. Feeling disillusioned with amateur boxing, he decided not to wait for the 2012 Olympics. He finished with an amateur record of 31–4 (26 KOs).\n\nInstruction:\n\nWhat was Tyson Fury's fight record as an amateur?\n\nAnswer:\n\nHe finished with an amateur record of 31–4 (26 KOs\n\n"
]