[
    "Context:\n\nThe amount of heat energy received at any location on the globe is a direct effect of Sun angle on climate, as the angle at which sunlight strikes Earth varies by location, time of day, and season due to Earth's orbit around the Sun and Earth's rotation around its tilted axis. Seasonal change in the angle of sunlight, caused by the tilt of Earth's axis, is the basic mechanism that results in warmer weather in summer than in winter.Change in day length is another factor.\n\nPresents a case when sunlight shines on Earth at a lower angle (Sun closer to the horizon), the energy of the sunlight is spread over a larger area, and is therefore weaker than if the Sun is higher overhead and the energy is concentrated on a smaller area.\n\nInstruction:\n\nWhy is the sun more intense at high altitude\n\nAnswer:\n\nIt's commonly known that the sun is more intense at higher altitudes. However, contrary to popular belief, the sun is not more intense due to being closer to the sun, but the angle of incidence of the sun. The angle of incidence is steeper, and therefore the density of the sun's  radiant energy is concentrated to a high density in a smaller area. This makes the sun's energy more intense\n\n",
    "Context:\n\nEverything Everywhere All At Once is the most awarded film of all time. The film received a leading 11 nominations at the 95th Academy Awards, and won a leading seven awards: Best Picture, Best Director, Best Actress (Yeoh), Best Supporting Actor (Quan), Best Supporting Actress (Curtis), Best Original Screenplay, and Best Film Editing,. It also won two Golden Globe Awards, five Critics' Choice Awards (including Best Picture), one BAFTA Award, a record four SAG Awards (including Best Ensemble), a record seven Independent Spirit Awards (including Best Feature), and swept the four major guild awards (DGA, PGA, SAG, and WGA).\n\nInstruction:\n\nGiven this paragraph, in which categories did Everything Everywhere All At Once win an Oscar and how many Academy Awards did the film win in total?\n\nAnswer:\n\nBest Picture, Best Director, Best Actress,  Best Supporting Actor, Best Supporting Actress, Best Original Screenplay, and Best Film Editing. The film won 7 Oscars.\n\n",
    "Context:\n\nSwarcliffe Hall is a large hall that was constructed in 1800 in Birstwith, near Harrogate, England. The current house was built by John Greenwood in 1850, who engaged Major Rohde Hawkins as his architect, and is a Grade II listed building.\n\nThe original Swarcliffe Hall was built on the site c1800 by the Blessard family, however the current hall which was built by the Greenwood family was completed in 1850. Charlotte Brontë was employed as a governess at the hall in 1839 and it is said her time spent there helped inspire her novel Jane Eyre.\n\nPrince Albert Victor, Duke of Clarence and Avondale visited the hall in 1888 and again during the following year whilst opening the New Bath Hospital in nearby Harrogate.\n\nInstruction:\n\nWhich duke visited Swarcliffe Hall in 1888?\n\nAnswer:\n\nPrince Albert Victor\n\n",
    "Context:\n\nMichał Rozenfeld (born 1916, died September 2, 1943, in Krawcowizna) – a Jewish resistance activist during the Second World War, participant of the Warsaw Ghetto uprising, partisan of the Mordechai Anielewicz Unit of the People's Guard.\n\nBefore the outbreak of the war, he studied psychology with, among others, Tadeusz Kotarbiński. After the outbreak of World War II, Rozenfeld was sent to the Warsaw Ghetto, where he worked as a teacher. He belonged to the Polish Workers' Party and was a member of the Main Command of the Jewish Combat Organization. He stayed in a bunker with Mordechai Anielewicz at 18 Miła Street. On May 18, 1943, together with a group of Jewish fighters, he got through the sewers to Prosta Street.\n\nAfter the fall of the uprising, Rozenfeld took refuge in forests near Wyszków, where he fought in a unit of the People's Guard. Together with his companions he was handed over to the Germans by a forest ranger from Krawcowizna. Twelve partisans, including Michał Rozenfeld, were killed at that time.\n\nIn 1945 he was posthumously awarded the Silver Cross of the Order of Virtuti Militari.\n\nRozenfeld is buried in a mass grave of the People's Guard partisans in the Jewish cemetery on Okopowa Street in Warsaw (quarter 31, row 3).\n\nInstruction:\n\nGiven a reference text about Michał Rozenfeld, tell me what he did before the war and where he's buried.\n\nAnswer:\n\nMichał Rozenfeld studied psychology before being sent to the Warsaw Ghetto during the war. He is buried at the Jewish Cemetery on Okopowa Street in Warsaw.\n\n",
    "Context:\n\nThe United States version is produced by Mark Burnett and hosted by Jeff Probst, who also serves as an executive producer. Each competition is called a season, has a unique name, and lasts from 13 to 16 episodes. The first season, Survivor: Borneo, was broadcast as a summer replacement show in 2000. Starting with the third season, Survivor: Africa, there have been two seasons aired during each U.S. television season. Starting with the forty-first season, no subtitle has been used in promotion of the season. Instead, the show began following a number format similar to Big Brother and The Amazing Race.\n\nIn the first season, there was a 75-person crew. By season 22, the crew had grown to 325 people.\n\nA total of 662 contestants have competed on Survivor's 44 seasons.\n\nInstruction:\n\nHow many seasons of Survivor has there been?\n\nAnswer:\n\nThere have been 44 seasons of Survivor.\n\n",
    "Context:\n\nIolaus crawshayi, the Crawshay's sapphire, is a butterfly in the family Lycaenidae. It is found in Ethiopia, Somalia, Kenya, Uganda, the Democratic Republic of the Congo and Tanzania. The habitat consists of moist savanna.\n\nThe larvae feed on the young leaves of Erianthemum dregei and Phragmanthera usuiensis. They are dull dirty whitish green or brown.\n\nInstruction:\n\nWhat kind of animal is the Iolaus crawshayi\n\nAnswer:\n\nIolaus crawshayi, the Crawshay's sapphire, is a butterfly in the family Lycaenidae. It is found in Ethiopia, Somalia, Kenya, Uganda, the Democratic Republic of the Congo and Tanzania.\nThe habitat consists of moist savanna.\n\nThe larvae feed on the young leaves of Erianthemum dregei and Phragmanthera usuiensis. They are dull dirty whitish green or brown.\n\n",
    "Context:\n\nBrandon Winn Sanderson (born December 19, 1975) is an American author of high fantasy and science fiction. He is best known for the Cosmere fictional universe, in which most of his fantasy novels, most notably the Mistborn series and The Stormlight Archive, are set. Outside of the Cosmere, he has written several young adult and juvenile series including The Reckoners, the Skyward series, and the Alcatraz series. He is also known for finishing Robert Jordan's high fantasy series The Wheel of Time. Sanderson has created several graphic novel fantasy series, including White Sand and Dark One.\n\nHe created Sanderson's Laws of Magic and popularized the idea of \"hard magic\" and \"soft magic\" systems. In 2008, Sanderson started a podcast with author Dan Wells and cartoonist Howard Tayler called Writing Excuses, involving topics about creating genre writing and webcomics. In 2016, the American media company DMG Entertainment licensed the movie rights to Sanderson's entire Cosmere universe, but the rights have since reverted back to Sanderson. Sanderson's March 2022 Kickstarter campaign became the most successful in history, finishing with 185,341 backers pledging $41,754,153.\n\nInstruction:\n\nWho is Brandon Sanderson?\n\nAnswer:\n\nBrandon Sanderson is an American author who primarily writes high fantasy and science fiction. He is known for creating the Cosmere, a fantasy world in which many of his books are set. Among his notable works Cosmere are The Stormlight Archive and the Mistborn series. Beyond the Cosmere, he is also known for writing YA fiction, such as The Reckoners and Skyward series. Additionally, he is known for popularizing the notions of \"hard\" and \"soft\" magic systems in fantasy worlds.\n\n",
    "Context:\n\nOriginally, PayPal was a money-transfer service offered by a company called Confinity which was acquired by X.com in 1999. Later, X.com was renamed PayPal and purchased by eBay in 2002. The original PayPal employees had difficulty adjusting to eBay's more traditional corporate culture and within four years all but 12 of the first 50 employees had left. They remained connected as social and business acquaintances, and a number of them worked together to form new companies and venture firms in subsequent years. This group of PayPal alumni became so prolific that the term PayPal Mafia was coined. The term gained even wider exposure when a 2007 article in Fortune magazine used the phrase in its headline and featured a photo of former PayPal employees in gangster attire.\n\nInstruction:\n\nWhen did Confinity become eBay ?\n\nAnswer:\n\nConfinity was acquired by X.com in 1999 which was later renamed to PayPal. PayPal was acquired by eBay in 2002.\n\n",
    "Context:\n\nDunk Island, known as Coonanglebah in the Warrgamay and Dyirbal languages, is an island within the locality of Dunk in the Cassowary Coast Region, Queensland, Australia. It lies 4 kilometres (2.5 mi) off the Australian east coast, opposite the town of Mission Beach. The island forms part of the Family Islands National Park and is in the larger Great Barrier Reef World Heritage Area.\n\nInstruction:\n\nWhat is the indigenous name for Dunk Island?\n\nAnswer:\n\nDunk Island is known as Coonanglebah in the Warrgamay and Dyirbal languages.\n\n",
    "Context:\n\nWater fluoridation is the controlled adjustment of fluoride to a public water supply solely to reduce tooth decay. Fluoridated water contains fluoride at a level that is effective for preventing cavities; this can occur naturally or by adding fluoride. Fluoridated water operates on tooth surfaces: in the mouth, it creates low levels of fluoride in saliva, which reduces the rate at which tooth enamel demineralizes and increases the rate at which it remineralizes in the early stages of cavities. Typically a fluoridated compound is added to drinking water, a process that in the U.S. costs an average of about $1.17 per person-year. Defluoridation is needed when the naturally occurring fluoride level exceeds recommended limits. In 2011, the World Health Organization suggested a level of fluoride from 0.5 to 1.5 mg/L (milligrams per litre), depending on climate, local environment, and other sources of fluoride. Bottled water typically has unknown fluoride levels.\n\nTooth decay remains a major public health concern in most industrialized countries, affecting 60–90% of schoolchildren and the vast majority of adults. Water fluoridation reduces cavities in children, while efficacy in adults is less clear. A Cochrane review estimates a reduction in cavities when water fluoridation was used by children who had no access to other sources of fluoride to be 35% in baby teeth and 26% in permanent teeth. However, this was based on older studies which failed to control for numerous variables, such as increasing sugar consumption as well as other dental strategies. Most European countries have experienced substantial declines in tooth decay, though milk and salt fluoridation is widespread in lieu of water fluoridation. Recent studies suggest that water fluoridation, particularly in industrialized nations, may be unnecessary because topical fluorides (such as in toothpaste) are widely used, and caries rates have become low.\n\nAlthough fluoridation can cause dental fluorosis, which can alter the appearance of developing teeth or enamel fluorosis, the differences are mild and usually not an aesthetic or public health concern. There is no clear evidence of other side effects from water fluoridation. Fluoride's effects depend on the total daily intake of fluoride from all sources. Drinking water is typically the largest source; other methods of fluoride therapy include fluoridation of toothpaste, salt, and milk. The views on the most efficient method for community prevention of tooth decay are mixed. The Australian government states that water fluoridation is the most effective way to achieve fluoride exposure that is community-wide. The World Health Organization reports that water fluoridation, when feasible and culturally acceptable, has substantial advantages, especially for subgroups at high risk, while the European Commission finds no benefit to water fluoridation compared with topical use.\n\nPublic water fluoridation was first practiced in the U.S. As of 2012, 25 countries have artificial water fluoridation to varying degrees, 11 of them have more than 50% of their population drinking fluoridated water. A further 28 countries have water that is naturally fluoridated, though in many of them the fluoride is above the optimal level. As of 2012, about 435 million people worldwide received water fluoridated at the recommended level (i.e., about 5.4% of the global population).: 56  About 214 million of them live in the United States. Major health organizations such as the World Health Organization and FDI World Dental Federation supported water fluoridation as safe and effective. The Centers for Disease Control and Prevention lists water fluoridation as one of the ten great public health achievements of the 20th century in the U.S. Despite this, the practice is controversial as a public health measure. Some countries and communities have discontinued fluoridation, while others have expanded it. Opponents of the practice argue that neither the benefits nor the risks have been studied adequately, and debate the conflict between what might be considered mass medication and individual liberties.\n\nInstruction:\n\nTell me about water fluoridation\n\nAnswer:\n\nWater fluoridation is the controlled adjustment of fluoride to a public water supply solely to reduce tooth decay. Fluoridated water contains fluoride at a level that is effective for preventing cavities; this can occur naturally or by adding fluoride. Fluoridated water operates on tooth surfaces: in the mouth, it creates low levels of fluoride in saliva, which reduces the rate at which tooth enamel demineralizes and increases the rate at which it remineralizes in the early stages of cavities. Typically a fluoridated compound is added to drinking water, a process that in the U.S. costs an average of about $1.17 per person-year. Defluoridation is needed when the naturally occurring fluoride level exceeds recommended limits. In 2011, the World Health Organization suggested a level of fluoride from 0.5 to 1.5 mg/L (milligrams per litre), depending on climate, local environment, and other sources of fluoride. Bottled water typically has unknown fluoride levels.\n\nTooth decay remains a major public health concern in most industrialized countries, affecting 60–90% of schoolchildren and the vast majority of adults. Water fluoridation reduces cavities in children, while efficacy in adults is less clear. A Cochrane review estimates a reduction in cavities when water fluoridation was used by children who had no access to other sources of fluoride to be 35% in baby teeth and 26% in permanent teeth. However, this was based on older studies which failed to control for numerous variables, such as increasing sugar consumption as well as other dental strategies. Most European countries have experienced substantial declines in tooth decay, though milk and salt fluoridation is widespread in lieu of water fluoridation. Recent studies suggest that water fluoridation, particularly in industrialized nations, may be unnecessary because topical fluorides (such as in toothpaste) are widely used, and caries rates have become low.\n\nAlthough fluoridation can cause dental fluorosis, which can alter the appearance of developing teeth or enamel fluorosis, the differences are mild and usually not an aesthetic or public health concern. There is no clear evidence of other side effects from water fluoridation. Fluoride's effects depend on the total daily intake of fluoride from all sources. Drinking water is typically the largest source; other methods of fluoride therapy include fluoridation of toothpaste, salt, and milk. The views on the most efficient method for community prevention of tooth decay are mixed. The Australian government states that water fluoridation is the most effective way to achieve fluoride exposure that is community-wide. The World Health Organization reports that water fluoridation, when feasible and culturally acceptable, has substantial advantages, especially for subgroups at high risk, while the European Commission finds no benefit to water fluoridation compared with topical use.\n\nPublic water fluoridation was first practiced in the U.S. As of 2012, 25 countries have artificial water fluoridation to varying degrees, 11 of them have more than 50% of their population drinking fluoridated water. A further 28 countries have water that is naturally fluoridated, though in many of them the fluoride is above the optimal level. As of 2012, about 435 million people worldwide received water fluoridated at the recommended level (i.e., about 5.4% of the global population). 56  About 214 million of them live in the United States. Major health organizations such as the World Health Organization and FDI World Dental Federation supported water fluoridation as safe and effective. The Centers for Disease Control and Prevention lists water fluoridation as one of the ten great public health achievements of the 20th century in the U.S. Despite this, the practice is controversial as a public health measure. Some countries and communities have discontinued fluoridation, while others have expanded it. Opponents of the practice argue that neither the benefits nor the risks have been studied adequately, and debate the conflict between what might be considered mass medication and individual liberties.\n\n",
    "Context:\n\nThe Yorkshire Terrier is a British breed of toy dog of terrier type. It is among the smallest of the terriers and indeed of all dog breeds, with a weight of no more than 3.2 kg. It originated in the nineteenth century in the English county of Yorkshire, for which it is named. Their coats are typically tan on the head with a dark steel-grey body, but they can come in a variety of colors.\n\nIt is a playful and energetic dog, usually kept as a companion dog. It has contributed to the development of other breeds including the Silky Terrier, and also to cross-breeds such as the Yorkipoo.\n\nInstruction:\n\nGiven this reference on Yorkshire Terriers, tell me where they originate from, and what are their typical size and color.\n\nAnswer:\n\nYorkshire Terrier originated from English county of Yorkshire, it has a small size with weight of no more than 3.2 kg. They have a variety of colors but typically their coats are tan on the head and dark steel-grey on the body.\n\n",
    "Context:\n\nThis article is about 21st century genre and overarching term for West African pop music. For the 1960s/1970s genre made by artists such as Fela Kuti and Tony Allen, see Afrobeat. For the British genre popularised by J Hus, see Afroswing.\n\nInstruction:\n\nWhat is the history of Afrobeats?\n\nAnswer:\n\nAfrobeats (not to be confused with Afrobeat or Afroswing), or Afro-pop or Afro-fusion (or Afropop or Afrofusion), is an umbrella term to describe popular music from West Africa and the diaspora that initially developed in Nigeria, Ghana, and the UK in the 2000s and 2010s. Afrobeats is less of a style per se, and more of a descriptor for the fusion of sounds flowing out of Ghana and Nigeria. Genres such as hiplife, jùjú music, highlife and naija beats, among others, were amalgamated under the 'Afrobeats' umbrella.\n\n",
    "Context:\n\nIn 2019, Virginia men's basketball won the NCAA Championship in \"March Madness\", the single-elimination national college basketball tournament considered by YouGov polled American viewers (as of the same year) to be the most exciting collegiate sporting event. In 2015, when Virginia first won its first Capital One Cup its teams won the 2014 College Cup, the 2015 College World Series, and the 2015 NCAA Tennis Championships. When it repeated the feat in 2019, the program won both March Madness and the 2019 Men's Lacrosse Championship.\n\nInstruction:\n\nAccording to this paragraph, tell me what is referred to as the most exciting collegiate sporting event.\n\nAnswer:\n\nWhat is referred to as the most exciting collegiate sporting event is when the Virginia men's basketball team won the NCAA Championship in 2019.\n\n",
    "Context:\n\nThe Grateful Dead was founded in the San Francisco Bay Area amid the rise of the counterculture of the 1960s. The founding members were Jerry Garcia (lead guitar, vocals), Bob Weir (rhythm guitar, vocals), Ron \"Pigpen\" McKernan (keyboards, harmonica, vocals), Phil Lesh (bass, vocals), and Bill Kreutzmann (drums). Members of the Grateful Dead, originally known as the Warlocks, had played together in various Bay Area ensembles, including the traditional jug band Mother McCree's Uptown Jug Champions. Lesh was the last member to join the Warlocks before they changed their name to the Grateful Dead; replacing Dana Morgan Jr., who had played bass for a few gigs. Drummer Mickey Hart and non-performing lyricist Robert Hunter joined in 1967. With the exception of McKernan, who died in 1973, and Hart, who took time off from 1971 to 1974, the core of the band stayed together for its entire 30-year history. The other official members of the band are Tom Constanten (keyboards; 1968–1970), John Perry Barlow (non-performing lyricist; 1971–1995), Keith Godchaux (keyboards, occasional vocals; 1971–1979), Donna Godchaux (vocals; 1972–1979), Brent Mydland (keyboards, vocals; 1979–1990), and Vince Welnick (keyboards, vocals; 1990–1995). Bruce Hornsby (accordion, piano, vocals) was a touring member from 1990 to 1992, as well as a guest with the band on occasion before and after the tours.\n\nInstruction:\n\nGiven this reference text about the Grateful Dead, tell me who their keyboard players were over the years.\n\nAnswer:\n\nRon \"Pigpen\" McKernan was the original keyboard player of the Grateful Dead. Others to play keyboards for the Grateful Dead include Tom Constanten, Keith Godchaux, Brent Mydland and Vince Welnick.\n\n",
    "Context:\n\nA glass ceiling is a metaphor usually applied to women, used to represent an invisible barrier that prevents a given demographic from rising beyond a certain level in a hierarchy. No matter how invisible the glass ceiling is expressed, it is actually a difficult obstacle to overcome. The metaphor was first used by feminists in reference to barriers in the careers of high-achieving women. It was coined by Marilyn Loden during a speech in 1978. In the United States, the concept is sometimes extended to refer to racial inequality in the United States. Minority women in white-majority countries often find the most difficulty in \"breaking the glass ceiling\" because they lie at the intersection of two historically marginalized groups: women and people of color. East Asian and East Asian American news outlets have coined the term \"bamboo ceiling\" to refer to the obstacles that all East Asian Americans face in advancing their careers. Similarly, a multitude of barriers that refugees and asylum seekers face in their search for meaningful employment is referred to as canvas ceiling.\n\nInstruction:\n\nWhy is the glass ceiling better for minority women?\n\nAnswer:\n\nActually, the glass ceiling is considered worse for minority women, not better. This is because they have to face both racial and gender inequalities.\n\n",
    "Context:\n\nWorld records were not officially recognized by the IAAF until 1 January 2004; previously, the best times for the marathon were referred to as the 'world best'. Courses must conform to IAAF standards for a record to be recognized. However, marathon routes still vary greatly in elevation, course, and surface, making exact comparisons impossible. Typically, the fastest times are set over relatively flat courses near sea level, during good weather conditions and with the assistance of pacesetters.\n\nThe current world record time for men over the distance is 2 hours 1 minute and 09 seconds, set in the Berlin Marathon by Eliud Kipchoge of Kenya on 25 September 2022, an improvement of 30 seconds over the previous record also set in the Berlin Marathon by Eliud Kipchoge, on 16 September 2018.\n\nThe world record for women was set by Brigid Kosgei of Kenya in the Chicago Marathon on 13 October 2019, in 2 hours 14 minutes and 4 seconds who broke the record Paula Radcliffe of Great Britain had set over 16 years earlier at the London Marathon.\n\nInstruction:\n\nGiven the reference text about the marathon, who currently holds the men's record in the marathon?\n\nAnswer:\n\nThe current men's world record in the marathon is held by Eliud Kipchoge, who ran the Berlin Marathon on September 25th 2022 with a time of 2 hours 1 minute and 09 seconds.\n\n",
    "Context:\n\nCave of the Crystals or Giant Crystal Cave (Spanish: Cueva de los cristales) is a cave connected to the Naica Mine at a depth of 300 metres (980 ft), in Naica, Chihuahua, Mexico. It takes the form of a chamber within the limestone host rock of the mine, and is about 109-metre (358 ft) long with a volume of 5,000 to 6,000 cubic metres (180,000 to 210,000 cu ft).\n\nThe chamber contains giant selenite crystals (gypsum, CaSO4 · 2 H2O), some of the largest natural crystals ever found. The largest is 11.40 metres (37.4 ft), with a volume of about 5 cubic metres (180 cu ft), and an estimated mass of 12 tonnes. When not flooded, the cave is extremely hot, with air temperatures reaching up to 58 °C (136 °F) with 90 to 99 percent humidity. This is comparable to temperature records in Death Valley, but with much wetter air. The cave is relatively unexplored because of these factors. Without proper protection, people can only endure approximately ten minutes of exposure at a time.\n\nThe cave was discovered in April 2000 by brothers Juan and Pedro Sánchez while drilling in the mine. As of October 2015, the mine had reflooded and the cavern filled once more with the water rich in minerals required for the crystals to grow.\n\nA group of scientists in the Naica Project have been studying these caverns.\n\nInstruction:\n\nWhy is the Cave of the Crystals or Giant Crystal Cave closed to the public?\n\nAnswer:\n\nThe conditions in the cave are not hospitable, extreme heat and humidity, sharp slippery crystals are lethal for humans.\n\n",
    "Context:\n\nThe 1999 UEFA Champions League final was an association football match between Manchester United of England and Bayern Munich of Germany, played at Camp Nou in Barcelona, Spain, on 26 May 1999, to determine the winner of the 1998–99 UEFA Champions League. Injury time goals from Manchester United's Teddy Sheringham and Ole Gunnar Solskjær cancelled out Mario Basler's early goal for Bayern to give Manchester United a 2–1 win. Referee Pierluigi Collina has cited this match as one of the most memorable of his career, and described the noise from the crowd at the end of the game as being like a \"lion's roar\".\n\nThe two sides had played each other earlier in the competition, having both been drawn in Group D in the group stage; Bayern won the group, while Manchester United qualified for the knockout phase as one of the two best runners-up across all six groups. After beating Inter Milan in the quarter-finals, Manchester United beat another Italian side, Juventus, in the semis to reach the final; meanwhile, Bayern beat fellow Germans Kaiserslautern in the quarter-finals, before overcoming Ukrainian side Dynamo Kyiv in the semis. The victory completed a treble-winning season for Manchester United, after they had won the Premier League and FA Cup. Bayern were also playing for a treble, having won the Bundesliga and reached the DFB-Pokal final, although they went on to lose that match as well.\n\nInstruction:\n\nTell me about the 1999 UEFA champions league final?\n\nAnswer:\n\nThe 1999 Champions league final was won by Manchester United in dramatic fashion when they scored two goals in injury time. Teddy Sheringham and Ole Solskjaer scored late on for United after they'd conceded a goal early in the first half. The victory gave manchester United the \"treble\" and is considered one of the greatest achievements in the history of club football.\n\n",
    "Context:\n\nIn 1950s Japan, university professor Tatsuo Kusakabe and his daughters Satsuki and Mei (approximately ten and four years old, respectively) move into an old house close to the hospital where the girls' mother Yasuko is recovering from a long-term illness. The house is inhabited by small, dark, dust-like house spirits called susuwatari, which can be seen when moving from bright places to dark ones.[note 1] When the girls become comfortable in their new house, the susuwatari leave to find another empty house. Mei later discovers two small spirits who lead her into the hollow of a large camphor tree. She befriends a larger spirit, which identifies itself using a series of roars she interprets as \"Totoro\". Mei thinks Totoro is the troll from her illustrated book Three Billy Goats Gruff, with her mispronouncing troll. Mei falls asleep atop Totoro but when Satsuki finds her, she is on the ground. Despite many attempts, Mei cannot show her family Totoro's tree. Tatsuo comforts her by telling her Totoro will reveal himself when he wants to.\n\nInstruction:\n\nWho are the little Japanese girls who find Totoro?\n\nAnswer:\n\nMei and Satsuki are the two Japanese girls who discover Totoro in the famous Japanese anime My Neighbour Totoro.\n\n",
    "Context:\n\nBabylon 5 is an American space opera television series created by writer and producer J. Michael Straczynski, under the Babylonian Productions label, in association with Straczynski's Synthetic Worlds Ltd. and Warner Bros. Domestic Television. After the successful airing of a test pilot movie on February 22, 1993, Babylon 5: The Gathering, Warner Bros. commissioned the series for production in May 1993 as part of its Prime Time Entertainment Network (PTEN). The show premiered in the US on January 26, 1994, and ran for five 22-episode seasons.\n\nInstruction:\n\nWho wrote the TV series Babylon5?\n\nAnswer:\n\nBabylon 5 is an American television series created by writer and producer J. Michael Straczynski.\n\n",
    "Context:\n\nNeuromancer is a 1984 science fiction novel by American-Canadian writer William Gibson. Considered one of the earliest and best-known works in the cyberpunk genre, it is the only novel to win the Nebula Award, the Philip K. Dick Award, and the Hugo Award. It was Gibson's debut novel and the beginning of the Sprawl trilogy. Set in the future, the novel follows Henry Case, a washed-up hacker hired for one last job, which brings him in contact with a powerful artificial intelligence.\n\nInstruction:\n\nGiven the reference text about the science fiction novel Neuromancer, tell me the novel's author and the name of the main protagonist.\n\nAnswer:\n\nNeuromancer was written by William Gibson and its main protagonist is Henry Case.\n\n",
    "Context:\n\nAfter the Russo-Japanese War, the First Treaty was signed on 30 July 1907 by Motono Ichirō, the Japanese Ambassador in Moscow, and Alexander Izvolsky, the Foreign Minister of Russian. The treaty was divided into two parts: one is open agreement, which respected the treaties concluded between the two countries and China, respected China's independence, promoted open doors, and achieved equal opportunities and another is secret agreement, which defined the scope of Japan's interests in Southern Manchuria and Russia's interests in Northern Manchuria and Japan recognized Russia's interests in Outer Mongolia, and Russia recognized Japan's interests in the Korean Peninsula.\n\nInstruction:\n\nGiven this paragraph about the First Treaty that was signed after the Russo-Japanese War, was there a secret component?\n\nAnswer:\n\nYes. The second part of the First Treaty contained a secret agreement which defined the political scope of each party's interest.\n\n",
    "Context:\n\nAfter winning the 2021 Abu Dhabi Grand Prix, Verstappen became the first Dutch driver to win the Formula One World Championship, and the 34th Formula One World Drivers' Champion. He won his second consecutive Formula One championship the next season.\n\nInstruction:\n\nHow many world championships has Max Verstappen won?\n\nAnswer:\n\nMax Verstappen has won 2 Formula One World Championships. He won his first one in 2021 at the Abu Dhabi Grand Prix. In 2022 he won his second consecutive Formula One championship\n\nAs of the 3rd race of the 2023 season, he is leading the World Championship with 69 points.\n\n",
    "Context:\n\nRajendra Tower (Hindi: राजेंद्र टावर), locally known as Tower Chowk, is a historic clock tower in Gaya, Bihar, India. Built sometime between 1910 and 1914 during the British rule by the-then collector George Oldhum, it was renamed as Rajendra Tower after the first Indian president Dr. Rajendra Prasad in 1981 by the administration of Bihar's Chief Minister Jagannath Mishra. The tower is widely considered to be the symbol of the city.\n\nHistory\nThe clock tower was built during the British Raj by George Oldhum, the-then collector of Gaya district, which was under Bihar and Orissa Province sometime between 1910 and 1914. The clock tower gradually became symbolic for the city of Gaya. After the end of British rule in 1947, the clock tower eventually became the property of the new Indian state of Bihar. It was renamed Rajendra Tower in 1981 after Dr. Rajendra Prasad, the first President of India by the administration of Jagannath Mishra, the-then Chief Minister of Bihar. According to locals, there were four clocks in the tower on each side and people used to hear the chimes of the clock from meters away whereas pedestrians used to match their accurate time by taking the reference of the clock. Due to the presence of the clock tower, the area gradually became a commercial district and goes by the name of Tower Chowk.\n\nInstruction:\n\nWhat was the Tower Chowk renamed?\n\nAnswer:\n\nThe tower Chowk was renamed as Rajendra Tower after the passing of the president Dr. Rajendra Prasad.\n\n",
    "Context:\n\nFatemeh Pahlavi was born in Tehran on 30 October 1928. She was the tenth child of Reza Shah and his fourth and last wife, Esmat Dowlatshahi. Her mother was from the Qajar dynasty and married Reza Shah in 1923. Fatemeh was the full-sister of Abdul Reza Pahlavi, Ahmad Reza Pahlavi, Mahmoud Reza Pahlavi and Hamid Reza Pahlavi.\n\nInstruction:\n\nHow many full siblings did Fatemeh Pahlavi have?\n\nAnswer:\n\n4 siblings: Abdul Reza Pahlavi, Ahmad Reza Pahlavi, Mahmoud Reza Pahlavi and Hamid Reza Pahlavi.\n\n"
]