[
    "Context:\n\nParliamentary elections were held in Norway on 7 October 1957. The result was a victory for the Labour Party, which won 78 of the 150 seats in the Storting. As a result, the Gerhardsen government continued in office.\n\nThis was the last time a single party won a majority of seats on its own in a Norwegian election.\n\nInstruction:\n\nHow many total seats are there?Answer:\n\n150 seats\n\n",
    "Context:\n\nLong short-term memory (LSTM) is an artificial neural network used in the fields of artificial intelligence and deep learning. Unlike standard feedforward neural networks, LSTM has feedback connections. Such a recurrent neural network (RNN) can process not only single data points (such as images), but also entire sequences of data (such as speech or video). This characteristic makes LSTM networks ideal for processing and predicting data. For example, LSTM is applicable to tasks such as unsegmented, connected handwriting recognition, speech recognition, machine translation, speech activity detection, robot control, video games, and healthcare.\n\nInstruction:\n\nGiven this paragraph, what are some examples of long short-term memory (LSTM) use cases?Answer:\n\nLong short-term memory  is used for handwriting recognition,  speech recognition, machine translation, speech activity detection, robot control, video games and healthcare.\n\n",
    "Context:\n\nThe Cycle Messenger World Championships, or CMWCs, are an annual urban cycling competition whereby cycle messengers and cycling enthusiasts showcase their skills in an array of events, many of which simulate everyday tasks for a cycle messenger. Each year, the CMWCs are held in a different city around the world, with each host city designing its own unique course. The highlight of the CMWCs is the main race in which cyclists are given manifests and must pickup and deliver items to various locations around the host city as quickly and efficiently as possible. The total number of pickups and deliveries, or \"drop offs\" is unknown to the messengers before the race, but has been known to reach up to 100 stops and usually takes between 3–4 hours to complete. The cyclist who completes all of the assigned deliveries in the least amount of time wins the race. In addition to the main race there are also several side events which have become increasingly popular over the past few years. These events change yearly depending on the discretion of the host city but usually include backward circles, bike polo, bunnyhop, cargo race, longest skid, sprints, and trackstand.\n\nInstruction:\n\nWhat does CMWCs stand for?Answer:\n\nThe Cycle Messenger World Championships\n\n",
    "Context:\n\nThe marbled newt is typically found in habitats characterized by hilly and forestry terrain, away from open and exposed areas. Marbled newts live in temporary habitats, such as ponds, that are subject to change depending on the climate conditions of the region. When rainfall is high and the temperature is lower, typically in the fall and winter months, adult marbled newts stay in the ponds. However, these shallow ponds are subject to drought in warmer spring and summer months, which forces the marbled newts to remain on land. Due to this constant change in the habitat conditions, marbled newts have the ability to adapt to different climatic conditions and habitat changes.\n\nInstruction:\n\nGiven the reference text below, what problem do Marbled newts' face?Answer:\n\nMarbled newt is forced to remain on the land due to droughts.\n\n",
    "Context:\n\nCats have excellent night vision and can see at only one-sixth the light level required for human vision.: 43  This is partly the result of cat eyes having a tapetum lucidum, which reflects any light that passes through the retina back into the eye, thereby increasing the eye's sensitivity to dim light. Large pupils are an adaptation to dim light. The domestic cat has slit pupils, which allow it to focus bright light without chromatic aberration. At low light, a cat's pupils expand to cover most of the exposed surface of its eyes. The domestic cat has rather poor color vision and only two types of cone cells, optimized for sensitivity to blue and yellowish green; its ability to distinguish between red and green is limited. A response to middle wavelengths from a system other than the rod cells might be due to a third type of cone. This appears to be an adaptation to low light levels rather than representing true trichromatic vision. Cats also have a nictitating membrane, allowing them to blink without hindering their vision.\n\nInstruction:\n\nGiven this paragraph about cat's senses, what light level can domestic house cats see at in comparison to human sight?Answer:\n\nDomestic cats are able to see at one-sixth the light level required for human vision.\n\n",
    "Context:\n\nA number of significant inventions and discoveries have been made by Berkeley faculty members and researchers:\n\nNatural sciences\nEdit\nAtomic bomb – Physics professor J. Robert Oppenheimer was wartime director of Los Alamos National Laboratory and the Manhattan Project.\nCarbon 14 and photosynthesis – Martin Kamen and Sam Ruben first discovered carbon 14 in 1940, and Nobel laureate Melvin Calvin and his colleagues used carbon 14 as a molecular tracer to reveal the carbon assimilation path in photosynthesis, known as Calvin cycle.\nCarcinogens – Identified chemicals that damage DNA. The Ames test was described in a series of papers in 1973 by Bruce Ames and his group at the university.\nChemical elements – 16 elements have been discovered at Berkeley (technetium, astatine, neptunium, plutonium, americium, curium, berkelium, californium, einsteinium, fermium, mendelevium, nobelium, lawrencium, rutherfordium, dubnium, and seaborgium).\nCovalent bond – Gilbert N. Lewis in 1916 described the sharing of electron pairs between atoms, and invented the Lewis notation to describe the mechanisms.\nCRISPR gene editing – Nobel laureate Jennifer Doudna discovers a precise and inexpensive way for manipulating DNA in human cells.\nCyclotron – Ernest O. Lawrence created a particle accelerator in 1934, and was awarded the Nobel Physics Prize in 1939.\nDark energy – Saul Perlmutter and many others in the Supernova Cosmology Project discover the universe is expanding because of dark energy 1998.\nFlu vaccine – Wendell M. Stanley and colleagues discovered the vaccine in the 1940s.\nHydrogen bomb – Edward Teller, the father of hydrogen bomb, was a professor at Berkeley and a researcher at the Lawrence Livermore National Laboratory and the Los Alamos National Laboratory.\nImmunotherapy of cancer – James P. Allison discovers and develops monoclonal antibody therapy that uses the immune system to combat cancer 1992–1995.\nMolecular clock – Allan Wilson discovery in 1967.\nNeuroplasticity – Marian Diamond discovers structural, biochemical, and synaptic changes in brain caused by environmental enrichment 1964\nOncogene – Peter Duesberg discovers first cancer causing gene in a virus 1970s.\nTelomerase – Elizabeth H. Blackburn, Carol Greider, and Jack Szostak discover enzyme that promotes cell division and growth 1985.\nVitamin E – Gladys Anderson Emerson isolates Vitamin E in a pure form in 1952.\n\nInstruction:\n\nWhat are the major innovations and scientific discoveries from UC Berkeley?Answer:\n\nAtomic bomb by J. Robert Oppenheimer, carbon 14 and its photosynthesis, covalent bond, cyclotron, and etc.\n\n",
    "Context:\n\n\"Bloody Mary\" is a song by American singer Lady Gaga recorded for her second studio album Born This Way (2011). Gaga, Fernando Garibay, and Paul \"DJ White Shadow\" Blair wrote and produced it; Clinton Sparks also received producer credit. \"Bloody Mary\" is an electropop song with elements of synth-pop and trance, and features Gregorian chants. Although the song's title is an epithet mostly associated with the English queen Mary Tudor, Gaga assumes the role of biblical figure Mary Magdalene in its lyrics, whom she considered a \"feminine force\" she had worshiped since her childhood in a Catholic girls school. It is one of several tracks on the album with religious themes.\n\nInstruction:\n\nGiven this paragraph about Lady Gaga, which album did \"Bloody Mary\" appear on?Answer:\n\nBorn this Way (2011)\n\n",
    "Context:\n\nDoleshwor Mahadeva (Nepali: डोलेश्वर महादेव) is a Hindu Temple of Lord Shiva located in Suryabinayak, south eastern part of Bhaktapur District, Nepal, and is believed to be the head part of Kedarnath temple located in Uttarakhand, India.\n\nHistory\nFor 4000 years people have been searching for the head of the Panch Kedar temples, a bull who was Shiva in reality, who assumed the shape of a bull to avoid the five Pandava brothers, the heroes of the Mahabharat. The legend goes back to the fabled battle of Kurukshetra fought between the five Pandava brothers and their cousins, the 100 Kaurava brothers, which is the pivot of the Mahabharata. Many folk legends related to the Garhwal region, Lord Shiva and the creation of the Panch Kedar temples are narrated.\n\nA folk legend about Panch Kedar relates to the Pandavas, the heroes of the Hindu epic Mahabharata. The Pandavas defeated and slayed their cousins — the Kauravas in the epic Kurukshetra war. They wished to atone for the sins of committing fratricide (gotra hatya) and Brāhmanahatya (killing of Brahmins — the priest class) during the war. Thus, they handed over the reins of their kingdom to their kin and left in search of lord Shiva and to seek his blessings. First, they went to the holy city of Varanasi (Kashi), believed to be Shiva's favourite city and known for its Kashi Vishwanath Temple. But, Shiva wanted to avoid them as he was deeply incensed by the death and dishonesty at the Kurukshetra war and was, therefore, insensitive to Pandavas' prayers. Therefore, he assumed the form of a bull (Nandi) and hid in the Garhwal region.\n\nNot finding Shiva in Varanasi, the Pandavas went to Garhwal Himalayas. Bhima, the second of the five Pandava brothers, then standing astride two mountains started to look for Shiva. He saw a bull grazing near Guptakashi (“hidden Kashi” — the name derived from the hiding act of Shiva). Bhima immediately recognized the bull to be Shiva. Bhima caught hold of the bull by its tail and hind legs. But the bull-formed Shiva disappeared into the ground to later reappear in parts, with the hump raising in Kedarnath, the arms appearing in Tungnath, the face showing up at Rudranath, the nabhi (navel) and stomach surfacing in Madhyamaheshwar and the hair appearing in Kalpeshwar. The Pandavas pleased with this reappearance in five different forms, built temples at the five places for venerating and worshipping Shiva. The Pandavas were thus freed from their sins. It is also believed that the fore portions of Shiva appeared at Doleshwor Mahadeva Temple, Bhaktapur district Nepal.\n\nA variant of the tale credits Bhima of not only catching the bull, but also stopping it from disappearing. Consequently, the bull was torn asunder into five parts and appeared at five locations in the Kedar Khand of Garhwal region of the Himalayas. After building the Panch Kedar Temples, the Pandavas meditated at Kedarnath for salvation, performed yagna (fire sacrifice) and then through the heavenly path called the Mahapanth (also called Swargarohini), attained heaven or salvation.[citation needed]. The Panch Kedar Temples are constructed in the North-Indian Himalayan Temple architecture with the Kedarnath, Tungnath and Madhyamaheshwar temples looking similar.\n\nAfter completing the pilgrimage of Lord Shiva's darshan at the Panch Kedar Temples, it is an unwritten religious rite to visit Lord Vishnu at the Badrinath Temple, as a final affirmatory proof by the devotee that he has sought blessings of Lord Shiva.\n\nResearch and findings\nThe Hindu activist Bharat Jangam had been researching and claiming that Doleshwar Mahadev is the head part of Kedarnath based on the surprising links between Kedarnath and Doleshwor. The Sculptures of Shive found in both shrines are 4,000 years old. Even a stone scripture found in Doleshwor was written in Sanskrit and Old Nepalese. The priests in both shrines are selected from India's southern states of Karnataka, Andhra Pradesh, Kerala and Tamil Nadu. Both priests affix the word ‘ling’ after their names to convey their proximity to the god as his worshipper and both temples have a cluster of five Shiva shrines. The main deity of both priests is Birbhadra, a companion of Shiva, according to Hindu scriptures. \n\nRecognition\nOn August 22, 2009 the head priest of Kedarnath peeth Shree 1008 Jagat Guru Bheemashankarling Shivacharya unveiled the plaque claiming that Doleswore Mahadev, located in Jangam math Bhaktapur, is the head part of Shri Kedarnath. He performed Rudra Abhishek, a special worshipping at the Doleshwor temple situated in Sipadol village of Bhaktapur district. This is also mentioned in the inscription (Sheela Lekh) at Doleshwar Mahadev. Thousands of devotees have been thronging in the Doleswor Mahadev Temple.\n\nInstruction:\n\nHave you heard of Doleshwor Mahadeva temple?Answer:\n\nYes, Doleshwor Mahadeva (Nepali: डोलेश्वर महादेव) is a Hindu Temple of Lord Shiva located in Suryabinayak, south eastern part of Bhaktapur District, Nepal\n\n",
    "Context:\n\nMetamorphosis is a biological process by which an animal physically develops including birth transformation or hatching, involving a conspicuous and relatively abrupt change in the animal's body structure through cell growth and differentiation. Some insects, fish, amphibians, mollusks, crustaceans, cnidarians, echinoderms, and tunicates undergo metamorphosis, which is often accompanied by a change of nutrition source or behavior. Animals can be divided into species that undergo complete metamorphosis (\"holometaboly\"), incomplete metamorphosis (\"hemimetaboly\"), or no metamorphosis (\"ametaboly\").\n\nInstruction:\n\nWhat type of creatures undergo Metamorphosis?Answer:\n\nSome insects, fish, amphibians, mollusks, crustaceans, cnidarians, echinoderms, and tunicates undergo metamorphosis\n\n",
    "Context:\n\nThe Henry Holst String Quartet was founded by the Danish violinist Henry Holst in 1931. Holst had studied at the Royal Danish Conservatory under Axel Gade and Carl Nielsen. In 1923, he was appointed leader of the Berlin Philharmonic Orchestra, but in 1931 he moved to Manchester as a Professor at the Royal Manchester College of Music.\n\nThe move to Manchester led to the formation of the Henry Holst String Quartet with Charles Taylor (second violin), Herbert Downes (viola) and Anthony Pini (cello). The ensemble was recognised as fine quartet, touring extensively in the UK and broadcasting on BBC Radio. They played a number of times in Liverpool for the Rodewald Concert Society in the 1934 and 1937 seasons.\n\nErnest Element (2nd violin) and Frank Venton (viola) also sometimes played for the quartet. Herbert Downes left to lead his own quartet in 1935. Charles Taylor also left to found his own quartet and was replaced by Reginald Stead as second violin. Reginald Stead later became the leader of the BBC Northern Orchestra. Anthony Pini joined the London Philharmonic Orchestra in 1932 and was replaced by John C Hock as cellist. The Henry Holst Quartet finally disbanded when Henry Holst formed the Philharmonia Quartet in 1941 at the instigation of Walter Legge to record for Columbia Records.\n\nInstruction:\n\nHow long did the Henry Holst String Quartet last with its original group of members based on this text? Explain your work.Answer:\n\nIt lasted for one year before an original member left. The first member to leave was Anthony Pini in 1932. The band was founded when Holst moved to Manchester in 1931. There is one year between these dates.\n\n",
    "Context:\n\nRobert Gordon Orr OC (born March 20, 1948) is a Canadian former professional ice hockey player, widely acknowledged as one of the greatest of all time. Orr used his ice skating speed, scoring, and play-making abilities to revolutionize the position of defenceman. He played in the National Hockey League (NHL) for 12 seasons, the first 10 with the Boston Bruins, followed by two with the Chicago Black Hawks. Orr remains the only defenceman to have won the league scoring title with two Art Ross Trophies. He holds the record for most points and assists in a single season by a defenceman. Orr won a record eight consecutive Norris Trophies as the NHL's best defenceman and three consecutive Hart Trophies as the league's most valuable player (MVP). Orr was inducted into the Hockey Hall of Fame in 1979 at age 31, the youngest to be inducted at that time. In 2017, Orr was named by the National Hockey League as one of the \"100 Greatest NHL Players\" in history.\n\nInstruction:\n\nWhat team did Bobby Orr play for in his 5th season?Answer:\n\nBobby Orr played for the Boston Bruins in his 5th season in the National Hockey League (NHL).\n\nHe played in the NHL for 12 seasons, the first 10 with the Boston Bruins, followed by two with the Chicago Black Hawks.\n\n",
    "Context:\n\nPopsicle is an alternative rock album by indie band Diamond Nights, released in 2005. The song \"The Girl's Attractive\" was featured in a 2006 Jaguar and an Austrian beer (Stiegl) advertisement, as well on the \"Thirst\" and \"Nicodemus\" episodes of the TV drama Smallville, and was included on its second Soundtrack The Metropolis Mix .\n\nInstruction:\n\nBased on this paragrah, what indie band released the album \"Popsicle\"?Answer:\n\nDiamond Nights\n\n",
    "Context:\n\nThomas Edward Patrick Brady Jr. (born August 3, 1977) is a former American football quarterback who played in the National Football League (NFL) for 23 seasons. He spent his first 20 seasons with the New England Patriots and was a central contributor to the franchise's dynasty from 2001 to 2019. In his final three seasons, he was a member of the Tampa Bay Buccaneers. Brady is widely regarded as the greatest quarterback of all time.\n\nInstruction:\n\nGiven a reference text about Tom Brady, tell me when they were born and what they are famous for.Answer:\n\nTom Brady was born on August 3rd, 1977. He is famous for being the greatest quarterback of all time.\n\n",
    "Context:\n\nCorgan's desire for musical perfection put further strain on the already-frayed relationships between the band members. Vig later recalled, \"D'arcy would lock herself in the bathroom, James wouldn't say anything, or Billy would lock himself in the control room\". Corgan often overdubbed Iha's and Wretzky's parts with his own playing. Wretzky stated that Corgan only performed most of the guitar and bass parts because he could lay them down more easily in recording and with far fewer takes. Stories of the album's recording had circulated in the music press. Corgan admitted there was some truth to accusations of tyrannical behavior, though he felt the press misunderstood the situation.\n\nWhile Chamberlin performed all drum parts on the album, he would disappear for days on drug benders that caused everyone to fear for his life. After one incident where the drummer had disappeared for two or three days, Corgan \"put the hammer down\", according to Vig, and had Chamberlin perform the drum part for \"Cherub Rock\" until his hands bled. Due to Corgan's urging, Chamberlin checked into a rehab clinic. Corgan told Spin later that year, \"You know, I gave them a year and a half to prepare for this record... I'm surrounded by these people who I care about very much, yet they continue to keep failing me.\" Corgan explained that he began to take the actions of others personally; he said, \"If you really think about it, of course, someone doesn't do the job because they're lazy, or they don't think it's important. But I took it as, 'You're not worth going home and working on the song.'\"\n\nInstruction:\n\nDid Billy Corgan really play all of the instruments on Smashing Pumpkin's 1993 album \"Siamese Dream\"?Answer:\n\nNo. Jimmy Chamberlin recorded all of the drum parts. However, Billy Corgan often overdubbed the guitar and bass parts with his own playing.\n\n",
    "Context:\n\nOns Jabeur was born to Samira and Ridha Jabeur in Ksar Hellal, a small town in Tunisia. She grew up in the larger nearby coastal town of Sousse. Jabeur has two older brothers, Hatem and Marwen, and an older sister, Yasmine. Her mother played tennis recreationally and introduced her to the sport at the age of three. Jabeur trained under coach Nabil Mlika for ten years from ages four to thirteen, originally starting to work with him at a tennis promotion centre at her school. When she was ten years old, her club did not have their own tennis courts and she could only train on courts at nearby hotels. At twelve years old, Jabeur moved to the capital city of Tunis to train at the Lycée Sportif El Menzah, a national sport high school for the country's up-and-coming athletes, where she stayed for several years.\n\nShe also later trained in Belgium and France starting at the age of 16. Jabeur credits her parents for the sacrifices they made when she was growing up, saying, \"My parents sacrificed a lot of things – my mom used to drive me everywhere around Tunisia to go play the tournaments, and she encouraged me to go to a special school to study. That was a big sacrifice to see her little girl going for a dream that, honestly, wasn't 100% guaranteed. She believed in me and gave me the confidence to be there.\"\n\nInstruction:\n\nWhat sacrifices did Ons's parents make to help her tennis career?Answer:\n\nOns's mother used to drive Ons all around Tunisia to play tennis tournaments and encouraged Ons to go to a special school to study.\n\n",
    "Context:\n\nDame Jane Morris Goodall DBE (/ˈɡʊdɔːl/; born Valerie Jane Morris-Goodall on 3 April 1934), formerly Baroness Jane van Lawick-Goodall, is an English primatologist and anthropologist. She is considered the world's foremost expert on chimpanzees, after 60 years studying the social and family interactions of wild chimpanzees. Goodall first went to Gombe Stream National Park in Tanzania in 1960, where she witnessed human-like behaviours amongst chimpanzees, including armed conflict.[failed verification]\n\nShe is the founder of the Jane Goodall Institute and the Roots & Shoots programme, and she has worked extensively on conservation and animal welfare issues. As of 2022, she is on the board of the Nonhuman Rights Project. In April 2002, she was named a UN Messenger of Peace. Goodall is an honorary member of the World Future Council.\n\nInstruction:\n\nGiven this reference text about Jane Goodall, tell me how old she is, and her most notable accomplishments.Answer:\n\nJane Goodall, 89, is a world-renown primatologist, famous for her study of chimpanzees. She has dedicated her life to conservation and animal welfare issues, and founded the Jane Goodall Institute and the Roots & Shoots programme. She was named a UN Messenger of Peace in 2002, and is an honorary member of the World Future Council.\n\n",
    "Context:\n\nLate 1800s\nOne of the first examples of bicycles modified specifically for off-road use is the expedition of Buffalo Soldiers from Missoula, Montana, to Yellowstone in August 1896.[failed verification]\n\n1900s–1960s\nBicycles were ridden off-road by road racing cyclists who used cyclocross as a means of keeping fit during the winter. Cyclo-cross eventually became a sport in its own right in the 1940s, with the first world championship taking place in 1950.\n\nThe Rough Stuff Fellowship was established in 1955 by off-road cyclists in the United Kingdom.\n\nIn Oregon in 1966, one Chemeketan club member, D. Gwynn, built a rough terrain trail bicycle. He named it a \"mountain bicycle\" for its intended place of use. This may be the first use of that name.\n\nIn England in 1968, Geoff Apps, a motorbike trials rider, began experimenting with off-road bicycle designs. By 1979 he had developed a custom-built lightweight bicycle which was uniquely suited to the wet and muddy off-road conditions found in the south-east of England. They were designed around 2 inch x 650b Nokian snow tires though a 700x47c (28 in.) version was also produced. These were sold under the Cleland Cycles brand until late 1984. Bikes based on the Cleland design were also sold by English Cycles and Highpath Engineering until the early 1990s.\n\n1970s–1980s\nThere were several groups of riders in different areas of the U.S.A. who can make valid claims to playing a part in the birth of the sport. Riders in Crested Butte, Colorado, and Mill Valley, California, tinkered with bikes and adapted them to the rigors of off-road riding. Modified heavy cruiser bicycles, old 1930s and '40s Schwinn bicycles retrofitted with better brakes and fat tires, were used for freewheeling down mountain trails in Marin County, California, in the mid-to-late 1970s. At the time, there were no mountain bikes. The earliest ancestors of modern mountain bikes were based around frames from cruiser bicycles such as those made by Schwinn. The Schwinn Excelsior was the frame of choice due to its geometry. Riders used balloon-tired cruisers and modified them with gears and motocross or BMX-style handlebars, creating \"klunkers\". The term would also be used as a verb since the term \"mountain biking\" was not yet in use. The first person known to fit multiple speeds and drum brakes to a klunker is Russ Mahon of Cupertino, California, who used the resulting bike in cyclo-cross racing. Riders would race down mountain fire roads, causing the hub brake to burn the grease inside, requiring the riders to repack the bearings. These were called \"Repack Races\" and triggered the first innovations in mountain bike technology as well as the initial interest of the public (on Mt. Tamalpais in Marin CA, there is still a trail titled \"Repack\"—in reference to these early competitions). The sport originated in California on Marin County's Mount Tamalpais.\n\nIt was not until the late 1970s and early 1980s that road bicycle companies started to manufacture mountain bicycles using high-tech lightweight materials. Joe Breeze is normally credited with introducing the first purpose-built mountain bike in 1978. Tom Ritchey then went on to make frames for a company called MountainBikes, a partnership between Gary Fisher, Charlie Kelly and Tom Ritchey. Tom Ritchey, a welder with skills in frame building, also built the original bikes. The company's three partners eventually dissolved their partnership, and the company became Fisher Mountain Bikes, while Tom Ritchey started his own frame shop.\n\nThe first mountain bikes were basically road bicycle frames (with heavier tubing and different geometry) with a wider frame and fork to allow for a wider tire. The handlebars were also different in that they were a straight, transverse-mounted handlebar, rather than the dropped, curved handlebars that are typically installed on road racing bicycles. Also, some of the parts on early production mountain bicycles were taken from the BMX bicycle. Other contributors were Otis Guy and Keith Bontrager.\n\nTom Ritchey built the first regularly available mountain bike frame, which was accessorized by Gary Fisher and Charlie Kelly and sold by their company called MountainBikes (later changed to Fisher Mountain Bikes, then bought by Trek, still under the name Gary Fisher, currently sold as Trek's \"Gary Fisher Collection\"). The first two mass-produced mountain bikes were sold in the early 1980s: the Specialized Stumpjumper and Univega Alpina Pro. In 1988, The Great Mountain Biking Video was released, soon followed by others. In 2007, Klunkerz: A Film About Mountain Bikes was released, documenting mountain bike history during the formative period in Northern California. Additionally, a group of mountain bikers called the Laguna Rads formed a club during the mid eighties and began a weekly ride, exploring the uncharted coastal hillsides of Laguna Beach, California. Industry insiders suggest that this was the birth of the freeride movement, as they were cycling up and down hills and mountains where no cycling specific trail network prexisted. The Laguna Rads have also held the longest running downhill race once a year since 1986.\n\nAt the time, the bicycle industry was not impressed with the mountain bike, regarding mountain biking to be short-term fad. In particular, large manufacturers such as Schwinn and Fuji failed to see the significance of an all-terrain bicycle and the coming boom in 'adventure sports'. Instead, the first mass-produced mountain bikes were pioneered by new companies such as MountainBikes (later, Fisher Mountain Bikes), Ritchey, and Specialized. Specialized was an American startup company that arranged for production of mountain bike frames from factories in Japan and Taiwan. First marketed in 1981, Specialized's mountain bike largely followed Tom Ritchey's frame geometry, but used TiG welding to join the frame tubes instead of fillet-brazing, a process better suited to mass production, and which helped to reduce labor and manufacturing cost. The bikes were configured with 15 gears using derailleurs, a triple chainring, and a cogset with five sprockets.\n\nInstruction:\n\nWhen did mountain biking start?Answer:\n\nMountain biking as a sport came into existence in various areas in the USA in the late 1970s and early 1980s.  While many groups of riders in different US locations claim the birthright to mountain biking, it's clear that there wasn't a single person nor a single location that served as the starting point for the sport.  Riders in Crested Butte, CO, Marin County, CA, Mill Valley, CA, Cupertino, CA, and several other locations contributed significantly to the birth of the sport.\n\nIt wasn't until the late 1970s and early 1980s that bicycle companies began manufacturing mountain bikes with specific high-tech lightweight materials that popularized the sport.  Joe Breeze (Marin County) is often credited with building the first, purpose-built mountain bike in 1978.\n\nIt's important to note that there were mountain bike concepts and prototypes built well before this period, with the earliest concept belonging to the off-road bicycles used by the Buffalo Soldiers in 1896.\n\n",
    "Context:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nWrestling career\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. He had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\nInstruction:\n\nWas Wilbur Snyder a good wrestlerAnswer:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. \n\nHe had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\n",
    "Context:\n\nThe 98th General Assembly enacted a total of 1,175 bills into law. Notable among these was the Illinois Religious Freedom and Marriage Fairness Act, which removed legal barriers to same-sex marriage in Illinois. The House of Representatives passed the bill by a 61–54 vote on November 5, 2013, and the Senate passed it by a 32–21 vote. The governor signed the bill into law on November 20, and the law took effect on June 1, 2014.\n\nThe General Assembly also passed the Illinois Bill of Rights for the Homeless, which made Illinois the second state to ban discrimination against the homeless.\n\nThe General Assembly also passed the Firearm Concealed Carry Act (FCCA), a change to Illinois gun law that made Illinois the last state in the country to enact concealed carry. Passed over the governor's veto, the FCCA took effect \"mere hours before the seventh circuit's deadline\" in Moore v. Madigan.\n\nLate in the legislative session, the General Assembly passed a bill that changes the original Illinois wiretapping law adding that in order to commit a criminal offense, a person must be recording \"in a surreptitious manner\". On December 30, 2014, Governor Quinn signed the bill into law as Public Act 098-1142. The bill's sponsors, Elaine Nekritz and Kwame Raoul, claimed the law upholds the rights of citizens to record in public.\n\nThe General Assembly approved five ballot measures for the 2014 Illinois general election, an unusually large number for the state, including three advisory referendums and two constitutional amendments. The constitutional amendments, Marsy's Law and the Illinois Right to Vote Amendment, both passed with the required 60% majority of the popular vote.\n\nInstruction:\n\nhere is a blurb about the 98th Illinois General Assembly, what were the notable laws that were passed?Answer:\n\nremoving the legal barriers to same-sex marriage, banning discrimination against homeless people, conceal and carry firearms, and revising the wiretapping laws so that citizens can record in public.\n\n",
    "Context:\n\nAyrton Senna began his motorsport career in karting, moved up to open-wheel racing in 1981 and won the 1983 British Formula Three Championship. He made his Formula One debut with Toleman-Hart in 1984, before moving to Lotus-Renault the following year and winning six Grands Prix over the next three seasons. In 1988, he joined Frenchman Alain Prost at McLaren-Honda. Between them, they won all but one of the 16 Grands Prix that year, and Senna claimed his first World Championship. Prost claimed the championship in 1989, and Senna his second and third championships in 1990 and 1991. In 1992, the Williams-Renault combination began to dominate Formula One. Senna nonetheless managed to finish the 1993 season as runner-up, winning five races and negotiating a move to Williams in 1994.\n\nInstruction:\n\nGiven this paragraph, who was Ayrton Senna's teammate at McLaren-Honda?Answer:\n\nWhile at McLaren-Honda, Alain Prost was Ayrton Senna's teammate.\n\n",
    "Context:\n\nJordan (Arabic: الأردن, tr. Al-ʾUrdunn [al.ʔur.dunː]), officially the Hashemite Kingdom of Jordan, is a country in Western Asia. It is situated at the crossroads of Asia, Africa, and Europe, within the Levant region, on the East Bank of the Jordan River. Jordan is bordered by Saudi Arabia to the south and east, Iraq to the northeast, Syria to the north, and the Palestinian West Bank, Israel, and the Dead Sea to the west. It has a 26 km (16 mi) coastline in its southwest on the Gulf of Aqaba's Red Sea, which separates Jordan from Egypt. Amman is Jordan's capital and largest city, as well as its economic, political, and cultural centre.\n\nInstruction:\n\nGiven this paragraph about Jordan, tell me where it is located and which countries it borders?Answer:\n\nJordan is a country in Western Asia and it is border by Saudi Arabia, Iraq, Syria, Palestine, and Israel.\n\n",
    "Context:\n\nElizabeth II (Elizabeth Alexandra Mary; 21 April 1926 – 8 September 2022) was Queen of the United Kingdom and other Commonwealth realms from 6 February 1952 until her death in 2022. She was queen regnant of 32 sovereign states during her lifetime and was head of state of 15 realms at the time of her death. Her reign of 70 years and 214 days was the longest of any British monarch and the longest verified reign of any female monarch in history.\n\nInstruction:\n\nWho was Elizabeth II?Answer:\n\nElizabeth II was the queen of the United Kingdom and the longest-reigning monarch.\n\n",
    "Context:\n\nAllegory of Peace or Triumph of Peace is a 1652 oil-on-canvas painting by Dutch artist Jan Lievens. The painting represents the 1648 Treaty of Münster and depicts Minerva, the goddess of wisdom, crowning Pax, the goddess of peace.\n\nInstruction:\n\nGiven this paragraph about the Allegory of Peace, what does it represent?Answer:\n\nThe painting represents the 1648 Treaty of Münster and depicts Minerva, the goddess of wisdom, crowning Pax, the goddess of peace.\n\n",
    "Context:\n\nAge of Empires is a series of historical real-time strategy video games, originally developed by Ensemble Studios and published by Xbox Game Studios. The first game was Age of Empires, released in 1997. Nine total games within the series have been released so far as of October 28, 2021.\n\nAge of Empires focused on events in Europe, Africa and Asia, spanning from the Stone Age to the Iron Age; the expansion game explored the formation and expansion of the Roman Empire. The sequel, Age of Empires II: The Age of Kings, was set in the Middle Ages, while its expansion focused partially on the Spanish conquest of the Aztec Empire. The subsequent three games of Age of Empires III explored the early modern period, when Europe was colonizing the Americas and several Asian nations were on the decline. Another installment, Age of Empires Online, takes a different approach as a free-to-play online game utilizing Games for Windows Live. A spin-off game, Age of Mythology, was set in the same period as the original Age of Empires, but focused on mythological elements of Greek, Egyptian, and Norse mythology. The fourth main installment in the series, Age of Empires IV, was released on October 28, 2021.\n\nThe Age of Empires series has been a commercial success, selling over 25 million copies. Critics have credited part of the success of the series to its historical theme and fair play; the artificial intelligence (AI) players have fewer advantages than in many of the series' competitors.\n\nInstruction:\n\nWhat is Age of Empires?Answer:\n\nAge of Empires is a classic PC game originally developed by Microsoft, released in 1997. It has 4 versions now and is still being played online by many players.\n\n",
    "Context:\n\nDon't Starve is a survival video game developed by the Canadian indie video game developer Klei Entertainment. The game was initially released for Microsoft Windows, OS X, and Linux on April 23, 2013. A PlayStation 4 port, renamed Don't Starve: Giant Edition, became available the following year (with PlayStation Vita and PlayStation 3 versions released in September 2014 and June 2015 respectively, and an Xbox One version released in August 2015). Don't Starve for iOS, renamed Don't Starve: Pocket Edition was released on July 9, 2015. An Android version was released on October 20, 2016. Downloadable content titled Reign of Giants was released on April 30, 2014, and a multiplayer standalone expansion called Don't Starve Together became free for existing users on June 3, 2015. On Steam, this game is able to be purchased with a free copy for a friend. A Nintendo Switch port came out on April 12, 2018.\nThe game follows a scientist named Wilson who finds himself in a dark, dreary parallel world known as the Constant and must survive as long as possible. To this end, the player must keep Wilson alive, fed, and mentally stable as he avoids a variety of surreal and supernatural enemies that will try to kill and devour him. The game's Adventure mode adds depth to the sparse plot and pits Wilson against the game's supposed antagonist, Maxwell.\nDon't Starve was Klei's first foray into the survival genre. Conceived during the height of a game industry trend of dropping players into a world with few instructions and a goal of survival, the game was influenced by Minecraft which spearheaded this trend as well as by filmmaker Tim Burton. The game received positive reviews from critics, commended for its original art style, music, and variety of ways for the player to die, although its high level of difficulty and implementation of permanent death were less warmly received.\n\nInstruction:\n\nWhat is Don’t Starve Together?Answer:\n\nDon't Starve Together is a cooperative multiplayer survival game developed by Klei Entertainment, where up to six players can play together online or offline. Players take on the role of a band of characters in a harsh wilderness world, and must work together to keep alive, fed, and mentally stable as they avoid a variety of surreal and supernatural enemies that will try to kill and devour them. The game features a unique hand-drawn art style, as well as randomly generated worlds, providing a new experience with each playthrough.\n\n"
]