[
    "Context:\n\nThe Battle of Issus (also Issos) occurred in southern Anatolia, on 5 November 333 BC between the Hellenic League led by Alexander the Great and the Achaemenid Empire, led by Darius III. It was the second great battle of Alexander's conquest of Asia, and the first encounter between Darius III and Alexander the Great. The battle resulted in the Macedonian troops defeating the Persian forces.\n\nAfter the Hellenic League soundly defeated the Persian satraps of Asia Minor (led by Greek mercenary Memnon of Rhodes) at the Battle of the Granicus, Darius took personal command of his army. He gathered reinforcements and proceeded to lead his men in a surprise march behind the Hellenic advance, in order to cut off their line of supply. Alexander was forced to countermarch, and the stage was set for the battle near the mouth of the Pinarus River and the town of Issus.\n\nInstruction:\n\nGiven this paragraph about battles under Alexander the Great what battle occurred prior to the battle of IssusAnswer:\n\nthe Battle of the Granicus\n\n",
    "Context:\n\nMaison Ikkoku is a manga series written and illustrated by Rumiko Takahashi. It was serialized in Shogakukan's Big Comic Spirits from November 15, 1980 to April 20, 1987. It has been adapted into an anime series and a live action film and two episode TV drama. The plot follows Yusaku Godai, a rōnin who resides in an old apartment complex named Maison Ikkoku as he studies for the university entrance exam. Yusaku's life progression and interactions progress episodically and focuses on his growing relationship with the apartment manager, Kyoko Otonashi.\n\nInstruction:\n\nIs Maison Ikkoku a manga seriesAnswer:\n\nMaison Ikkoku is a manga series written and illustrated by Rumiko Takahashi. It was serialized in Shogakukan's Big Comic Spirits from November 15, 1980 to April 20, 1987. It has been adapted into an anime series and a live action film and two episode TV drama.\n\n",
    "Context:\n\nStevan L. Davies (born 1948) is an author and Emeritus Professor of Religious Studies at Misericordia University in Dallas, Pennsylvania. His most notable work has been in the analysis of Christian apocrypha, especially the Gospel of Thomas. He is married to Sally Watkins Davies and has two children, Michael L. Davies and Meredith G. Russell.[citation needed]\n\nDavies holds a bachelor's degree from Duke University and a doctorate in philosophy from Temple University.\n\nHe was Professor of Religious Studies at Misericordia University from 1979 to 2015.\n\nInstruction:\n\nGiven a reference text about Stevan L. Davies, tell me where he went to college.Answer:\n\nStevan L. Davies went to college at Duke University for his bachelor's degree and Temple University for his doctorate in philosophy.\n\n",
    "Context:\n\nIn 2018, the United States Air Force (USAF) and Boeing discussed the F-15X or Advanced F-15, a proposed single-seat variant based on the F-15QA to replace USAF F-15C/Ds. Improvements included the AMBER weapons rack to carry up to 22 air-to-air missiles, infrared search and track, advanced avionics and electronic warfare equipment, AESA radar, and revised structure with a service life of 20,000 hours. Single and two-seat variants were proposed, called F-15CX and F-15EX respectively, with identical capabilities. The USAF opted for the two-seat variant, which can be flown either by a single pilot or by a pilot and WSO for complex missions and, someday, controlling collaborative combat aircraft. One reason for this decision is that only two–seat F-15 models remained in production.\n\nThe USAF bought the F-15EX to maintain fleet size as F-22 production ended, the F-35 was delayed, and its F-15Cs aged. Although it is not expected to survive against modern air defenses by 2028, the F-15EX can perform homeland and airbase defense, enforce no-fly zones against limited air defenses, and deploy standoff munitions. In July 2020, the U.S. Defense Department ordered eight F-15EXs over three years for $1.2 billion. In August 2020, the USAF announced plans to replace F-15Cs in the Florida and Oregon Air National Guards with F-15EXs. The F-15EX made its maiden flight on 2 February 2021. The first F-15EX was delivered to the USAF in March 2021, and was flown to Eglin Air Force Base in Florida for further testing.\n\nOn 7 April 2021, its official name Eagle II was announced. The FY2021 defense appropriations bill funded F-15EX procurement at $1.23 billion for 12 aircraft, bringing total orders to 20 aircraft. By May 2022, the USAF had ordered 144 F-15EXs. It has proposed reducing its orders to 80. The first operational F-15EXs are not to receive conformal fuel tanks. The Air Force's proposed budget for fiscal 2024 includes funds to buy 24 more F-15EXs, which would bring the planned fleet up to 104 aircraft.\n\nInstruction:\n\nWhy is the F-15EX Eagle II an ideal aircraft not an ideal aircraft for conducting modern offensive war fighting?Answer:\n\nThe Boeing F-15EX Eagle II is not expected to survive against modern air defenses by 2028.  Due to the long time horizon for military hardware acquisition this does not make this aircraft suitable for many offensive war fighting missions over the coming years.\n\n",
    "Context:\n\nBrazilian jiu-jitsu was initially developed in 1925 by Brazilian brothers Carlos, Oswaldo, Gastão Jr., George, and Hélio Gracie, after Carlos was taught jiu-jitsu by a travelling Japanese judoka, Mitsuyo Maeda, who himself mastered his ground fighting while interacting with Taro Miyake (Tanabe student), Sadakazu Uyenishi (Handa, Tanabe) and Yukio Tani (Tenjin Shinyo-ryu) and catch wrestlers in Europe.\n\nInstruction:\n\nGiven this paragraph about Jiu-Jitsu, who taught Carlos Gracie.Answer:\n\nMitsuyo Maeda\n\n",
    "Context:\n\nParkrun (stylised as parkrun) is a collection of 5-kilometre (3.1 mi) events for walkers, runners and volunteers that take place every Saturday morning at more than 2,000 locations in 22 countries across six continents. Junior Parkrun (stylised as junior parkrun) is a spin-off event that provides a 2 kilometres (1+1⁄4 mi) event for children aged 4–14 on a Sunday morning. Parkrun events are free to enter and are delivered by volunteers, supported by a small group of staff at its headquarters.\n\nInstruction:\n\nWhat is parkrunAnswer:\n\nParkrun is a community event that takes place each Saturday morning where entrants walk, jog, or run a 5-kilometre course. Events take place at a range of general locations including parks, forests, rivers, lakes, beaches, and nature reserves. The first ever parkrun event took place on 2 October 2004 in Bushy Park, London involving 13 runners. Today more than 3 million people across more than 2,000 locations in 22 countries participate in parkrun each week. Parkrun events are free to enter and are delivered by volunteers.\n\n",
    "Context:\n\nJimmy John's is an American sandwich chain headquartered in Champaign, Illinois. The business was founded by Jimmy John Liautaud in 1983. After Liautaud graduated from high school, his father gave him a choice to either join the military or start a business. Liautaud, choosing the latter, initially decided to start a hot dog business, but changed to opening a sandwich business due to costs.\n\nThe Jimmy John's franchise has over 2700 locations, with 98% of them being franchises. in 2016, Roark Capital Group purchased a majority stake in the company. Later, in 2019, Inspire Brands purchased the company from Roark Capital Group for an unspecified amount.\n\nInstruction:\n\nGiven this reference text about Jimmy John's, how many Jimmy John's locations are there?Answer:\n\nThere are currently 2700 locations in the Jimmy John's franchise.\n\n",
    "Context:\n\nArchangel, also written as William Gibson Archangel or William Gibson's Archangel, is a five-issue limited series comic book that was created by William Gibson and Michael St. John Smith, written by William Gibson, illustrated by Butch Guice and story-edited by Michael Benedetto. It is Gibson's first comic book series, which is set in an alternative version of 2016 in which the Vice President of America travels back in time to 1945 to secure power.\n\nIDW Publishing first released Archangel from May 2016 to August 2017, then in October as a hardcover graphic novel. It was nominated for an Eisner Award for Best Limited Series and was adapted into an audio play that was released by Audible.\n\nInstruction:\n\nWhat is the name of William Gibson's first comic book series?Answer:\n\nArchangel\n\n",
    "Context:\n\nNew York, often called New York City or NYC, is the most populous city in the United States. With a 2020 population of 8,804,190 distributed over 300.46 square miles (778.2 km2), New York City is the most densely populated major city in the United States and more than twice as populous as Los Angeles, the nation's second-largest city. New York City is located at the southern tip of New York State. It constitutes the geographical and demographic center of both the Northeast megalopolis and the New York metropolitan area, the largest metropolitan area in the U.S. by both population and urban area. With over 20.1 million people in its metropolitan statistical area and 23.5 million in its combined statistical area as of 2020, New York is one of the world's most populous megacities, and over 58 million people live within 250 mi (400 km) of the city. New York City is a global cultural, financial, entertainment, and media center with a significant influence on commerce, health care and life sciences, research, technology, education, politics, tourism, dining, art, fashion, and sports. Home to the headquarters of the United Nations, New York is an important center for international diplomacy, and is sometimes described as the capital of the world.\n\nInstruction:\n\nGiven the following paragraph about New York City, how many people live in the city?Answer:\n\nAs of 2020, there are over 20.1 million people living in the metropolitan statistical area of New York City. When considering the combined statistical area of New York City as of 2020, it is 23.5 million people.\n\n",
    "Context:\n\nJelly Roll is married to Bunnie DeFord aka Bunnie XO and has two children from a previous relationship.\n\nInstruction:\n\nBy what other name does Bunnie DeFord go by?Answer:\n\nBunnie XO\n\n",
    "Context:\n\nPenguins (order Sphenisciformes /sfɪˈnɪsəfɔːrmiːz/, family Spheniscidae /sfɪˈnɪsɪdiː, -daɪ/) are a group of aquatic flightless birds. They live almost exclusively in the Southern Hemisphere: only one species, the Galápagos penguin, is found north of the Equator. Highly adapted for life in the water, penguins have countershaded dark and white plumage and flippers for swimming. Most penguins feed on krill, fish, squid and other forms of sea life which they catch with their bills and swallow whole while swimming. A penguin has a spiny tongue and powerful jaws to grip slippery prey.\n\nInstruction:\n\nCan Penguins fly?Answer:\n\nPenguins are a group of aquatic flightless birds.\n\n",
    "Context:\n\nHickory wood is hard, stiff, dense and shock resistant. There are woods stronger than hickory and woods that are harder, but the combination of strength, toughness, hardness, and stiffness found in hickory wood is not found in any other commercial wood. It is used for tool handles, pickaxe handles, bows, wheel spokes, carts, drumsticks, lacrosse stick handles, golf club shafts (sometimes still called hickory stick, even though made of steel or graphite), the bottoms of skis, walking sticks, and for punitive use as a switch (like hazel), and especially as a cane-like hickory stick in schools and use by parents. Paddles are often made from hickory. This property of hickory wood has left a trace in some Native American languages: in Ojibwe, hickory is called mitigwaabaak, a compound of mitigwaab \"bow\" and the final -aakw \"hardwood tree\". Due to its grain structure, hickory is more susceptible to moisture absorption than other species of wood, and is therefore more prone to shrinkage, warping or swelling with changes in humidity.\n\nInstruction:\n\nGiven this paragraph about hickory wood, tell me what sporting equipment it might be used for.Answer:\n\nHickory wood may be used to make lacrosse stick handles, golf club shafts, and the bottom of skis.\n\n",
    "Context:\n\nBritney Jean Spears (born December 2, 1981) is an American singer, actress, and dancer. Often referred to as the \"Princess of Pop\", she is credited with influencing the revival of teen pop during the late 1990s and early 2000s. After appearing in stage productions and television series, Spears signed with Jive Records in 1997 at age fifteen. Her first two studio albums, ...Baby One More Time (1999) and Oops!... I Did It Again (2000), are among the best-selling albums of all time and made Spears the best-selling teenage artist of all time. With first-week sales of over 1.3 million copies, Oops!... I Did It Again held the record for the fastest-selling album by a female artist in the United States for fifteen years. Spears adopted a more mature and provocative style for her albums Britney (2001) and In the Zone (2003), and starred in the 2002 film Crossroads.\n\nInstruction:\n\nGiven a reference text about Britney Spears, tell me when they were born and why they are famous.Answer:\n\nBritney Spears was born December 2, 1981 she is famous for being the \"princess of pop\" and being the best selling teenage artist of all time.\n\n",
    "Context:\n\nOutcomes from Project Vesta have been integrated into firefighter training in Australia and are beginning to appear in the United States.\n\nFirefighters try to stay out of the dead man zone at all times, working from safe points such as burnt ground or a large area of non-burnable ground, such as a cricket or Australian rules football oval, or a large car park. This is achieved by attacking the fire from the flanks, or the rear, so that burnt ground is always nearby, and the fire is always in front of the firefighters. This avoids two disadvantages of attacking fires at the head of the fire where spot fires may start behind them or changes in wind behavior might accelerate the spread of the fire.\n\nThe result of several inquiries into firefighter death in Australian bushfires found that firefighters should stay out of the dead man zone and that they should always keep 250 liters of water in their truck for personal safety. This is now a standard operating procedure in the NSW Rural Fire Service, Country Fire Service and Country Fire Authority in Australia.\n\nInstruction:\n\nBased on the reference provided, what are some tactics firefighters use to stay safe while fighting wildfires?Answer:\n\nFirefighters keep out of the dead man zone and carry large amounts of water (at least 250 liters) with them.\n\n",
    "Context:\n\nThe International Olympic Committee agreed in 1907 that the distance for the 1908 London Olympic marathon would be about 25 miles or 40 kilometers. The organizers decided on a course of 26 miles from the start at Windsor Castle to the royal entrance to the White City Stadium, followed by a lap (586 yards 2 feet; 536 m) of the track, finishing in front of the Royal Box. The course was later altered to use a different entrance to the stadium, followed by a partial lap of 385 yards to the same finish.\n\nThe modern 42.195 km (26.219 mi) standard distance for the marathon was set by the International Amateur Athletic Federation (IAAF) in May 1921 directly from the length used at the 1908 Summer Olympics in London.\n\nInstruction:\n\nGiven the reference text about the history of the Olympic marathon distance, tell me what was the distance of the Olympic marathon during the 1924 Olympics in Paris in kilometers?Answer:\n\nThe distance of the Olympic marathon in 1924 would have been 42.195 kilometers, since this is the standard distance set by the IAAF in 1921.\n\n",
    "Context:\n\nNualchawee Petchrung (Thai: นวลฉวี เพชรรุ่ง, also spelled Nuanchawee) was a Thai nurse who was murdered by her medical doctor husband, Athip Suyansethakarn, on 10 September 1959. The investigation and trial received sensational coverage in the media—Siang Ang Thong newspaper, which later became the country's top circulating daily Thai Rath, gained popularity from its coverage of the case, which regularly filled the front page—and the case became one of the best known murders in Thailand. Athip was found guilty and sentenced to death, but was later pardoned. Nonthaburi Bridge, where her body was disposed into the Chao Phraya River, is still commonly known as Nualchawee Bridge, and evidence from the case is on display at the Songkran Niyomsane Forensic Medicine Museum.\n\nInstruction:\n\nWho was found guilty for the murder of Nualchawee Petchrung?Answer:\n\nAthip Suyansethakarn was found guilty of murdering his wife, Nualchawee Petchrung.\n\n",
    "Context:\n\nA battery storage power station is a type of energy storage power station that uses a group of batteries to store electrical energy. Battery storage is the fastest responding dispatchable source of power on electric grids, and it is used to stabilise those grids, as battery storage can transition from standby to full power in under a second to deal with grid contingencies.\n\nAt full rated power, battery storage power stations are generally designed to output for up to a few hours. Battery storage can be used for short-term peak power and ancillary services, such as providing operating reserve and frequency control to minimize the chance of power outages. They are often installed at, or close to, other active or disused power stations and may share the same grid connection to reduce costs. Since battery storage plants require no deliveries of fuel, are compact compared to generating stations and have no chimneys or large cooling systems, they can be rapidly installed and placed if necessary within urban areas, close to customer load.\n\nInstruction:\n\nGiven these paragraphs about battery storage power stations, for how long a battery storage power station can output?Answer:\n\nAt full rated power, battery storage power stations are generally designed to output for up to a few hours.\n\n",
    "Context:\n\nIstván Szalay (22 March 1944 – 1 September 2022) was a Hungarian mathematician and politician. A member of the Hungarian Socialist Party, he served in the National Assembly from 1998 to 2002. Prior to that, he was mayor of Szeged from 1994 to 1998.\n\nSzalay died on 1 September 2022, at the age of 78.\n\nInstruction:\n\nWhat is Szalay doing these days?Answer:\n\nSadly, István Szalay passed away on 1 September 2022, at the age of 78. And hence to answer your question, he is dead and does't exists anymore.\n\n",
    "Context:\n\nVirgin Australia, the trading name of Virgin Australia Airlines Pty Ltd, is an Australian-based airline. It is the largest airline by fleet size to use the Virgin brand. It commenced services on 31 August 2000 as Virgin Blue, with two aircraft on a single route. It suddenly found itself as a major airline in Australia's domestic market after the collapse of Ansett Australia in September 2001. The airline has since grown to directly serve 32 cities in Australia, from hubs in Brisbane, Melbourne and Sydney.\n\nInstruction:\n\nWhen did Virgin Australia start operating?Answer:\n\nVirgin Australia commenced services on 31 August 2000 as Virgin Blue, with two aircraft on a single route.\n\n",
    "Context:\n\nDesigned to supplement Disneyland in Anaheim, California, which had opened in 1955, the complex was developed by Walt Disney in the 1960s. \"The Florida Project\", as it was known, was intended to present a distinct vision with its own diverse set of attractions. Walt Disney's original plans also called for the inclusion of an \"Experimental Prototype Community of Tomorrow\" (EPCOT), a planned community intended to serve as a testbed for new city-living innovations. Walt Disney died on December 15, 1966, during the initial planning of the complex. After his death, the company wrestled with the idea of whether to bring the Disney World project to fruition; however, Walt's older brother, Roy O. Disney, came out of retirement to make sure Walt's biggest dream was realized. Construction started in 1967, with the company instead building a resort similar to Disneyland, abandoning the experimental concepts for a planned community. The Magic Kingdom was the first theme park to open in the complex, in 1971, followed by Epcot (1982), Disney's Hollywood Studios (1989), and Disney's Animal Kingdom (1998). It was Roy who insisted the name of the entire complex be changed from Disney World to Walt Disney World, ensuring that people would remember that the project was Walt's dream.\n\nInstruction:\n\nGiven this paragraph, which was built first Disneyland or Disney World?Answer:\n\nAccording to this text, Disneyland was built first in 1955, with Disney World construction starting later in 1967 and first opening in 1971.\n\n",
    "Context:\n\nIce hockey (or simply hockey) is a team sport played on ice skates, usually on an ice skating rink with lines and markings specific to the sport. It belongs to a family of sports called hockey. In ice hockey, two opposing teams use ice hockey sticks to control, advance, and shoot a closed, vulcanized, rubber disc called a \"puck\" into the other team's goal. Each goal is worth one point. The team which scores the most goals is declared the winner. In a formal game, each team has six skaters on the ice at a time, barring any penalties, one of whom is the goaltender. Ice hockey is a full contact sport, and is considered to be one of the more physically demanding sports.\n\nIce hockey is one of the sports featured in the Winter Olympics while its premiere international competition, the IIHF World Championships, are governed by the International Ice Hockey Federation (IIHF) for both men's and women's competitions.\n\nIn North America and parts of Europe the sport is known simply as hockey[citation needed]. However, in other countries, \"hockey\" usually refers to field hockey. In 1994 hockey was officially recognized as Canada's national winter sport.\n\nThe modern sport of ice hockey was developed in Canada, most notably in Montreal, where the first indoor game was played on March 3, 1875. Some characteristics of that game, such as the length of the ice rink and the use of a puck, have been retained to this day. Amateur ice hockey leagues began in the 1880s, and professional ice hockey originated around 1900. The Stanley Cup, emblematic of ice hockey club supremacy, was initially commissioned in 1892 as the \"Dominion Hockey Challenge Cup\" and was first awarded in 1893 to recognize the Canadian amateur champion and later became the championship trophy of the National Hockey League (NHL). In the early 1900s, the Canadian rules were adopted by the Ligue Internationale de Hockey Sur Glace, in Paris, France, the precursor of the IIHF. The sport was played for the first time at the Olympics during the 1920 Summer Olympics.\n\nWhile women also played during the game's early formative years, it was not until organizers began to officially remove body checking from female ice hockey beginning in the mid-1980s that it began to gain greater popularity, which by then had spread to Europe and a variety of other countries. The first IIHF Women's World Championship was held in 1990, and women's play was introduced into the Olympics in 1998.\n\nInstruction:\n\nWhy should I watch ice hockeyAnswer:\n\nIce hockey is a team sport played on ice skates, usually on an ice skating rink with lines and markings specific to the sport. It belongs to a family of sports called hockey. In ice hockey, two opposing teams use ice hockey sticks to control, advance, and shoot a closed, vulcanized, rubber disc called a \"puck\" into the other team's goal. Each goal is worth one point. The team which scores the most goals is declared the winner. In a formal game, each team has six skaters on the ice at a time, barring any penalties, one of whom is the goaltender. Ice hockey is a full contact sport, and is considered to be one of the more physically demanding sports.\n\nIce hockey is fast, intense and fun to watch. The fans in the stadium are sitting close to the ice rink and cheer and push their favorite teams to reach their goals.\n\n",
    "Context:\n\nHistorically, the world's tallest man-made structure was the Great Pyramid of Giza in Egypt, which held the position for over 3800 years until the construction of Lincoln Cathedral in 1311. The Strasbourg Cathedral in France, completed in 1439, was the world's tallest building until 1874.\n\n \n\nThe first skyscraper was pioneered in Chicago with the 138 ft (42.1 m) Home Insurance Building in 1885. The United States would remain the location of the world's tallest building throughout the 20th century until 1998, when the Petronas Towers were completed. Since then, two other buildings have gained the title: Taipei 101 in 2004 and Burj Khalifa in 2010. Since the beginning of the 21st century, the Middle East, China, and Southeast Asia have experienced booms in skyscraper construction\n\nInstruction:\n\nGiven the following paragraph about the history of tallest buildings, which was the first skyscraper and when was it build?Answer:\n\nThe first skyscraper was the Home Insurance Building in Chicago. It was build in 1885.\n\n",
    "Context:\n\nZigalga National Park (Russian: Национальный парк «Зигальга») is located on the high Zigalga Ridge of the Southern Ural Mountains in Russia, on the transition between Europe and Siberia. Much of the territory is untouched by human activity and so supports Ice Age relict floral communities through all altitude zones - pine and birch forest, dark coniferous taiga, alpine meadows and mountain tundra. The park was officially created in 2019. The park is located in the Katav-Ivanovsky District of Chelyabinsk Oblast.\n\nTopography\nZiglalga National Park connects two large protected areas on the main ridge of the Southern Urals, with Zyuratkul National Park to the northeast, and the South Ural Nature Reserve to the southwest. The park includes headwaters of the Yuryuzan River and the Kutkurka River. The highest point is at Mount Poperechnaya (1,387 metres (4,551 ft))\n\nInstruction:\n\nWhat are common florals found in Zigalga National Park?Answer:\n\nZigalga National Park has the majority of its territory untouched by human activity and includes pine and birch forest, dark coniferous taiga, alpine meadows and mountain tundra.\n\n",
    "Context:\n\nEdmund Selous started as a conventional naturalist, but developed a hatred of the killing of animals for scientific study and was a pioneer of bird-watching as a method of scientific study. He was a strong proponent of non-destructive bird-study as opposed to the collection of skins and eggs.\n\nInstruction:\n\nGiven this paragraph, what method of scientific study did Edmund Selous champion?Answer:\n\nEdmund Selous was a pioneer of bird-watching as a method of scientific study.\n\n",
    "Context:\n\nSiliceous ooze is a type of biogenic pelagic sediment located on the deep ocean floor. Siliceous oozes are the least common of the deep sea sediments, and make up approximately 15% of the ocean floor. Oozes are defined as sediments which contain at least 30% skeletal remains of pelagic microorganisms. Siliceous oozes are largely composed of the silica based skeletons of microscopic marine organisms such as diatoms and radiolarians. Other components of siliceous oozes near continental margins may include terrestrially derived silica particles and sponge spicules. Siliceous oozes are composed of skeletons made from opal silica Si(O2), as opposed to calcareous oozes, which are made from skeletons of calcium carbonate organisms (i.e. coccolithophores). Silica (Si) is a bioessential element and is efficiently recycled in the marine environment through the silica cycle. Distance from land masses, water depth and ocean fertility are all factors that affect the opal silica content in seawater and the presence of siliceous oozes.\n\nInstruction:\n\nGiven the following paragraph on siliceous ooze, how are oozes defined?Answer:\n\nOozes are defined as sediments which contain at least 30 percent skeletal remains of pelagic microorganisms.\n\n",
    "Context:\n\nAmazon Kindle is a series of e-readers designed and marketed by Amazon. Amazon Kindle devices enable users to browse, buy, download, and read e-books, newspapers, magazines and other digital media via wireless networking to the Kindle Store. The hardware platform, which Amazon subsidiary Lab126 developed, began as a single device in 2007. Currently, it comprises a range of devices, including e-readers with E Ink electronic paper displays and Kindle applications on all major computing platforms. All Kindle devices integrate with Windows and macOS file systems and Kindle Store content and, as of March 2018, the store had over six million e-books available in the United States.\n\nInstruction:\n\nGiven this paragraph about e-readers, what is the e-reader designed and marketed by Amazon?Answer:\n\nAmazon Kindle\n\n",
    "Context:\n\nCatheterized bladders become colonized by microorganisms very quickly, with a daily incidence of 3-10%; after four days, between 10-30% of patients develop bacteriuria. Whilst the presence of a catheter does increase the incidence of bloodstream infections secondary to a urinary origin, there is a huge amount of unnecessary, and likely harmful, antimicrobial prescribing on the basis of detection of asymptomatic bacteriuria. The industry is moving to silver-coated catheters in an attempt to reduce the incidence of urinary tract infections, although there is limited evidence of efficacy. An additional problem is that Foley catheters tend to become coated over time with a biofilm that can obstruct the drainage. This increases the amount of stagnant urine left in the bladder, which further contributes to urinary tract infections. When a Foley catheter becomes clogged, it must be flushed or replaced. There is currently not enough adequate evidence to conclude whether washouts are beneficial or harmful.\nhttps://en.wikipedia.org/wiki/Foley_catheter\n\nInstruction:\n\nGiven a reference text about the adverse affects of Foley catheters, please list the main risks.Answer:\n\nThe risks of a Foley catheter include urinary tract and bloodstream infections. In addition, overprescribing of medications to treat infections leads to what is likely additional risk.\n\n",
    "Context:\n\nJoanne Rowling CH OBE FRSL (/ˈroʊlɪŋ/ \"rolling\"; born 31 July 1965), also known by her pen name J. K. Rowling, is a British author and philanthropist. She wrote Harry Potter, a seven-volume children's fantasy series published from 1997 to 2007. The series has sold over 600 million copies, been translated into 84 languages, and spawned a global media franchise including films and video games. The Casual Vacancy (2012) was her first novel for adults. She writes Cormoran Strike, an ongoing crime fiction series, under the alias Robert Galbraith.\n\nInstruction:\n\nWho is J.K.Rowling?Answer:\n\nJoanne Rowling a.k.a J.K.Rowling is the famous author of Harry Potter books.\n\n",
    "Context:\n\nIn 2004, Nintendo released the Nintendo DS, which featured such innovations as dual screens – one of which being a touchscreen – and wireless connectivity for multiplayer play. Throughout its lifetime, more than 154 million units were sold, making it the most successful handheld console and the second best-selling console in history. In 2005, Nintendo released the Game Boy Micro, the last system in the Game Boy line. Sales did not meet Nintendo's expectations, with 2.5 million units being sold by 2007. In mid-2005, the Nintendo World Store was inaugurated in New York City.\n\nInstruction:\n\nGiven this paragraph about video game consoles, when was the Nintendo DS released?Answer:\n\n2004\n\n",
    "Context:\n\nA cryptocurrency, crypto-currency, or crypto is a digital currency designed to work as a medium of exchange through a computer network that is not reliant on any central authority, such as a government or bank, to uphold or maintain it. It is a decentralized system for verifying that the parties to a transaction have the money they claim to have, eliminating the need for traditional intermediaries, such as banks, when funds are being transferred between two entities.\n\nInstruction:\n\nWhat is Cryptocurrency?Answer:\n\nCryptocurrency is the digital currency built on the blockchain or other network which allows people to exchange and trade for goods. There are over 1000 different kinds of cryptocurrency around the world and each of them is designed differently. Currently, the popular cryptocurrencies are Bitcoin, Ethereum, and Dogecoin.\n\n",
    "Context:\n\nFoley first described the use of a self-retaining balloon catheter in 1929, to be used to achieve hemostasis after cystoscopic prostatectomy. He worked on development of this design for use as an indwelling urinary catheter, to provide continuous drainage of the bladder, in the 1930s. His design incorporated an inflatable balloon towards the tip of the tube which could be inflated inside the bladder to retain the catheter without external taping or strapping. He demonstrated this to the American Urologists Society in 1935, and published a paper describing it in 1937. While he was still developing his catheter, a patent was issued to Paul Raiche of the Davol Rubber Company of Providence, Rhode Island in 1936. Four months later, in October 1936, Foley applied for the patent, and was awarded this after appearing before the patent office Board of Appeals. Raiche appealed this decision in court, and it was overturned, returning the patent to Raiche. A further request for a hearing made by Foley was refused, and so the patent stayed with Raiche.\nhttps://en.wikipedia.org/wiki/Frederic_Foley\n\nInstruction:\n\nAccording to this paragraph, did Frederic Foley hold the patent to the Foley catheter?Answer:\n\nAccording to this paragraph, Frederic Foley applied for the patent but it was ultimately awarded to Paul Riache instead.\n\n",
    "Context:\n\nWhen Kennedy died in August 2009, he was the second-most senior member of the Senate (after President pro tempore Robert Byrd of West Virginia) and the third longest-serving senator of all time, behind Byrd and Strom Thurmond of South Carolina. Later that same year, he was passed by Daniel Inouye of Hawaii. Kennedy therefore held the record as the longest-serving Democratic member of Congress to solely serve as a senator until October 2021, when he was surpassed by fellow Democrat Patrick Leahy of Vermont.\n\nInstruction:\n\nBased on this passage about Ted Kennedy, at the time of his death, who were the three longest-serving senators of all time?Answer:\n\nBased on this passage, Robert Byrd, Strom Thurmond and Kennedy were the three longest-serving senators of all time.\n\n",
    "Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nInstruction:\n\nHow was art used for manipulative purpose in racial discuss in the 20th century?Answer:\n\nIn the 19th to 20th century, Europeans commonly use artworks to portray prejudice towards Middle Eastern and Asian people.\n\n",
    "Context:\n\nBelgrandia varica is a species of minute freshwater snail with an operculum, an aquatic gastropod mollusc or micromollusc in the family Hydrobiidae.\n\nInstruction:\n\nDoes Belgrandia varica live in the ocean?Answer:\n\nNo, Belgrandia varica lives in freshwater.\n\n",
    "Context:\n\nIt is likely that the area around Sigiriya may have been inhabited since prehistoric times. There is clear evidence that the many rock shelters and caves in the vicinity were occupied by Buddhist monks and ascetics from as early as the 3rd century BC. The earliest evidence of human habitation at Sigiriya is the Aligala rock shelter to the east of Sigiriya rock, indicating that the area was occupied nearly five thousand years ago during the Mesolithic Period.\n\nBuddhist monastic settlements were established during the 3rd century BC in the western and northern slopes of the boulder-strewn hills surrounding the Sigiriya rock. Several rock shelters or caves were created during this period. These shelters were made under large boulders, with carved drip ledges around the cave mouths. Rock inscriptions are carved near the drip ledges on many of the shelters, recording the donation of the shelters to the Buddhist monastic order as residences. These were made in the period between the 3rd century BCE and the 1st century AD.\n\nIn 477 AD, Kashyapa I, the king’s son by a non-royal consort, seized the throne from King Dhatusena, following a coup assisted by Migara, the King’s nephew and army commander. The rightful heir, Moggallana, fearing for his life, fled to South India. Afraid of an attack by Moggallana, Kashyapa moved the capital and his residence from the traditional capital of Anuradhapura to the more secure Sigiriya. During King Kashyapa’s reign (477 to 495 AD), Sigiriya was developed into a complex city and fortress. Most of the elaborate constructions on the rock summit and around it, including defensive structures, palaces, and gardens, date from this period.\n\nInstruction:\n\nWho built Sigiriya fortress in Sri Lanka?Answer:\n\nKing Kashyapa developed Sigiriya city and fortress.\n\n",
    "Context:\n\nPukeiti Pukeiti (c. 1948 - 18 October 2012) was a Cook Islands politician and Member of the Cook Islands Parliament. He was a member of the Cook Islands Party. He represented the electorate of Tamarua.\n\nPukeiti was elected to Parliament in the 2009 Tamarua by-election following the death of MP Mii Parima. He was re-elected at the 2010 election.\n\nInstruction:\n\nHow old was Pukeiti when he died?Answer:\n\n64 years old. He was born in 1948 and died in 2012, so 2012 - 1948 = 64.\n\n",
    "Context:\n\nSwedish citizenship can be acquired by naturalisation, also known as citizenship by application. A foreigner may be granted Swedish citizenship upon meeting certain requirements. Person should be able to prove identity, 18 years of age or older, has a permanent residence permit or\nhas a right of residence or residence card (applies to EU citizens or close relatives of EU citizens), meets the requirements for habitual residence and has maintained good conduct while in Sweden.\n\nInstruction:\n\nTo acquire Swedish citizenship by naturalisation what should be the minimum age of the applicant and what documents are required.Answer:\n\nMinimum age should be 18 years and applicant should have permanent residence permit or right of residence.\n\n",
    "Context:\n\nThe event was established in 1855, and it was originally called the Prix de l'Empereur. It was initially held at the Champ de Mars, and was transferred to Longchamp in 1857. It was cancelled due to the Franco-Prussian War in 1871, and was renamed the Grande Poule des Produits in 1872.\n\nThe race was one of several trials for the Prix du Jockey Club collectively known as the Poules des Produits. The others (listed by their modern titles) were the Prix Daru, the Prix Hocquart, the Prix Noailles and the Prix Greffulhe. Unlike those races, the Grande Poule des Produits had no restrictions based on the nationality of a horse's sire or dam.\n\nThe event was renamed in memory of Auguste Lupin (1807–1895), a successful owner-breeder, in 1896.\n\nThe Prix Lupin was abandoned throughout World War I, with no running from 1915 to 1918. It was cancelled once during World War II, in 1940. It was run at Le Tremblay over 2,150 metres in 1943, and at Maisons-Laffitte in 1944.\n\nThe present system of race grading was introduced in 1971, and the Prix Lupin was classed at Group 1 level.\n\nThe race was last run in 2004. It was discontinued after France Galop restructured its Group 1 programme for three-year-olds in 2005.\n\nInstruction:\n\nWhy did the Prix Lupin not take place from 1915 to 1918?Answer:\n\nDue to the first World War\n\n",
    "Context:\n\nThe rules of chess (also known as the laws of chess) govern the play of the game of chess. Chess is a two-player abstract strategy board game. Each player controls sixteen pieces of six types on a chessboard. Each type of piece moves in a distinct way. The object of the game is to checkmate (threaten with inescapable capture) the opponent's king. A game can end in various ways besides checkmate: a player can resign, and there are several ways a game can end in a draw.\n\nWhile the exact origins of chess are unclear, modern rules first took form during the Middle Ages. The rules continued to be slightly modified until the early 19th century, when they reached essentially their current form. The rules also varied somewhat from region to region. Today, the standard rules are set by FIDE (Fédération Internationale des Échecs), the international governing body for chess. Slight modifications are made by some national organizations for their own purposes. There are variations of the rules for fast chess, correspondence chess, online chess, and Chess960.\n\nBesides the basic moves of the pieces, rules also govern the equipment used, time control, conduct and ethics of players, accommodations for physically challenged players, and recording of moves using chess notation. Procedures for resolving irregularities that can occur during a game are provided as well.\n\nInstruction:\n\nHow to play chessAnswer:\n\nTo win the game of chess, a player must capture the opponent's king. This is known as \"Checkmating\" the king.\n\n",
    "Context:\n\nThe Cerro Arenal Natural Reserve was declared a protected area on November 4, 1991, it compromises one of 78 protected areas of Nicaragua and is managed by Ministry of the Environment and Natural Resources (MARENA).\n\nThe highest point in the reserve is located inside a tropical cloud forest 1,570 meters above sea level, rain occurs 8 months annually, between May and December. Cerro Arenal Natural Reserve is one of the smallest protected areas of Nicaragua and is abundant with flora and fauna.  Many animals are present throughout the reserve, animals such as monkeys, and armadillos. The reserve also contains the oldest oak trees in Central America.\n\nInstruction:\n\nWhere are the oldest oak trees in Central America?Answer:\n\nThe oldest oak trees reside in the Cerro Arenal Natural Reserve, which was officially declared a protected area on November 4, 1991.\n\n",
    "Context:\n\nIndependence Mall (formerly Westfield Shoppingtown Independence or Westfield Independence) is the only enclosed shopping mall in Wilmington, North Carolina. It opened in 1979 with anchor stores Belk-Beery (now Belk), JCPenney, and Sears. A later expansion added a new wing and Dillard's store to the center after Westfield Group purchased the mall. The mall is located on Oleander Drive (U.S. 76) and Independence Blvd east of downtown Wilmington. The mall has a food court and no longer features a carousel.\n\nInstruction:\n\nWhere is Independence mall?Answer:\n\nIndependence mall is located in Wilmington, North Carolina.\n\n",
    "Context:\n\nNeuromancer is a 1984 science fiction novel by American-Canadian writer William Gibson. Considered one of the earliest and best-known works in the cyberpunk genre, it is the only novel to win the Nebula Award, the Philip K. Dick Award, and the Hugo Award. It was Gibson's debut novel and the beginning of the Sprawl trilogy. Set in the future, the novel follows Henry Case, a washed-up hacker hired for one last job, which brings him in contact with a powerful artificial intelligence.\n\nInstruction:\n\nGiven the reference text about the science fiction novel Neuromancer, tell me the novel's author and the name of the main protagonist.Answer:\n\nNeuromancer was written by William Gibson and its main protagonist is Henry Case.\n\n",
    "Context:\n\nMuseo Municipal Taurino Francisco Montes is located in Chiclana de la Frontera, in the province of Cádiz, Andalusia, southwestern Spain. Situated on San Agustín Street, the bullfighting museum is dedicated to the matador Francisco Montes Reina (1805–1851), nicknamed \"Paquiro\", who was born in this town. He is considered the most important 19th century bullfighter, because of his skill at the sport, on foot or on horseback. The bullfighting displays include pieces of great historical and artistic value. It was inaugurated in 2003 and founded by Pedro Leal Aragon who for seven years collected objects, souvenirs and bullfighting implements. One of its first events was a group show of the artists Antonio Vela, Carlos Quevedo, and Paloma Garcia. After a renovation, it re-opened in June 2005 with miniature models of the bullring in Ronda, a head bust of Paquiro, and an original painting by Antonio Cavanna.The expansion also housed Spain's most important bullfighting collection, Collection Sagnier, which was acquired by the city to improve the historical and artistic quality of the municipal bullfighting museum. There are four rooms: bullfighting origins, Paquiro and his time, contemporary bullfighting, and the bull and the arts. The museum's garden is used for book presentations, press conferences, weddings and small concerts. It is closed on Sundays.\n\nInstruction:\n\nGiven this paragraph about Museo Municipal Taurino Francisco Montes, where is it located?Answer:\n\nMuseo Municipal Taurino Francisco Montes is located in Chiclana de la Frontera, in the province of Cádiz, Andalusia, southwestern Spain.\n\n",
    "Context:\n\n\"The Central Otago wine region is broken into multiple sub-regions, each with its own climate and characteristics.\n\nBannockburn is a small Geographical Indication on the southern banks of the Kawarau River near Cromwell and is a very warm area that was known by gold miners as \"\"the Heart of the Desert\"\". Grapes ripen early on sandy, silty loam soils. The elevation ranges from 220 to 370 metres (720 to 1,210 ft).\nBendigo lies east of the Clutha River / Mata-Au and Lake Dunstan, with grapes planted at both medium elevation (220 metres (720 ft)) and high elevation terraces (330 to 350 metres (1,080 to 1,150 ft)). This warm area has semi arid soils at variable depths, with free draining soils at the lower levels and shallower soils at higher elevations. The Bendigo sub-region includes the vineyards at Tarras and Maori Point.\nGibbston is a tight valley enclosed by mountainous terrain. About 250 hectares of vines are planted on sloping land on the southern bank of the Kawarau River. Gibbston is the coolest and highest of the sub-regions with vineyards between 320 and 420 metres (1,050 and 1,380 ft) altitude. It is sometimes referred to as the Queenstown subregion.\nWānaka, the smallest of the sub-regions, has vineyards planted between the banks of Lake Wānaka and the town of Luggate to the east. Ranging between 290 to 320 metres (950 to 1,050 ft) above sea level, the vineyards have a similar but slightly warmer climate than those at Gibbston.\nThe Alexandra Basin is surrounded by the Clutha River / Mata-Au and Manuherikia River and regularly records New Zealand's hottest summer temperatures. Schist outcrops dominate the arid landscape. A wide diurnal shift moderates the high temperatures.\nThe Cromwell Basin contains the highest concentration of vines, in an area bounded by the Kawarau River, Lake Dunstan and the Pisa mountain range. It is a warm district characterised by semi arid, high terraces and moraines and gently sloping fans.\"\n\nInstruction:\n\nWhat are the four major subregions in Central Otago?Answer:\n\nThe Central Otago wine region is broken into multiple sub-regions: Bannockburn, Bendigo, Bendigo and Wānaka\n\n",
    "Context:\n\nManewra (Maneora) is a small village in Phalodi tehsil, Jodhpur district, Rajasthan, India. Its population is one thousand.\n\nMost of the people in the village are Bishnoi, subcaste Bhanwal, but in ten houses there are Meghwal, and in one Lohar.\n\nManewra is situated near Champasar (4 km.), Ajasar (5 km.), Kharia (4 km0, choutin/laxmannagar (11 km.) and Chadi 15 km . Its postal pin code is 342312.\n\nIn this village two hundred person are in government service. Most are in the Indian army and some are teachers. Other are farmers, but agriculture depends on the weather, as there are no facilities for irrigation water, so villagers depend on the rainy season.\n\nInstruction:\n\nWhat percentage of Manewra's population work for the government?Answer:\n\n20 percent. 200 / 1000 = 20%\n\n",
    "Context:\n\next3, or third extended filesystem, is a journaled file system that is commonly used by the Linux kernel. It used to be the default file system for many popular Linux distributions. Stephen Tweedie first revealed that he was working on extending ext2 in Journaling the Linux ext2fs Filesystem in a 1998 paper, and later in a February 1999 kernel mailing list posting. The filesystem was merged with the mainline Linux kernel in November 2001 from 2.4.15 onward. Its main advantage over ext2 is journaling, which improves reliability and eliminates the need to check the file system after an unclean shutdown. Its successor is ext4\n\nInstruction:\n\nGiven this paragraph about ext3, tell me why its better than ext2 and its successor.Answer:\n\next3 is better than ext2 because of its journaling capabilities, which improve reliability and eliminates the need to check the file system after an unclean shutdown. The successor of ext3 is ext4.\n\n",
    "Context:\n\nThe Cy Young Award is given annually to the best pitchers in Major League Baseball (MLB), one each for the American League (AL) and National League (NL). The award was first introduced in 1956 by Baseball Commissioner Ford Frick in honor of Hall of Fame pitcher Cy Young, who died in 1955. The award was originally given to the single best pitcher in the major leagues, but in 1967, after the retirement of Frick, the award was given to one pitcher in each league.\n\nInstruction:\n\nGiven the reference text about the Cy Young Award, please describe what the award is and why it is awarded.Answer:\n\nThe Cy Young Award is given to the best pitches in the American and National leagues of Major League Baseball, for their achievements that exceed those of their peers.\n\n",
    "Context:\n\nAn exoplanet or extrasolar planet is a planet outside the Solar System. The first possible evidence of an exoplanet was noted in 1917 but was not recognized as such. The first confirmation of detection occurred in 1992. A different planet, initially detected in 1988, was confirmed in 2003. As of 1 April 2023, there are 5,346 confirmed exoplanets in 3,943 planetary systems, with 855 systems having more than one planet. The James Webb Space Telescope (JWST) is expected to discover more exoplanets, and also much more about exoplanets, including composition, environmental conditions and potential for life.\n\nInstruction:\n\nIn what year was the evidence of an exoplanet first confirmed?Answer:\n\nThe detection of an exoplanet was first confirmed in 1992\n\n",
    "Context:\n\nThe Stade Louis-II, also known as Louis II (French pronunciation: ​[stad(ə) lwi dø]) is a stadium located in the Fontvieille district of Monaco. It serves primarily as a venue for football, being the home of AS Monaco and the Monaco national football team. The stadium is most notable for its distinctive nine arches at the away end of the ground. The arena is also used for the Herculis, a track and field meet of the Diamond League. The stadium hosted the 1986 and 1998–2012 UEFA Super Cup matches. Due to Monaco's small size, the stadium is the only football and athletics stadium in the country.\n\nInstruction:\n\nWhere is the Stade Louis-ll located?Answer:\n\nThe Stade Louis-ll is located in the Fontvielle district of Monaco.\n\n",
    "Context:\n\nThe Vietnam War (also known by other names) was a conflict in Vietnam, Laos, and Cambodia from 1 November 1955 to the fall of Saigon on 30 April 1975. It was the second of the Indochina Wars and was officially fought between North Vietnam and South Vietnam\n\nInstruction:\n\nWhen did the Vietnam War Start?Answer:\n\nThe Vietnam War started on 1 November 1955\n\n",
    "Context:\n\nDon't Starve is a survival video game developed by the Canadian indie video game developer Klei Entertainment. The game was initially released for Microsoft Windows, OS X, and Linux on April 23, 2013. A PlayStation 4 port, renamed Don't Starve: Giant Edition, became available the following year (with PlayStation Vita and PlayStation 3 versions released in September 2014 and June 2015 respectively, and an Xbox One version released in August 2015). Don't Starve for iOS, renamed Don't Starve: Pocket Edition was released on July 9, 2015. An Android version was released on October 20, 2016. Downloadable content titled Reign of Giants was released on April 30, 2014, and a multiplayer standalone expansion called Don't Starve Together became free for existing users on June 3, 2015. On Steam, this game is able to be purchased with a free copy for a friend. A Nintendo Switch port came out on April 12, 2018.\nThe game follows a scientist named Wilson who finds himself in a dark, dreary parallel world known as the Constant and must survive as long as possible. To this end, the player must keep Wilson alive, fed, and mentally stable as he avoids a variety of surreal and supernatural enemies that will try to kill and devour him. The game's Adventure mode adds depth to the sparse plot and pits Wilson against the game's supposed antagonist, Maxwell.\nDon't Starve was Klei's first foray into the survival genre. Conceived during the height of a game industry trend of dropping players into a world with few instructions and a goal of survival, the game was influenced by Minecraft which spearheaded this trend as well as by filmmaker Tim Burton. The game received positive reviews from critics, commended for its original art style, music, and variety of ways for the player to die, although its high level of difficulty and implementation of permanent death were less warmly received.\n\nInstruction:\n\nWhat is Don’t Starve Together?Answer:\n\nDon't Starve Together is a cooperative multiplayer survival game developed by Klei Entertainment, where up to six players can play together online or offline. Players take on the role of a band of characters in a harsh wilderness world, and must work together to keep alive, fed, and mentally stable as they avoid a variety of surreal and supernatural enemies that will try to kill and devour them. The game features a unique hand-drawn art style, as well as randomly generated worlds, providing a new experience with each playthrough.\n\n",
    "Context:\n\nIn a 100 gram amount, smooth peanut butter supplies 597 Calories and is composed of 51% fat, 22% protein, 22% carbohydrates (including 5% dietary fiber), and 1% water (table). Both crunchy and smooth peanut butter are sources of saturated and monounsaturated fats (mainly oleic acid) as 25% of total serving amount, and polyunsaturated fat (12% of total), primarily as linoleic acid).\n\nPeanut butter is a rich source (20% or more of the Daily Value, DV) of dietary fiber, vitamin E, pantothenic acid, folate, niacin, and vitamin B6 (table, USDA FoodData Central). Also high in content are the dietary minerals manganese, magnesium, phosphorus, zinc, copper, and sodium (added as salt during manufacturing). Peanut butter is a moderate source (10–19% DV) of thiamin, riboflavin, iron, and potassium (table).\n\nInstruction:\n\nGiven this text about the nutrition profile of peanut butter, what vitamins is peanut butter rich in?Answer:\n\nVitamins that peanut butter is rich in include vitamin E, pantothenic acid, folate, niacin, and vitamin B6.\n\n",
    "Context:\n\nRhual is a Grade I listed building in Flintshire. This small mansion has medieval origins and is surrounded by a large landscaped park. The present building was constructed in 1634 by Evan Edwards, a member of a well established Flintshire family which traced its descent from the Welsh king Hywel Dda. He most likely incorporated an older medieval house into the north wing of the current building. The house has since been built upon further, and the east and south entrances were created in the 19th century.\n\nInstruction:\n\nWhen was Rhual constructed?Answer:\n\nRhual was constructed in 1634 by Evan Edwards.\n\n",
    "Context:\n\nStefan Richarz (25 November 1874 – 13 July 1934) was a German priest, missionary and geologist.\n\nRicharz was born in Richrath near Cologne, Germany in 1874. He joined the Divine Word Missionaries in 1893 at Steyl, Netherlands. He studied theology in the school of the order Sankt Gabriel in Maria Enzersdorf near Mödling and received his ordination to the priesthood in 1901. Richarz studied geology, paleontology, petrology and chemistry at the University of Vienna and later mineralogy, philosophy and geology at the University of Munich. He received his phD for work with Ernst Weinschenk and Ernst Freiherr Stromer von Reichenbach in 1919 from the University of Munich on basalts from a quarry near Groschlattengrün.\n\nIn the following years he taught geology and astronomy at the school of the order Sankt Gabriel. In 1921 he changed to the school of the Divine Word Missionaries in Techny, Illinois where he lectured on geology, chemistry, mathematics and astronomy. In 1933 Richarz became dean of the science department of the Catholic University of Peking. In his first year, he went on a geological field trip to Mengyin County, South Shantung, China where he died 13. July, 1934.\n\nInstruction:\n\nHow old was Stefan Richarz when he received his phD?Answer:\n\nStefan was 45 years old in 1919 when he received his phD from University of Munich, given he was born in 1874.\n\n",
    "Context:\n\nThe Ford Telstar is an automobile that was sold by Ford in Asia, Australasia and Africa, comparable in size to the European Ford Sierra and the North American Ford Tempo. It was progressively replaced by the Ford Mondeo. It was named after the Telstar satellite.\n\nInstruction:\n\nBased on this paragraph, where was the The Ford Telstar sold?Answer:\n\nAsia, Australasia and Africa\n\n",
    "Context:\n\nMercury-Redstone 1 (MR-1) was the first Mercury-Redstone uncrewed flight test in Project Mercury and the first attempt to launch a Mercury spacecraft with the Mercury-Redstone Launch Vehicle. Intended to be an uncrewed sub-orbital spaceflight, it was launched on November 21, 1960 from Cape Canaveral Air Force Station, Florida. The launch failed in abnormal fashion: immediately after the Mercury-Redstone rocket started to move, it shut itself down and settled back on the pad, after which the capsule jettisoned its escape rocket and deployed its recovery parachutes. The failure has been referred to as the \"four-inch flight\", for the approximate distance traveled by the launch vehicle.\n\nInstruction:\n\nGiven this paragraph on Mercury-Redstone 1, how many people were on the MR-1 when the launched failed, and when was the launch?Answer:\n\nMR-1 was launched on November 21, 1960, and MR-1 was an uncrewed flight, so there were no people on the spacecraft.\n\n",
    "Context:\n\nExogamy often results in two individuals that are not closely genetically related marrying each other; that is, outbreeding as opposed to inbreeding. In moderation, this benefits the offspring as it reduces the risk of the offspring inheriting two copies of a defective gene. Increasing the genetic diversity of the offspring improves the chances of offspring reproducing, up until the fourth-cousin level of relatedness; however, reproduction between individuals on the fourth-cousin level of relatedness decreases evolutionarily fitness.\n\nInstruction:\n\nDoes \"outbreeding\" or \"inbreeding\" benefit the offspring more?Answer:\n\n\"Outbreeding\" is more beneficial to the offspring as it reduces the risk of inheriting defective genes, increasing the offspring's ability to reproduce.\n\n",
    "Context:\n\nElizabeth II (Elizabeth Alexandra Mary; 21 April 1926 – 8 September 2022) was Queen of the United Kingdom and other Commonwealth realms from 6 February 1952 until her death in 2022. She was queen regnant of 32 sovereign states during her lifetime and was head of state of 15 realms at the time of her death. Her reign of 70 years and 214 days was the longest of any British monarch and the longest verified reign of any female monarch in history.\n\nInstruction:\n\nWho was Elizabeth II?Answer:\n\nElizabeth II was the queen of the United Kingdom and the longest-reigning monarch.\n\n",
    "Context:\n\nAugusta Ada King, Countess of Lovelace (née Byron; 10 December 1815 – 27 November 1852) was an English mathematician and writer, chiefly known for her work on Charles Babbage's proposed mechanical general-purpose computer, the Analytical Engine. She was the first to recognise that the machine had applications beyond pure calculation, and to have published the first algorithm intended to be carried out by such a machine. As a result, she is often regarded as the first computer programmer\n\nInstruction:\n\nWho was the first computer programmer?Answer:\n\nAugusta Ada King, Countess of Lovelace (née Byron; 10 December 1815 – 27 November 1852) is often regarded as the first computer programmer for her work on the Analytical Engine with Charles Babbage.\n\n",
    "Context:\n\nThe Osterville Baptist Church is an historic Baptist church building at 824 Main Street in the Osterville village of Barnstable, Massachusetts. The white clapboarded wood-frame structure was built in 1837 for a congregation formed two years earlier. It is one of the older buildings in Osterville, and is a fine example of the Greek Revival with Gothic Revival elements. The church was listed on the National Register of Historic Places in 1987.\n\nDescription and history\nThe Osterville Baptist Church is set prominently in the center of Osterville on the north side of the junction of Main Street and Wianno Avenue. It is rectangular single-story wood-frame structure, with a gable roof, vinyl siding, and a brick foundation. Its exterior features a mix of Greek Revival and Gothic Revival styling, with corner paneled pilasters rising to entablatures running along the sides of the building, and lancet-arched panels above its windows. Its facade is symmetrically arranged, with a pair of entrances, each framed by sidelight windows and pilasters, with an entablature and cornice on top, and sash windows above. A single lancet-arch panel adorns the center of the gable end. The church has a two-stage square tower, with a plain first stage topped by a belfry with lancet-arched louvered openings, and a steeple above.\n\nThe church congregation was organized in 1835 as the Second Barnstable Baptist Church, and this church was dedicated in 1838, having been built on land given by Captain George Lovell. Its steeple is a reconstruction of the original, which was lost in a hurricane in 1945. The church interior was remodeled in 1889, at which time a heating system was added. Further additions have been made to the rear of the building, adding classroom, meeting, and office spaces.\n\nInstruction:\n\nGiven a reference text about the Osterville Baptist Church, tell me why its steeple was rebuilt and when it was listed on the National Register of Historic Places.Answer:\n\nThe Osterville Baptist Church was listed on the National Register of Historic Places in 1987. The church's original steeple had to be replaced because it was damaged during a hurricane in 1945.\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, when did LLMs emerge?Answer:\n\nAround 2018.\n\n",
    "Context:\n\nA three-fund portfolio is based on the fundamental asset classes, stocks and bonds. It is assumed that cash is not counted within the investment portfolio, so it is not included. On the other hand, it is assumed that every investor should hold both domestic and international stocks. The task, then, is to take these three basic non-cash assets — domestic stocks, international stocks, and bonds — decide how much of each to hold (your asset allocation); choose where to hold each of these asset classes, and finally choose a mutual fund to use for each asset class.\n\nInstruction:\n\nSuggest an allocation to implement a three portfolio strategy as described in the text belowAnswer:\n\nFrom Vanguard's list of \"core funds,\" the funds that are best for a three-fund portfolio are:\n\nVanguard Total Stock Market Index Fund (VTSAX)\nVanguard Total International Stock Index Fund (VTIAX)\nVanguard Total Bond Market Fund (VBTLX)\nSo, a \"three-fund portfolio\" might consist of 42% Total Stock Market Index, 18% Total International Stock Index, and 40% Total Bond Market fund.\n\n",
    "Context:\n\nZangisheh (Persian: زنگيشه, also Romanized as Zangīsheh) is a village in Qarah Su Rural District, in the Central District of Kermanshah County, Kermanshah Province, Iran. At the 2006 census, its population was 153, in 34 families.\n\nInstruction:\n\nBased on this passage, what is the average number of people per family in Zangisheh?Answer:\n\nI can only tell you what it was in 2006, because this is when the survey data provided is from. The average number of people per family at that time is the population divided by the number of families, or 153 / 34.\n\n",
    "Context:\n\nJosé Francisco Miguel António de Mendonça, or rather, Mendoça (Lisbon, October 2, 1725 - Lisbon, February 11, 1808), was the fifth Patriarch of Lisbon under the name of D. José II.\n\nBiography\nHe was the son of Nuno Manuel de Mendoça, 4th Count of Vale de Reis, and his wife, D. Leonor Maria Antónia de Noronha. He was the younger brother of the 5th Count and 1st Count of Azambuja, and of D. João Rafael de Mendonça, Bishop of Porto.\n\nHe graduated in canon law, having been canon of the Patriarchal See of Lisbon, Monsignor and still principal of the same church.\n\nJosé Mendonca succeeded D. Francisco de Lemos as rector of the University of Coimbra from 1780 to 1785. During his tenure he attempted introduce a number of reforms.\n\nIn 1786, he was appointed Patriarch of Lisbon. By 1792 he was still trying to get permission from the Real Mesa Censória (Royal Censorial Court) to publish two pastoral letters. A law passed on April 5, 1768 reaffirmed the right of \"temporal sovereignty\" over the prohibition of \"pernicious books and papers\" in the interest of political defense. As the Mesa had jurisdiction over all printed materials, this included pastoral letters.\n\nPope Pius VI made him a cardinal in 1788. He died in 1808 and his body is buried in the Convent of Grace.\n\nInstruction:\n\nGiven a reference text about José Francisco Miguel António de Mendonça, tell me when he was appointed patriarch and when he died.Answer:\n\nJosé Francisco Miguel António de Mendonça was appointed Patriarch of Lisbon in 1786 and died in 1808.\n\n",
    "Context:\n\nThe French Revolution (French: Révolution française [ʁevɔlysjɔ̃ fʁɑ̃sɛːz]) was a period of radical political and societal change in France that began with the Estates General of 1789 and ended with the formation of the French Consulate in November 1799. Many of its ideas are considered fundamental principles of liberal democracy, while the values and institutions it created remain central to French political discourse.\n\nIts causes are generally agreed to be a combination of social, political and economic factors, which the Ancien Régime proved unable to manage. In May 1789, widespread social distress led to the convocation of the Estates General, which was converted into a National Assembly in June. Continuing unrest culminated in the Storming of the Bastille on 14 July, which led to a series of radical measures by the Assembly, including the abolition of feudalism, the imposition of state control over the Catholic Church in France, and extension of the right to vote.\n\nInstruction:\n\nGiven this paragraph on French Revolution, what were the main causesAnswer:\n\nThe causes were multiple, including social, politic, and economic factors.\n\n",
    "Context:\n\nGibraltar (/dʒɪˈbrɔːltər/ jih-BRAWL-tər, Spanish: [xiβɾalˈtaɾ]) is a British Overseas Territory and city located at the southern tip of the Iberian Peninsula. It has an area of 6.7 km2 (2.6 sq mi) and is bordered to the north by Spain. The landscape is dominated by the Rock of Gibraltar, at the foot of which is a densely populated town area, home to over 32,000 people, primarily Gibraltarians.\n\nIn 1704, Anglo-Dutch forces captured Gibraltar from Spain during the War of the Spanish Succession. The territory was ceded to Great Britain in perpetuity under the Treaty of Utrecht in 1713. It became an important base for the Royal Navy, particularly during the Napoleonic Wars and World War II, as it controlled the narrow entrance and exit to the Mediterranean Sea, the Strait of Gibraltar, which is only 14.3 km (8.9 mi) wide. This choke point remains strategically important, with half the world's seaborne trade passing through it. Gibraltar's economy is based largely on tourism, online gambling, financial services, and bunkering.\n\nThe sovereignty of Gibraltar is a point of contention in Anglo-Spanish relations, as Spain asserts a claim to the territory. Gibraltarians overwhelmingly rejected proposals for Spanish sovereignty in a 1967 referendum, and for shared sovereignty in a 2002 referendum. Nevertheless, Gibraltar maintains close economic and cultural links with Spain, with many Gibraltarians speaking Spanish as well as a local dialect known as Llanito.\n\nSince Brexit, Gibraltar is not a member of the European Union but negotiations are underway to have it participate in the Schengen Agreement to facilitate border movements between Gibraltar and Spain. As of March 2023, talks seem deadlocked.\n\nName\nThe name is derived from Arabic: جبل طارق, romanized: Jabal Ṭāriq, lit. 'Mount of Tariq' (named after the 8th-century Moorish military leader Tariq ibn Ziyad).\n\nInstruction:\n\nWhere does the name Gibraltar come from?Answer:\n\nThe name comes from the arabic meaning the mountain of Tarik\n\n",
    "Context:\n\nJoshua Braff (born October 11, 1967) is an American writer.\n\nBraff's first novel, The Unthinkable Thoughts of Jacob Green, described as a Jewish coming of age tale, was published in 2004 by Algonquin Books of Chapel Hill. The Unthinkable Thoughts of Jacob Green was an ALA Notable Book, named to Booklist's Top 10 1st Novels List, and chosen for the Barnes & Noble Discover Great New Writers program. His second novel Peep Show was published by Algonquin in 2010. In a four-star review of Peep Show, People said, “Braff skillfully illuminates the failures and charms of a broken family. That teen longing for adults to act their age haunts long after the final page.”\n\nInstruction:\n\nDo you know anything about the writer Joshua BraffAnswer:\n\nJoshua Braff (born October 11, 1967) is an American writer. Braff's first novel, The Unthinkable Thoughts of Jacob Green, described as a Jewish coming of age tale, was published in 2004 by Algonquin Books of Chapel Hill.\n\nThe Unthinkable Thoughts of Jacob Green was an ALA Notable Book, named to Booklist's Top 10 1st Novels List, and chosen for the Barnes & Noble Discover Great New Writers program. His second novel Peep Show was published by Algonquin in 2010. \n\nIn a four-star review of Peep Show, People said, “Braff skillfully illuminates the failures and charms of a broken family. That teen longing for adults to act their age haunts long after the final page.”\n\n",
    "Context:\n\nFerrets spend 14–18 hours a day asleep and are most active around the hours of dawn and dusk, meaning they are crepuscular. If they are caged, they should be taken out daily to exercise and satisfy their curiosity; they need at least an hour and a place to play. Unlike their polecat ancestors, which are solitary animals, most ferrets will live happily in social groups. They are territorial, like to burrow, and prefer to sleep in an enclosed area.\n\nInstruction:\n\nGiven this paragraph about ferrets, do they spend the majority of the time sleeping in a 24 hour day?Answer:\n\nYes, ferrets sleep 14 to 18 hours per day.\n\n",
    "Context:\n\nThe Grateful Dead was founded in the San Francisco Bay Area amid the rise of the counterculture of the 1960s. The founding members were Jerry Garcia (lead guitar, vocals), Bob Weir (rhythm guitar, vocals), Ron \"Pigpen\" McKernan (keyboards, harmonica, vocals), Phil Lesh (bass, vocals), and Bill Kreutzmann (drums). Members of the Grateful Dead, originally known as the Warlocks, had played together in various Bay Area ensembles, including the traditional jug band Mother McCree's Uptown Jug Champions. Lesh was the last member to join the Warlocks before they changed their name to the Grateful Dead; replacing Dana Morgan Jr., who had played bass for a few gigs. Drummer Mickey Hart and non-performing lyricist Robert Hunter joined in 1967. With the exception of McKernan, who died in 1973, and Hart, who took time off from 1971 to 1974, the core of the band stayed together for its entire 30-year history. The other official members of the band are Tom Constanten (keyboards; 1968–1970), John Perry Barlow (non-performing lyricist; 1971–1995), Keith Godchaux (keyboards, occasional vocals; 1971–1979), Donna Godchaux (vocals; 1972–1979), Brent Mydland (keyboards, vocals; 1979–1990), and Vince Welnick (keyboards, vocals; 1990–1995). Bruce Hornsby (accordion, piano, vocals) was a touring member from 1990 to 1992, as well as a guest with the band on occasion before and after the tours.\n\nInstruction:\n\nGiven the paragraph about the Grateful Dead, tell me when they were founded, who were the original members, and what other members were in the group.Answer:\n\nThe Grateful Dead were founded in the 1960's as the Warlocks by Jerry Garcia, Bob Weir, Ron \"Pigpen\" McKernan, Phil Lesh and Bill Kreutzmann. Over the years, the band had many other members, including Tom Constanten, John Perry Barlow, Keith Godchaux, Donna Godchaux, Brent Mydland, Vince Welnick and Bruce Hornsby.\n\n",
    "Context:\n\nMoha (Chinese: 膜蛤; pinyin: Mó Há, pronounced [muǒ.xǎ]), literally \"admiring toad\" or \"toad worship\", is an internet meme spoofing Jiang Zemin, former General Secretary of the Chinese Communist Party and paramount leader. It originated among the netizens in mainland China and has become a subculture on the Chinese internet. According to another explanation, it comes from China's social media Baidu Tieba. In the culture, Jiang is nicknamed há, or \"toad\", because of his supposed resemblance to a toad. Netizens who móhá (worship the toad) call themselves \"toad fans\", \"toad lovers\" or \"toad worshippers\" (simplified Chinese: 蛤丝; traditional Chinese: 蛤絲), or \"mogicians\" (膜法师; 膜法師) which is a wordplay on mófǎshī (魔法师; 魔法師, magician) in Mandarin.[note 1]\n\nAnother nickname for Jiang is \"elder\" or \"senior\" (长者; 長者; Zhǎngzhě), because he once called himself an \"elder\" or \"senior\" when he was berating Hong Kong journalist Sharon Cheung who questioned him. A video clip recording this event spread on the internet and led to the rise of the culture, which later greatly rose in popularity around 2014, when Hong Kong was experiencing a period of political instability. Initially, netizens extracted Jiang's quotes from the video and imitated his wording and tone, for parody and insult. However, as the culture developed, some imitations have taken to carrying affection toward him. The quotes for imitation have also evolved to include what he said during his leadership, and in his personal life.\n\nInstruction:\n\nWhat does moha meanAnswer:\n\nIt means toad worship, an internet meme spoofing Jiang Zemin\n\n",
    "Context:\n\nThe women's individual competition at the 2018 Asian Games in Jakarta, Indonesia was held from 23 August to 26 August (inclusive) at the Pondok Indah Golf & Country Club.\n\nInstruction:\n\nHow many days was the women's individual competition?Answer:\n\n4 days. 26-23+1 = 4. Counting 23, 24, 25, 26 equals 4 days.\n\n",
    "Context:\n\nZangisheh (Persian: زنگيشه, also Romanized as Zangīsheh) is a village in Qarah Su Rural District, in the Central District of Kermanshah County, Kermanshah Province, Iran. At the 2006 census, its population was 153, in 34 families.\n\nInstruction:\n\nBased on this passage, what is the median number of people per family in Zangisheh?Answer:\n\nThis passage does not give enough information to conclude what the median number of people per family in Zangisheh is as it only mentions the total population and number of families. We could calculate the arithmetic mean of the number of people per family from this information by dividing the total number of people by the number of families, but the information in the passage is not sufficient to determine the median number of people per family.\n\n",
    "Context:\n\nThe Catholic University of America (CUA) is a private Roman Catholic research university in Washington, D.C. It is a pontifical university of the Catholic Church in the United States and the only institution of higher education founded by U.S. Catholic bishops. Established in 1887 as a graduate and research center following approval by Pope Leo XIII, the university began offering undergraduate education in 1904. It is classified among \"R2: Doctoral Universities – High research activity\".\n\nIts campus is adjacent to the Brookland neighborhood, known as \"Little Rome\", which contains 60 Catholic institutions, including Trinity Washington University, the Dominican House of Studies, and Archbishop Carroll High School, as well as the Basilica of the National Shrine of the Immaculate Conception.\n\nCUA's programs emphasize the liberal arts, professional education, and personal development. The school stays closely connected with the Catholic Church and Catholic organizations. The residential U.S. cardinals put on the American Cardinals Dinner each year to raise scholarship funds. The university also has a long history of working with the Knights of Columbus; its law school and basilica have dedications to the involvement and support of the Knights.\n\nInstruction:\n\nGiven this reference text about the Catholic University of America, tell me when it was established, where it is located, and who founded it.Answer:\n\nThe Catholic University was founded in 1887 by the US Catholic Bishops, and is located in Washington, DC.\n\n",
    "Context:\n\nThe Instituto de Enseñanza Secundaria Lope de Vega (IES Lope de Vega) is a public high school in Madrid, Spain. It is located in the calle de San Bernardo. It is operated by the regional administration of the Community of Madrid.\n\nInstruction:\n\nIn which European country is this school located?Answer:\n\nSpain\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, what are \"emergent abilities\"?Answer:\n\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed.\n\n",
    "Context:\n\nIn 2001, Keshubhai Patel's health was failing and the BJP lost a few state assembly seats in by-elections. Allegations of abuse of power, corruption and poor administration were made, and Patel's standing had been damaged by his administration's handling of the earthquake in Bhuj in 2001. The BJP national leadership sought a new candidate for the chief ministership, and Modi, who had expressed misgivings about Patel's administration, was chosen as a replacement. Although Advani did not want to ostracise Patel and was concerned about Modi's lack of experience in government, Modi declined an offer to be Patel's deputy chief minister, telling Advani and Atal Bihari Vajpayee that he was \"going to be fully responsible for Gujarat or not at all\". On 3 October 2001 he replaced Patel as chief minister of Gujarat, with the responsibility of preparing the BJP for the December 2002 elections. On 7 October, he was sworn in, and entered the Gujarat state legislature on 24 February 2002 by winning a by-election to the Rajkot – II constituency, defeating Ashwin Mehta of the INC.\n\nInstruction:\n\nWhy was Advani concerned about Modi’s appointment as a chief minister of Gujarat?Answer:\n\nFor Modi being a candidate  for the chief minister of Gujarat, Advani was concerned about Modi’s lack of political experience.\n\n",
    "Context:\n\nThe Primacy of the Spains (Portuguese: Primaz das Espanhas; Spanish: Primado de las Españas, Catalan: Primat de les Espanyes) is the primacy of the Iberian Peninsula, historically known as Hispania or in the plural as the Spains. The Archbishop of Braga, in Portugal, has claimed this primacy over the whole Iberian Peninsula since the middle ages, however today his primacy is only recognized in Portugal. The Archbishop of Toledo in Spain has claimed the Primacy of Spain, as the primate above all other episcopal sees in Spain. In addition, the Archbishop of Tarragona in Catalonia also make use of the title. The Archbishops in Braga, Toledo and Tarragona, if raised to the rank of cardinal, are known as Cardinal-Primates.\n\nInstruction:\n\nPlease explain the Primacy of the SpainsAnswer:\n\nThe Primacy of the Spains (Portuguese: Primaz das Espanhas; Spanish: Primado de las Españas, Catalan: Primat de les Espanyes) is the primacy of the Iberian Peninsula, historically known as Hispania or in the plural as the Spains. \n\nThe Archbishop of Braga, in Portugal, has claimed this primacy over the whole Iberian Peninsula since the middle ages, however today his primacy is only recognized in Portugal. The Archbishop of Toledo in Spain has claimed the Primacy of Spain, as the primate above all other episcopal sees in Spain. \n\nIn addition, the Archbishop of Tarragona in Catalonia also make use of the title. The Archbishops in Braga, Toledo and Tarragona, if raised to the rank of cardinal, are known as Cardinal-Primates.\n\n",
    "Context:\n\nArtificial intelligence (AI) is intelligence demonstrated by machines, as opposed to intelligence of humans and other animals. Example tasks in which this is done include speech recognition, computer vision, translation between (natural) languages, as well as other mappings of inputs.\n\nInstruction:\n\nWhat are some examples of tasks performed by AI?Answer:\n\nExamples of tasks performed by AI include speech recognition, computer vision, translation between (natural) languages, and other mappings of inputs.\n\n",
    "Context:\n\nBoston College (BC) is a private Jesuit research university in Chestnut Hill, Massachusetts. Founded in 1863, the university has more than 9,300 full-time undergraduates and nearly 5,000 graduate students. Although Boston College is classified as an R1 research university, it still uses the word \"college\" in its name to reflect its historical position as a small liberal arts college. Its main campus is a historic district and features some of the earliest examples of collegiate gothic architecture in North America. In accordance with its Jesuit heritage, the university offers a liberal arts curriculum with a distinct emphasis on formative education and service to others.\n\nUndergraduate admission is highly selective. The university offers bachelor's degrees, master's degrees, and doctoral degrees through its eight colleges and schools: Morrissey College of Arts & Sciences, Carroll School of Management, Lynch School of Education and Human Development, Connell School of Nursing, Graduate School of Social Work, Boston College Law School, Boston College School of Theology and Ministry, Woods College of Advancing Studies.\n\nBoston College athletic teams are the Eagles. Their colors are maroon and gold and their mascot is Baldwin the Eagle. The Eagles compete in NCAA Division I as members of the Atlantic Coast Conference in all sports offered by the ACC. The men's and women's ice hockey teams compete in Hockey East. Boston College's men's ice hockey team has won five national championships.\n\nAlumni and affiliates of the university include governors, ambassadors, members of Congress, scholars, writers, medical researchers, Hollywood actors, and professional athletes. Boston College has graduated 3 Rhodes, 22 Truman, and more than 171 Fulbright scholars. Other notable alumni include a U.S. Speaker of the House, a U.S. Secretary of State, and chief executives of Fortune 500 companies.\n\nInstruction:\n\nWhat is the best private Jesuit research university in Boston ?Answer:\n\nBoston College is the best Jesuit private university in Boston.\n\n",
    "Context:\n\nThey hold the highest number of FA Cup trophies, with 14. The club is one of only six clubs to have won the FA Cup twice in succession, in 2002 and 2003, and 2014 and 2015. Arsenal have achieved three League and FA Cup \"Doubles\" (in 1971, 1998 and 2002), a feat only previously achieved by Manchester United (in 1994, 1996 and 1999). They were the first side in English football to complete the FA Cup and League Cup double, in 1993. Arsenal were also the first London club to reach the final of the UEFA Champions League, in 2006, losing the final 2–1 to Barcelona.\n\nInstruction:\n\nWhich English football club has won the most FA Cup trophies?Answer:\n\nArsenal - 14\n\n",
    "Context:\n\nTaylor Harry Fritz (born October 28, 1997) is an American professional tennis player. He has a career-high singles ranking of world No. 5 by the Association of Tennis Professionals (ATP), achieved on February 27, 2023, and a doubles ranking of world No. 104, achieved on July 26, 2021. Fritz has won five ATP Tour singles titles, including a Masters 1000 title at the 2022 Indian Wells Masters. His best result in a Grand Slam tournament was reaching the quarterfinals of the 2022 Wimbledon Championships. He is currently the No. 1 American player.\n\nFritz reached his maiden ATP final in only his third career event, the 2016 Memphis Open. Only one other American, John Isner, has reached an ATP final in fewer career events. He won a junior major singles title at the 2015 US Open, and was the runner-up in junior singles at the 2015 French Open.\n\nInstruction:\n\nGiven a reference text about Taylor Fritz, tell me what country he's from and his best finish at a Grand Slam tournament?Answer:\n\nTaylor Fritz is from the United States and his best finish in a Grand Slam tournament was reaching the quarterfinals at Wimbledon in 2022.\n\n",
    "Context:\n\nZijldijk has three churches. The Mennomite church was built in 1772 in a non conspicuous barn-like building. It is still in use as a church. The Dutch Reformed church has been reconstructed as a village house. The Reformed Church was constructed in 1886, and nowadays serves as a care facility.\n\nInstruction:\n\nGiven the passage about churches built in the village of Zijldijk in the Netherlands, when was the only running church built?Answer:\n\nThe Mennomite church was built in 1772 and is still in use as a church.\n\n",
    "Context:\n\nChile, officially the Republic of Chile, is a country located in western South America. It is the southernmost country in the world and closest to Antarctica, stretching along a narrow strip of land between the Andes Mountains and the Pacific Ocean. With an area of 756,096 square kilometers (291,930 sq mi) and a population of 17.5 million as of 2017, Chile shares borders with Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage to the south. The country also controls several Pacific islands, including Juan Fernández, Isla Salas y Gómez, Desventuradas, and Easter Island, and claims about 1,250,000 square kilometers (480,000 sq mi) of Antarctica as the Chilean Antarctic Territory.[nb 2] The capital and largest city of Chile is Santiago, and the national language is Spanish.\n\nInstruction:\n\nIs the capital city and the largest city of Chile same or different?Answer:\n\nThey are the same. Santiago.\n\n",
    "Context:\n\nSome time after Donkey Kong Country, Donkey Kong is relaxing on the beach, until he is ambushed by the Kremlings. He gets kidnapped and brought to Kaptain K. Rool, King K. Rool's moniker in this game, who then demands the Banana Hoard he unsuccessfully tried to steal in the previous game for a ransom from the Kongs. Instead of complying, Diddy Kong and his friend Dixie resolve to go to the Kremling's home island, Crocodile Isle, to rescue Donkey Kong. Together, they travel through Crocodile Isle and are helped on their way by an assortment of animals to defeat Kaptain K. Rool. Diddy and Dixie eventually battle and defeat K. Rool, releasing Donkey Kong in the process. K. Rool manages to escape though, and shortly after, Diddy and Dixie confront him in the Lost World, a secret area powered by a geyser at the heart of Crocodile Isle. They once again defeat K. Rool, who is hurled into the geyser, causing it to clog up and explode. The explosion causes all of Crocodile Isle to sink, as the Kongs watch K. Rool escape on a small sailboat.\n\nInstruction:\n\nGiven this article on Donkey Kong Country 2, who is the villain of the plot and where does the story take place?Answer:\n\nKaptain K. Rool is the villain and kidnaps Donkey Kong. The story takes places on the Kremling's home island, Crocodile Isle.\n\n",
    "Context:\n\nIn the first video, Jiang lashed out at Hong Kong journalist Sharon Cheung in Zhongnanhai when he met with Chee-hwa Tung, Chief Executive of Hong Kong at that time. Ms. Cheung asked if Jiang supported Tung's campaign for Chief Executive, which Jiang affirmed. Cheung then asked if it meant the Chinese government had already decided internally to re-appoint Tung. This made Jiang very upset, and criticized her for twisting his words to \"make big news.\" Jiang then continued to criticize the Hong Kong media on the whole, claiming that they need to learn to ask more meaningful questions, even stating that \"Mike Wallace of the US is at a much higher level than you are\", referring to a 2000 interview Jiang gave with 60 Minutes.\nThe second is the famous interview by American journalist Mike Wallace that Jiang referred to in the previous video. In this interview, Wallace and Jiang talked about many touchy subjects, such as democracy and dictatorship in China, freedom of the press, Falun Gong, and the 1989 Tiananmen Square protests.\nThe third video is recorded when Jiang came back to China United Engineering Corporation (Jiang worked there for some years), and Jiang recalled his experience in the video. He also talks about Deng Xiaoping's decision to appoint him as leader of China, and what he considered his achievements during his years of leadership.\n\nInstruction:\n\nWhat is the biggest strength of Hong Kong journalistsAnswer:\n\nMaking big news\n\n",
    "Context:\n\nThe official language of Tunisia is Modern Standard Arabic. The vast majority of Tunisia's population is Arab and Muslim. Vernacular Tunisian Arabic is the most spoken, and French also serves as an administrative and educational language in some contexts, but it has no official status.\n\nTunisia is well integrated into the international community. It is a member of the United Nations, La Francophonie, the Arab League, the OIC, the African Union, the COMESA, the Non-Aligned Movement, the International Criminal Court, and the Group of 77, among others. It maintains close economic and political relations with some European countries, particularly with France, and Italy, due to their geographical proximity. Tunisia also has an association agreement with the European Union and has attained the status of a major non-NATO ally of the United States.\n\nInstruction:\n\nWhat languages are spoken in Tunisia?Answer:\n\nThe official language of Tunisia is Modern Standard Arabic, though vernacular Tunisian Arabic is the most spoken. French also serves as an administrative and educational language in some contexts, but it has no official status.\n\n",
    "Context:\n\nLake Baikal (/baɪˈkɑːl, -ˈkæl/, Russian: Oзеро Байкал, romanized: Ozero Baykal [ˈozʲɪrə bɐjˈkaɫ]) is a rift lake in Russia. It is situated in southern Siberia, between the federal subjects of Irkutsk Oblast to the northwest and the Republic of Buryatia to the southeast. With 23,615.39 km3 (5,670 cu mi) of water, Lake Baikal is the world's largest freshwater lake by volume, containing 22–23% of the world's fresh surface water, more than all of the North American Great Lakes combined. It is also the world's deepest lake, with a maximum depth of 1,642 metres (5,387 feet; 898 fathoms), and the world's oldest lake, at 25–30 million years. At 31,722 km2 (12,248 sq mi)—slightly larger than Belgium—Lake Baikal is the world's seventh-largest lake by surface area. It is among the world's clearest lakes.\n\nBaikal's age is estimated at 25–30 million years, making it the most ancient lake in geological history. It is unique among large, high-latitude lakes, as its sediments have not been scoured by overriding continental ice sheets. Russian, U.S., and Japanese cooperative studies of deep-drilling core sediments in the 1990s provide a detailed record of climatic variation over the past 6.7 million years.\n\nInstruction:\n\nWhat is the largest fresh water lake?Answer:\n\nLake Baikal, located in Russia in the southern region of Sibera is the largest and deepest fresh water lake, containing 20% of Earth's fresh surface water.\n\n",
    "Context:\n\nVice-Admiral Alexander Colville, 7th Lord Colville of Culross (also spelled Colvill) (28 February 1717 – 21 May 1770), served as the Commodore and Commander in Chief of His Majesty's Ships and Vessels in North America from 1757 to 1762. Colville wrote a well-preserved series of detailed, well-written letters to various other military leaders, his family, the King, and other influential people. These letters have provided more historical information about that time period than many other sources available. His writing was so prolific that many of his letters still surface in antique shops from London, to Halifax to New York City. He is a poorly remembered, but important, contributor to the UK control of the North American seas and the battles of the Seven Years' War of 1756–1763.\n\nInstruction:\n\nGiven this paragraph about Vice-Admiral Alexander Colville, tell me when he died and what battles he fought in.Answer:\n\nVice-Admiral Alexander Colville fought in the battles of the Seven Years' War of 1756-1763 and died on May 21, 1770.\n\n",
    "Context:\n\nTelangana (/ˌtɛlənˈɡɑːnə/ (listen); Telugu: [ˈtelaŋɡaːɳa], Urdu: [ˈtɪləŋɡɑːna] (listen)) is a state in India situated on the south-central stretch of the Indian peninsula on the high Deccan Plateau. It is the eleventh-largest state and the twelfth-most populated state in India with a geographical area of 112,077 km2 (43,273 sq mi) and 35,193,978 residents as per 2011 census. On 2 June 2014, the area was separated from the northwestern part of Andhra Pradesh as the newly formed state of Telangana, with Hyderabad as its capital. Its other major cities include Warangal, Nizamabad, Khammam, Karimnagar and Ramagundam. Telangana is bordered by the states of Maharashtra to the north, Chhattisgarh to the northeast, Karnataka to the west, and Andhra Pradesh to the east and south. The terrain of Telangana consists mostly of the Deccan Plateau with dense forests covering an area of 27,292 km2 (10,538 sq mi). As of 2019, the state of Telangana is divided into 33 districts.\n\nInstruction:\n\nWhat is the capital of Telangana?Answer:\n\nHyderabad\n\n",
    "Context:\n\nGeorge Koukou (born 25 May 1945) was acting Speaker of the National Transitional Legislative Assembly of Liberia from 17 March 2005 to January 2006. Originally from Nimba County, he now resides in the capital city of Monrovia. He is a member of the Mano ethnic group.\n\nPrior to becoming a member of the National Transitional Legislative Assembly, Koukou was a senator from Nimba County. Koukou replaced George Dweh as Speaker of the transitional legislature on 17 March 2005 after Dweh was suspended indefinitely on 14 March for spending money without proper authorization.\n\nOn 17 July 2007, Koukou was arrested along with several others, including former army chief of staff Charles Julue, for alleged participation in a coup plot against President Ellen Johnson Sirleaf. He and Julu were charged with treason. Koukou claimed that he did not have the money to hire a lawyer. On 27 August, Monrovia Magistrate Court Judge Milton Taylor ruled that his court could not try Koukou because treason was above its jurisdiction, and he transferred the trial to Criminal Court \"A\".\n\nInstruction:\n\nGiven a reference text about George Koukou, tell me when he was arrested and why.Answer:\n\nGeorge Koukou was arrested on July 17, 2007 for allegedly participating in a coup against President Ellen Johnson Sirleaf.\n\n",
    "Context:\n\nLester D. Menke (December 16, 1918 – March 5, 2016) was a state Representative from the Iowa's 5th and 7th Districts. He served in the Iowa House of Representatives from 1973 to 1985, serving as Speaker pro Tempore from 1981 to 1985. After he served in the Iowa House, Menke served as a liaison between Governor Terry Branstad and the legislature for two years. Menke has a B.A. from Morningside College, where he later served as a member of the board of directors, and attended The University of Iowa College of Law for one year. He worked as a farm owner and for an insurance agency. He served on various school boards and served as president of the Iowa Association of School Boards and State Board of Public Instruction and as director of the National Association of State Boards of Education, as well as serving on the Iowa Educational Radio and Television Facilities Board. Menke received Morningside College's Distinguished Alumni award in 1975.\n\nInstruction:\n\nWho was Lester MenkeAnswer:\n\nLester D. Menke (December 16, 1918 – March 5, 2016) was a state Representative from the Iowa's 5th and 7th Districts. He served in the Iowa House of Representatives from 1973 to 1985, serving as Speaker pro Tempore from 1981 to 1985. \n\nAfter he served in the Iowa House, Menke served as a liaison between Governor Terry Branstad and the legislature for two years. Menke has a B.A. from Morningside College, where he later served as a member of the board of directors, and attended The University of Iowa College of Law for one year. He worked as a farm owner and for an insurance agency.\n\nHe served on various school boards and served as president of the Iowa Association of School Boards and State Board of Public Instruction and as director of the National Association of State Boards of Education, as well as serving on the Iowa Educational Radio and Television Facilities Board. Menke received Morningside College's Distinguished Alumni award in 1975.\n\n",
    "Context:\n\nThe bulk of dried spaghetti is produced in factories using auger extruders. While essentially simple, the process requires attention to detail to ensure that the mixing and kneading of the ingredients produces a homogeneous mix, without air bubbles. The forming dies have to be water cooled to prevent spoiling of the pasta by overheating. Drying of the newly formed spaghetti has to be carefully controlled to prevent strands sticking together, and to leave it with sufficient moisture so that it is not too brittle. Packaging for protection and display has developed from paper wrapping to plastic bags and boxes.\n\nInstruction:\n\nGiven a reference text about dried spaghetti production, what is required to produce spaghetti without errors?Answer:\n\nSpaghetti production is straight-forward, but requires the maker to ensure the mixture is homogenous and without air bubbles before starting the drying process. The drying process itself needs to be monitored to ensure that the individual spaghetti strands do not stick together but also do not dry out so much that they become brittle\n\n",
    "Context:\n\nThe greater blue-ringed octopus (Hapalochlaena lunulata) is one of four species of extremely venomous blue-ringed octopuses belonging to the family Octopodidae. This particular species of blue-ringed octopus is known as one of the most toxic marine animals in the world.\n\nInstruction:\n\nHow many arms does Hapalochlaena lunulata have?Answer:\n\nHapalochlaena lunulata is an octopus, so it must have eight arms.\n\n",
    "Context:\n\nCoffee is a beverage prepared from roasted coffee beans. Darkly colored, bitter, and slightly acidic, coffee has a stimulating effect on humans, primarily due to its caffeine content. It has the highest sales in the world market for hot drinks.\n\nSeeds of the Coffea plant's fruits are separated to produce unroasted green coffee beans. The beans are roasted and then ground into fine particles that are typically steeped in hot water before being filtered out, producing a cup of coffee. It is usually served hot, although chilled or iced coffee is common. Coffee can be prepared and presented in a variety of ways (e.g., espresso, French press, caffè latte, or already-brewed canned coffee). Sugar, sugar substitutes, milk, and cream are often used to mask the bitter taste or enhance the flavor.\n\nThough coffee is now a global commodity, it has a long history tied closely to food traditions around the Red Sea. The earliest credible evidence of coffee drinking in the form of the modern beverage appears in modern-day Yemen from the mid-15th century in Sufi shrines, where coffee seeds were first roasted and brewed in a manner similar to current methods. The Yemenis procured the coffee beans from the Ethiopian Highlands via coastal Somali intermediaries and began cultivation. By the 16th century, the drink had reached the rest of the Middle East and North Africa, later spreading to Europe. In the 20th century, coffee became a global commodity, creating different coffee cultures around the world.\n\nThe two most commonly grown coffee bean types are C. arabica and C. robusta. Coffee plants are cultivated in over 70 countries, primarily in the equatorial regions of the Americas, Southeast Asia, the Indian subcontinent, and Africa. As of 2018, Brazil was the leading grower of coffee beans, producing 35% of the world's total. Green, unroasted coffee is traded as an agricultural commodity. Despite sales of coffee reaching billions of dollars worldwide, farmers producing coffee beans disproportionately live in poverty. Critics of the coffee industry have also pointed to its negative impact on the environment and the clearing of land for coffee-growing and water use\n\nInstruction:\n\nBased on the reference text about coffee, tell me where coffee plants are primarily grown and the most common bean types.Answer:\n\nCoffee plants are cultivated mainly in the equatorial regions of the Americas, Southeast Asia, the Indian subcontinent, and Africa. The most common types of coffee beans are arabica and robusta.\n\n",
    "Context:\n\nAs a career, Waldo E. Koop was an engineer for Boeing. He was called one of the nation's finest researchers by local and state historians, and was credited in the series of Time Life books on the Old West for his research on gunfighters. Koop discovered that Henry McCarty, later known as Billy the Kid, spent time in Wichita, Kansas, where he saw his first gunfight. He published his findings in 1965 in the book, Billy the Kid: the Trail of a Kansas Legend.\n\nInstruction:\n\nWhere did Waldo E. Koop work?Answer:\n\nWaldo E. Koop was an engineer for Boeing before becoming one of the nation's finest researchers.\n\n",
    "Context:\n\nThroughout the 19th century, the population of Mexico had barely doubled. This trend continued during the first two decades of the 20th century. The 1921 census reported a loss of about 1 million inhabitants. The Mexican Revolution (c. 1910–1920) greatly impacted population increases. The growth rate increased dramatically between the 1930s and the 1980s, when the country registered growth rates of over 3% (1950–1980). The Mexican population doubled in twenty years, and at that rate it was expected that by 2000 there would be 120 million people living in Mexico. Life expectancy increased from 36 years (in 1895) to 72 years (in the year 2000). According to estimations made by Mexico's National Geography and Statistics Institute, is estimated in 2022 to be 129,150,971 as of 2017 Mexico had 123.5 million inhabitants making it the most populous Spanish-speaking country in the world.\n\nInstruction:\n\nGiven this paragraph about a country, what is the most populous Spanish-speaking country?Answer:\n\nMexico\n\n",
    "Context:\n\nFinal Fantasy is a Japanese science fantasy anthology media franchise created by Hironobu Sakaguchi and developed and owned by Square Enix (formerly Square). The franchise centers on a series of fantasy and science fantasy role-playing video games. The first game in the series was released in 1987, with 15 numbered main entries having been released to date.\n\nInstruction:\n\nWho created Final Fantasy?Answer:\n\nFinal Fantasy was created by Hironobu Sakaguchi\n\n",
    "Context:\n\nThere are two subgroups of austenitic stainless steel. 300 series stainless steels achieve their austenitic structure primarily by a nickel addition while 200 series stainless steels substitute manganese and nitrogen for nickel, though there is still a small nickel content.\n\nInstruction:\n\nGiven this paragraph about stainless steel, which of the two series contains the most nickel content?Answer:\n\nThe 300 series contains the most nickel content.\n\n",
    "Context:\n\nIn the late 1920s after the construction of a road from El Arish, the area became a popular camping place. It was known as Mission Beach due to the mistaken belief that the Hull River Aboriginal Settlement previously located in the region was a religious mission. Mission Beach developed into a town during the 1940s and 50s with the Mission Beach Post Office opening on 15 December 1949.\n\nInstruction:\n\nWhen did the Post Office in Mission Beach first open?Answer:\n\nMission Beach Post Office opened on 15 December 1949.\n\n",
    "Context:\n\nKang Se-jung (born January 15, 1982) is a South Korean actress. She made her entertainment debut as a singer for the K-pop girl group Papaya in 2000; the group released two albums before disbanding in 2001. Kang began acting full-time in 2004, and has appeared in television series such as Assorted Gems (2009) and Heartless City (2013). Upon turning to acting, she used the stage name Go Na-eun before reverting to use of her birth name in 2017.\n\nInstruction:\n\nList the television series Kang Se-jung appeared inAnswer:\n\n- Assorted Gems\n- Heartless City\n\n",
    "Context:\n\nThe Parliamentary Commissioner for Standards is an officer of the British House of Commons. The work of the officer is overseen by the Commons Select Committee on Standards.\n\nThe current commissioner is Daniel Greenberg.\n\nDuties\nThe commissioner is in charge of regulating MPs' conduct and propriety. One of the commissioner's main tasks is overseeing the Register of Members' Financial Interests, which is intended to ensure disclosure of financial interests that may be of relevance to MPs' work.\n\nThe Commissioner is the decision-maker in cases from the Independent Complaints and Grievance Scheme where the respondent is a Member of Parliament. If the Commissioner deems a sanction warranted, they refer cases to the Independent Expert Panel so the appropriate sanction can be determined.\n\nThe Parliamentary Commissioner for Standards is appointed by a resolution of the House of Commons for a fixed term of five years and is an independent officer of the House, working a four-day week. The remit of the Parliamentary Commissioner for Standards does not extend to the House of Lords: the post of Lords Commissioner for Standards was created in 2010.\n\nInstruction:\n\nGiven a reference text about the Parliamentary Commissioner for Standards, how is the position appointed?Answer:\n\nThe Parliamentary Commissioner for Standards is appointed by a resolution of the House of Commons for a fixed term of five years.\n\n",
    "Context:\n\nThe Emancipation Proclamation, officially Proclamation 95, was a presidential proclamation and executive order issued by United States President Abraham Lincoln on January 1, 1863, during the Civil War. The Proclamation changed the legal status of more than 3.5 million enslaved African Americans in the secessionist Confederate states from enslaved to free. As soon as slaves escaped the control of their enslavers, either by fleeing to Union lines or through the advance of federal troops, they were permanently free. In addition, the Proclamation allowed for former slaves to \"be received into the armed service of the United States\".\n\nInstruction:\n\nGiven the reference text about the Emancipation Proclamation, approximately how many enslaved African Americans were freed?Answer:\n\nApproximately 3.5 million enslaved African Americans were freed by the Emancipation Proclamation.\n\n",
    "Context:\n\nAugust 15, 1947\n\nInstruction:\n\nGiven this paragraph about battles during India Independence day, what was the date when India win the IndependenceAnswer:\n\nIndependence Day is celebrated annually on 15 August as a public holiday in India commemorating the nation's independence from the United Kingdom on 15 August 1947, the day when the provisions of the Indian Independence Act, which transferred legislative sovereignty to the Indian Constituent Assembly, came into effect. India retained King George VI as head of state until its transition to a republic, when the Constitution of India came into effect on 26 January 1950 (celebrated as Indian Republic Day) and replaced the dominion prefix, Dominion of India, with the enactment of the sovereign law Constitution of India. India attained independence following the independence movement noted for largely non-violent resistance and civil disobedience.\n\n",
    "Context:\n\nPink Floyd are an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.\n\nPink Floyd were founded in 1965 by Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), and Richard Wright (keyboards, vocals). Under Barrett's leadership, they released two charting singles and the successful debut album The Piper at the Gates of Dawn (1967). The guitarist and vocalist David Gilmour joined in January 1968; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind Pink Floyd's most successful albums, The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977) and The Wall (1979). The musical film based on The Wall, Pink Floyd – The Wall (1982), won two BAFTA Awards. Pink Floyd also composed several film scores.\n\nFollowing personal tensions, Wright left Pink Floyd in 1981, followed by Waters in 1985. Gilmour and Mason continued as Pink Floyd, rejoined later by Wright. They produced the albums A Momentary Lapse of Reason (1987) and The Division Bell (1994), backed by major tours, before entering a long hiatus. In 2005, all but Barrett reunited for a performance at the global awareness event Live 8. Barrett died in 2006, and Wright in 2008. The last Pink Floyd studio album, The Endless River (2014), was based on unreleased material from the Division Bell recording sessions. In 2022, Gilmour and Mason reformed Pink Floyd to release the song \"Hey, Hey, Rise Up!\" in protest of the Russo-Ukrainian War.\n\nBy 2013, Pink Floyd had sold more than 250 million records worldwide, making them one of the best-selling music artists of all time. The Dark Side of the Moon and The Wall were inducted into the Grammy Hall of Fame, and these albums and Wish You Were Here are among the best-selling albums of all time. Four Pink Floyd albums topped the US Billboard 200, and five topped the UK Albums Chart. Pink Floyd's hit singles include \"See Emily Play\" (1967), \"Money\" (1973), \"Another Brick in the Wall, Part 2\" (1979), \"Not Now John\" (1983), \"On the Turning Away\" (1987) and \"High Hopes\" (1994). They were inducted into the US Rock and Roll Hall of Fame in 1996 and the UK Music Hall of Fame in 2005. In 2008, Pink Floyd were awarded the Polar Music Prize in Sweden for their contribution to modern music.\n\nInstruction:\n\nGiven a reference text about the rock band Pink Floy: What was the name of Pink Floyd's last album and when was it released?Answer:\n\nThe last album of Pink Floyd was called \"The Endless River\" and was released in 2014.\n\n",
    "Context:\n\nAmanecer is an album by Bomba Estéreo. It earned Bomba Estéreo a Latin Grammy Award nomination for Best Alternative Music Album and a Grammy Award nomination for Best Latin Rock, Urban or Alternative Album. It peaked at number 17 on the Billboard Top Latin Albums chart. It was also considered the best Latin album of 2015 by Rolling Stone.\n\nIt includes the viral hit \"Soy Yo\", which features Costa Rican child star Sarai Gonzalez, and received over 109 million views on YouTube. The song and video were called a \"celebration of self and a symbol of proud Latinidad\" and \"an ode to brown girls\".\n\nInstruction:\n\nGiven a reference text about Amanecer, who made the album and what viral song did it include?Answer:\n\nBomba Estéreo made the album Amanecer. The album includes the viral song \"Soy Yo\".\n\n",
    "Context:\n\nSouth Willington's industrial history began in 1840, when Origen Hall and two partners founded the Willington Thread Company. Hall and his brother Gardner founded a second company in 1848 for the production of cotton wadding and batting. After several failed business ventures, Gardiner Hall founded the Hall Thread Company in 1860, building what is now the oldest surviving industrial building in the village. This venture also failed due to a lack of cotton occasioned by the American Civil War, but Hall restarted the business in 1867. This business flourished, operating at the site until 1954. The Halls practiced a paternalistic form of management and care of the mill workers, building a school and church, as well as housing for their workers. The company's success was instrumental in the village's growth during the late 19th and early 20th centuries.\n\nInstruction:\n\nBased on this paragraph, what industry did Gardiner Hall create a business in and how was it impacted by the Civil War?Answer:\n\nGardiner Hall was in the textile business and ran the Hall Thread Company. His business was impacted by the Civil War due to a cotton shortage, but he restarted the business following the Civil War.\n\n",
    "Context:\n\nIn graph theory and computer science, an adjacency list is a collection of unordered lists used to represent a finite graph. Each unordered list within an adjacency list describes the set of neighbors of a particular vertex in the graph. This is one of several commonly used representations of graphs for use in computer programs.\n\nInstruction:\n\nWhat is an adjacency list?Answer:\n\nIn graph theory and computer science, an adjacency list is a collection of unordered lists used to represent a finite graph.\n\n",
    "Context:\n\nThe action of 12 December 1782 was a naval engagement fought off the coast of Spain near Ferrol, in which the British 40-gun fifth rate HMS Mediator successfully attacked a convoy of five armed ships. Mediator succeeded in capturing one American privateer, the Alexander, and then captured the French ex-ship of the line La Ménagère. The convoy was part of Pierre Beaumarchais's supply chain to the American colonists.\n\nInstruction:\n\nWhat exactly was the action of 12 December 1782Answer:\n\nThe action of 12 December 1782 was a naval engagement fought off the coast of Spain near Ferrol, in which the British 40-gun fifth rate HMS Mediator successfully attacked a convoy of five armed ships. \n\nMediator succeeded in capturing one American privateer, the Alexander, and then captured the French ex-ship of the line La Menagere. The convoy was part of Pierre Beaumarchais's supply chain to the American colonists.\n\n",
    "Context:\n\nThe New JEWEL Movement (NJM) was formally established on 11 March 1973 as an alliance of the Joint Endeavor for Welfare, Education, and Liberation (JEWEL), Organization for Revolutionary Education and Liberation, and the Movement for Assemblies of the People (MAP), led by young lawyer Maurice Bishop. The NJM's initial manifesto was largely drafted by MAP's major intellectual, Franklyn Harvey, who had been heavily influenced by the writings of C.L.R. James. From 1973 to 1979, the NJM was an opposition political party active in Grenada. During the 1970s, the political situation in Grenada became increasingly polarized and violent. For the 1976 general elections the organisation formed an electoral coalition known as the People's Alliance with the Grenada National Party and the United People's Party. However, the alliance lost to the ruling Grenada United Labour Party in elections which were branded fraudulent by international observers. In the late 1970s, the NJM formed the National Liberation Army (NLA), also known as \"the 12 Apostles\".\n\nInstruction:\n\nBased on this information given, what groups combined to create the New JEWEL Movement, and on what date were they organized by which leader?Answer:\n\nOn March 11th 1973, Maurice Bishop brought together the Joint Endeavor for Welfare, Education, and Liberation (JEWEL), Organization for Revolutionary Education and Liberation, and the Movement for Assemblies of the People to form the New JEWEL Movement.\n\n",
    "Context:\n\nMussa Azzan Zungu (born 25 May 1952) is a Tanzanian CCM politician and Deputy Speaker of Tanzania National Assembly. He's also current Member of Parliament for Ilala constituency since 2005.\n\nHe has continued to retain the parliamentary seat in 2010 & 2015. He was appointed as the Minister of State in the Vice President's office on January 24, 2020 and server for 6 months before the parliament was dissolved on June 16, 2020. He is now the Deputy Speaker following the resignation of the former Speaker Job Ndugai, and the, by then, Deputy Speaker Dr. Tulia Ackson elected to become current Speaker of the Parliament.\n\nInstruction:\n\nGiven a reference text about Mussa Azzan Zungu, tell me his current position.Answer:\n\nMussa Azzan Zungu's current position is Deputy Speaker of Tanzania National Assembly.\n\n",
    "Context:\n\nIn computing, a materialized view is a database object that contains the results of a query. For example, it may be a local copy of data located remotely, or may be a subset of the rows and/or columns of a table or join result, or may be a summary using an aggregate function.\n\nInstruction:\n\nWhat is Materialized View?Answer:\n\nIn Database, a materialized view (MV) is a database object that stores the results of a query. It can be a copy of data from a remote location, a subset of rows and/or columns from a table or join result, or a summary using an aggregate function. MV is normally used for frequent queries of based tables.\n\n",
    "Context:\n\nHomelessness in the San Francisco Bay Area\n\nOne of the primary causes of homelessness in the Bay Area is an insufficient supply of affordable housing. Mass homelessness has several contributing factors, including: \"Economic Dislocation\", \"Reduced Social Safety Nets\", \"Failed Housing Policy\", \"Mass Incarceration\", \"Family Instability\", and other \"Individual Causes\" including mental health and physical wellness. Reasons cited for homelessness in the 2019 survey commissioned by the City of San Francisco include job loss (26%), alcohol/drug use (18%), eviction (13%), argument/asked to leave by friend/family (12%), mental health issues (8%), and divorce/separation (5%). 70% of people homeless in San Francisco in 2019 reported most recently becoming homeless while living in San Francisco: 22% came from another county within California, and 8% came from another state. However, of the 70% who had become homeless while living in San Francisco, 45% had only been in San Francisco for ten years or less, and 6% had only been in San Francisco for one year or less. Reasons for coming from outside San Francisco at the time of homelessness include seeking a job (25%), LGBTQ acceptance (11%), accessing homeless services (22%), was visiting and decided to stay (17%), accessing VA services or clinic (5%), and family/friends are here (13%).\n\nInstruction:\n\nBased on the reference text, what were the main reasons homeless people from outside of San Francisco went to San Francisco?Answer:\n\nThe reasons homeless people not from San Francisco went to San Francisco include:\n1. Seeking a job\n2. LGBTQ acceptance\n3. Accessing homeless services\n4. Was visiting and decided to stay\n5. Family or friends live in San Francisco\n6. Accessing VA services or clinic\n\n",
    "Context:\n\nChatGPT was launched as a prototype on November 30, 2022. It garnered attention for its detailed responses and articulate answers across many domains of knowledge. Its uneven factual accuracy, however, has been identified as a significant drawback. Following the release of ChatGPT, OpenAI's valuation was estimated at US$29 billion in 2023.\n\nThe original release of ChatGPT was based on GPT-3.5. A version based on GPT-4, the newest OpenAI model, was released on March 14, 2023, and is available for paid subscribers on a limited basis.\n\nInstruction:\n\nGiven the introduction of ChatGPT, tell me how many releases there are since the fist launch and when they were launched.Answer:\n\nThere are two ChatGPT versions so far. The first release was on Nov 23rd, 2022, and the second launch was released on Mar 14th, 2023.\n\n",
    "Context:\n\nThe Quit India Movement, also known as the Bharat Chhodo Andolan, was a movement launched at the Bombay session of the All India Congress Committee by Mahatma Gandhi on 8th August 1942, during World War II, demanding an end to British rule in India.\n\nAfter the British failed to secure Indian support for the British war effort with Cripps Mission, Gandhi made a call to Do or Die in his Quit India movement delivered in Bombay on 8 August 1942 at the Gowalia Tank Maidan. Viceroy Linlithgow remarked the movement to be \"by far the most serious rebellion since 1857\".\n\nThe All India Congress Committee launched a mass protest demanding what Gandhi called \"An Orderly British Withdrawal\" from India. Even though it was at war, the British were prepared to act. Almost the entire leadership of the Indian National Congress was imprisoned without trial within hours of Gandhi's speech. Most spent the rest of the war in prison and out of contact with the masses. The British had the support of the Viceroy's Council, of the All India Muslim League, the Hindu Mahasabha, the princely states, the Indian Imperial Police, the British Indian Army, and the Indian Civil Service. Many Indian businessmen profiting from heavy wartime spending did not support the Quit India Movement. The major outside support came from the Americans, as President Franklin D. Roosevelt pressured Prime Minister Winston Churchill to give in to some of the Indian demands.\n\nVarious violent incidents took place around the country against the British regime. The British arrested tens of thousands of leaders, keeping them imprisoned until 1945. Ultimately, the British government realised that India was ungovernable in the long run, and the question for the postwar era became how to exit gracefully and peacefully.\n\nInstruction:\n\nWho were supporters of Quit India movement?Answer:\n\nIndian National Congress\nAmerican president Franklin D Roosevelt\n\n",
    "Context:\n\nFasting is the abstention from eating and sometimes drinking. From a purely physiological context, \"fasting\" may refer to the metabolic status of a person who has not eaten overnight (see \"Breakfast\"), or to the metabolic state achieved after complete digestion and absorption of a meal. Metabolic changes in the fasting state begin after absorption of a meal (typically 3–5 hours after eating).\n\nInstruction:\n\nWhat does fasting mean?Answer:\n\nFasting is the abstention from eating and sometimes drinking.\n\n",
    "Context:\n\nIn 1907, the eclectic interests of the land baron Henry E. Huntington brought surfing to the California coast. While on vacation, Huntington had seen Hawaiian boys surfing the island waves. Looking for a way to entice visitors to the area of Redondo Beach, where he had heavily invested in real estate, he hired a young Hawaiian to ride surfboards. George Freeth decided to revive the art of surfing, but had little success with the huge 500 cm (16 ft) hardwood boards that were popular at that time. When he cut them in half to make them more manageable, he created the original \"Long board\", which made him the talk of the islands. To the delight of visitors, Freeth exhibited his surfing skills twice a day in front of the Hotel Redondo. Another native Hawaiian, Duke Kahanamoku, spread surfing to both the U.S. and Australia, riding the waves after displaying the swimming prowess that won him Olympic gold medals in 1912 and 1920.\n\nInstruction:\n\nWhat are the origins or surfing in California?Answer:\n\nSurfing as a local pastime is a natural fit for most Californian's living near the coast. The rise in popularity of beach life in Southern California and especially the film \"Gidget\" exploded the desire to be a part of the rising surf culture. California was looked upon by most of the nation as trend setting and surfing served as the epitome of cool for most people looking from afar.\n\n",
    "Context:\n\nNašiměřice (German: Aschmeritz) is a municipality and village in Znojmo District in the South Moravian Region of the Czech Republic. It has about 200 inhabitants.\n\nNašiměřice lies approximately 28 kilometres (17 mi) north-east of Znojmo, 32 km (20 mi) south-west of Brno, and 189 km (117 mi) south-east of Prague.\n\nInstruction:\n\nWhere is the city of NasimericeAnswer:\n\nNasimerice (German: Aschmeritz) is a municipality and village in Znojmo District in the South Moravian Region of the Czech Republic. It has about 200 inhabitants.\n\nNasimerice lies approximately 28 kilometres (17 mi) north-east of Znojmo, 32 km (20 mi) south-west of Brno, and 189 km (117 mi) south-east of Prague.\n\n",
    "Context:\n\nAccording to the World Register of Marine Species, there are only two genera in this family. Previously there were about 26, but most of these have been reallocated as sub-genera of the remaining two genera, Mycale and Phlyctaenopora:\n\nInstruction:\n\nIf there are only two genera remaining, what happened to the other 24?Answer:\n\nMost of the other 24 were reallocated as sub-genera of the remaining two genera.\n\n",
    "Context:\n\nAustin FC played their first MLS match against LAFC at Banc of California Stadium on April 17, 2021, losing 0–2. The club secured its first victory the following week against the Colorado Rapids, winning 3–1. Diego Fagúndez scored the club's first goal and the following two were scored by the club's first Designated Player, Cecilio Dominguez. Their home opener was held on June 19, 2021, against the San Jose Earthquakes, a match which ended in a scoreless draw. The team secured its first ever home victory on July 1, 2021, defeating the Portland Timbers 4–1. Jon Gallagher scored the team's first home goal and the first MLS goal at Q2 Stadium.\n\nInstruction:\n\nWho scored first in Austin FC's first victory in a home game in the 2021 MLS season?Answer:\n\nJon Gallagher scored the first goal in Austin FC's first win at home, over the Portland Timbers.\n\n",
    "Context:\n\nThe LP (from \"long playing\" or \"long play\") is an analog sound storage medium, a phonograph record format characterized by: a speed of 33+1⁄3 rpm; a 12- or 10-inch (30- or 25-cm) diameter; use of the \"microgroove\" groove specification; and a vinyl (a copolymer of vinyl chloride acetate) composition disk. Introduced by Columbia in 1948, it was soon adopted as a new standard by the entire record industry. Apart from a few relatively minor refinements and the important later addition of stereophonic sound, it remained the standard format for record albums (during a period in popular music known as the album era) until its gradual replacement from the 1980s to the early 2000s, first by cassettes, then by compact discs, and finally by digital music distribution.\n\nInstruction:\n\nWhich record label created VinylAnswer:\n\nVinyl was introduced by Columbia in 1948\n\n",
    "Context:\n\nJesus Shuttlesworth, the top high-school basketball player in the United States, is being pursued by the top college basketball programs in the nation. His father, Jake, is a convicted felon serving time at Attica Correctional Facility for accidentally killing his wife, Martha, Jesus' mother, six years earlier. Jake is granted a work release by the governor, an influential alumnus of \"Big State,\" one of the colleges Jesus is considering, so that he might persuade his son to sign with Big State. If successful, he'll get an early release from prison.\nhttps://en.wikipedia.org/wiki/He_Got_Game\n\nInstruction:\n\nBased on this paragraph, why was Jake released from prison?Answer:\n\nJake was released from prison to try to help convince his son to play basketball for the governor's alma mater.\n\n",
    "Context:\n\nAn outdoor observation deck, named At the Top, opened on 5 January 2010 on the 124th floor. At 452 m (1,483 ft), it was the highest outdoor observation deck in the world when it opened. Although it was surpassed in December 2011 by Cloud Top 488 on the Canton Tower, Guangzhou at 488 m (1,601 ft), Burj Khalifa opened the 148th floor SKY level at 555 m (1,821 ft), once again giving it the highest observation deck in the world on 15 October 2014, until the Shanghai Tower opened in June 2016 with an observation deck at a height of 561 metres. The 124th floor observation deck also features the electronic telescope, an augmented reality device developed by Gsmprjct° of Montréal, which allows visitors to view the surrounding landscape in real-time, and to view previously saved images such as those taken at different times of day or under different weather conditions. To reduce the daily rush of sightseers, management allows visitors to purchase tickets in advance for a specific date and time, at a 75% discount on tickets purchased on the spot.\n\nInstruction:\n\nGiven the following paragraph about the observation deck of the Burj Khalifa, what's offered on the 124th floor observation deck?Answer:\n\nThis observation deck offers an augmented reality electronic telescope which lets visitors view either real-time or pre-recorded images of the surrounding landscape.\n\n",
    "Context:\n\nAfter using the Gamebryo engine to create The Elder Scrolls III: Morrowind, The Elder Scrolls IV: Oblivion, and Fallout 3, Bethesda decided that Gamebryo's capabilities were becoming too outdated and began work on the Creation Engine for their next game, The Elder Scrolls V: Skyrim, by forking the codebase used for Fallout 3.\n\nFollowing the completion of Skyrim, Bethesda set out to enhance the graphical core of the Creation Engine by first adding a physically based deferred renderer to allow for more dynamic lighting and to paint materials object surfaces with realistic materials. Bethesda worked with technology company Nvidia to implement volumetric lighting through a technique that makes use of hardware tesselation. Additionally the updated version of the Creation Engine powering Bethesda's Fallout 4 offers more advanced character generation.\n\nInstruction:\n\nWhat's the game engine used by Bethesda before Creation Engine? And what's the last game make with it?Answer:\n\nGamebryo was the engine used by Bethesda before Creation Engine. It is developed by Gamebase Cot., Ltd and Gamebase USA. Gamebryo is used by numerous companies within the gaming industry.\n\nBethesda decided that Gamebryo's capabilities were becoming too outdated and began work on the Creation Engine for their next game, The Elder Scrolls V: Skyrim, by forking the codebase used for Fallout 3.\n\nThe last game from Bethesda made with Gamebryo engine is Fallout 3 (2008).\n\n",
    "Context:\n\nGlowworm, was briefly the name of a coastal destroyer launched on 12 December 1906 and renamed HMS TB7. It was sold in May 1921.\nHMS Glowworm (1916), an Insect-class gunboat, launched on 5 February 1916 and sold in 1928.\nHMS Glowworm (H92), a G-class destroyer launched on 22 July 1935, sunk on 8 April 1940 by the German heavy cruiser Admiral Hipper off Norway.\nGlowworm was allocated to a G-class destroyer under construction at the William Denny shipyard at Dumbarton in 1945. The vessel was originally called HMS Guinevere but was renamed in September 1945 to HMS Glowworm, and renamed again in October to HMS Gift. Construction was cancelled on 1 December 1945 before completion.\n\nInstruction:\n\nWhen was HMS Glowworm (H92), a G-class destroyer launched?Answer:\n\nThe HMS Glowworm (H92), a G-class was launched in July 22nd, 1935.\n\n",
    "Context:\n\nThe first modern swim/bike/run event was held at Mission Bay, San Diego, California on September 25, 1974. The race was conceived and directed by two members of the San Diego Track Club, Jack Johnstone and Don Shanahan. Johnstone recalls that he was a part of the 70s jogging craze in America and that after entering a few races he was not regaining his \"mediocre fitness\" despite having been a member of the 1957 Collegiate and AAU All-American swim teams. Then in 1973, Johnstone learned of the Dave Pain Birthday Biathlon, a 7.2 km (4.5 mi) run followed by what was billed as a quarter-mile (0.4 km) swim (the actual distance was only between 200 and 300 yards). The following year, after competing in the event for the second time and placing in the top ten, Johnstone desired more of this style of race and with equal emphasis on the swim. So he petitioned the chairman of the San Diego Track Club who told him he would add a race to the club calendar. But the rest of the race was up to Johnstone to organise, and at the same time he was to contact Don Shanahan so there wouldn't be too many \"weird\" races on the club schedule. Shanahan told Johnstone that he wanted to include a biking leg to the race; whilst hesitant Johnstone agreed to the addition. When naming the event the pair used the unofficially agreed naming system for multisport events, already used for pentathlon, heptathlon, and decathlon. So they used the Greek prefix tri (three) for the number of events, followed by the already familiar athlon, hence naming the event the Mission Bay Triathlon. It is worthy of note that neither founder had heard of the French events; both believed their race was a unique idea.\n\nInstruction:\n\nGiven this paragraph about modern triathlon, what year did the two founders form mission bay triathlon.Answer:\n\nModern day triathlon is believed to have occurred in 1974 when founded by two members of the San Diego track club, Don Shanahan and Jack Johnstone. Although the pair reportedly founded the sport, it's important to understand not everything is created and owned by americans. The sport can be traced back to france in 1901, originally called \"Le Trois Sports\", which included Bike, Run and Canoe disciplines. Other forms of multisport had occurred before 1974 including biathlon which included a run of 7.2km followed by a swim of 0.4km) but Nonetheless, on the 25th September 1974, triathlon mission bay in San Diego, California was born.\n\n"
]