[
    "Instruction:\n\nAccording to this paragraph about UVA, what is the PAC room?Context:\n\nThe student life building is called Newcomb Hall. It is home to the Student Activities Center (SAC) and the Media Activities Center (MAC), where student groups can get leadership consulting and use computing and copying resources, as well as several meeting rooms for student groups. Student Council, the student self-governing body, holds meetings Tuesdays at 6:30 p.m. in the Newcomb South Meeting Room. Student Council, or \"StudCo\", also holds office hours and regular committee meetings in the newly renovated Newcomb Programs and Council (PAC) Room. The PAC also houses the University Programs Council and Class Councils. Newcomb basement is home to both the office of the independent student newspaper The Declaration, The Cavalier Daily, and the Consortium of University Publications.\n\nAnswer:\n\nThe PAC room is the Newcomb Programs and Council Room, that also houses the University Programs Council and Class Councils.\n\n",
    "Instruction:\n\nWhere is the Stade Louis-ll located?Context:\n\nThe Stade Louis-II, also known as Louis II (French pronunciation: ​[stad(ə) lwi dø]) is a stadium located in the Fontvieille district of Monaco. It serves primarily as a venue for football, being the home of AS Monaco and the Monaco national football team. The stadium is most notable for its distinctive nine arches at the away end of the ground. The arena is also used for the Herculis, a track and field meet of the Diamond League. The stadium hosted the 1986 and 1998–2012 UEFA Super Cup matches. Due to Monaco's small size, the stadium is the only football and athletics stadium in the country.\n\nAnswer:\n\nThe Stade Louis-ll is located in the Fontvielle district of Monaco.\n\n",
    "Instruction:\n\nWhich Shakespeare play inspired West Side Story?Context:\n\n\"West Side Story is a musical conceived by Jerome Robbins with music by Leonard Bernstein, lyrics by Stephen Sondheim, and a book by Arthur Laurents.\n\nInspired by William Shakespeare's play Romeo and Juliet, the story is set in the mid-1950s in the Upper West Side of Manhattan in New York City, then a multiracial, blue-collar neighborhood. The musical explores the rivalry between the Jets and the Sharks, two teenage street gangs of different ethnic backgrounds. The Sharks, who are recent migrants from Puerto Rico, and the Jets, who are white, vie for dominance of the neighborhood, and the police try to keep order. The young protagonist, Tony, a former member of the Jets and best friend of the gang's leader, Riff, falls in love with Maria, the sister of Bernardo, the leader of the Sharks. The dark theme, sophisticated music, extended dance scenes, tragic love story, and focus on social problems marked a turning point in musical theatre.\"\n\nAnswer:\n\nWest Side Story was inspired by William Shakespeare's play Romeo and Juliet.\n\n",
    "Instruction:\n\nWhen was slavery abolished in the United States?Context:\n\nAfter the United States was founded in 1776, abolition of slavery occurred in the Northern United States. The country was split into slave and free states. Still, slavery was not finally ended throughout the nation until near the end of the American Civil War and the passage of the Thirteenth Amendment in 1865.\n\nAnswer:\n\nSlavery was abolished via the Thirteenth Amendment in 1865 near the end of the American Civil War\n\n",
    "Instruction:\n\nWhat team did Bobby Orr play for in his 5th season?Context:\n\nRobert Gordon Orr OC (born March 20, 1948) is a Canadian former professional ice hockey player, widely acknowledged as one of the greatest of all time. Orr used his ice skating speed, scoring, and play-making abilities to revolutionize the position of defenceman. He played in the National Hockey League (NHL) for 12 seasons, the first 10 with the Boston Bruins, followed by two with the Chicago Black Hawks. Orr remains the only defenceman to have won the league scoring title with two Art Ross Trophies. He holds the record for most points and assists in a single season by a defenceman. Orr won a record eight consecutive Norris Trophies as the NHL's best defenceman and three consecutive Hart Trophies as the league's most valuable player (MVP). Orr was inducted into the Hockey Hall of Fame in 1979 at age 31, the youngest to be inducted at that time. In 2017, Orr was named by the National Hockey League as one of the \"100 Greatest NHL Players\" in history.\n\nAnswer:\n\nBobby Orr played for the Boston Bruins in his 5th season in the National Hockey League (NHL).\n\nHe played in the NHL for 12 seasons, the first 10 with the Boston Bruins, followed by two with the Chicago Black Hawks.\n\n",
    "Instruction:\n\nGiven this paragraph about Africa, why Africa's per capita  GDP is low?Context:\n\nAfrica is the world's second-largest and second-most populous continent, after Asia in both aspects. At about 30.3 million km2 (11.7 million square miles) including adjacent islands, it covers 20% of Earth's land area and 6% of its total surface area. With 1.4 billion people as of 2021, it accounts for about 18% of the world's human population. Africa's population is the youngest amongst all the continents; the median age in 2012 was 19.7, when the worldwide median age was 30.4. Despite a wide range of natural resources, Africa is the least wealthy continent per capita and second-least wealthy by total wealth, behind Oceania. Scholars have attributed this to different factors including geography, climate, tribalism, colonialism, the Cold War, neocolonialism, lack of democracy, and corruption. Despite this low concentration of wealth, recent economic expansion and the large and young population make Africa an important economic market in the broader global context.\n\nAnswer:\n\nWhile there are several reasons high population growth, corruption and colonialism and neocolonialism are some of the the factors.\n\n",
    "Instruction:\n\nGiven this background text about the Byzantine Empire, which empire can the Byzantines trace their origins?Context:\n\nThe Byzantine Empire,[note 1] also referred to as the Eastern Roman Empire or Byzantium, was the continuation of the Roman Empire primarily in its eastern provinces during Late Antiquity and the Middle Ages, when its capital city was Constantinople. It survived the fragmentation and fall of the Western Roman Empire in the 5th century AD and continued to exist for an additional thousand years until the fall of Constantinople to the Ottoman Empire in 1453. During most of its existence, the empire remained the most powerful economic, cultural, and military force in Europe. The terms \"Byzantine Empire\" and \"Eastern Roman Empire\" were coined after the end of the realm; its citizens continued to refer to their empire as the Roman Empire and to themselves as Romans[note 2]—a term which Greeks continued to use for themselves into Ottoman times. Although the Roman state continued and its traditions were maintained, modern historians prefer to differentiate the Byzantine Empire from Ancient Rome as it was centered on Constantinople instead of Rome, oriented towards Greek rather than Latin culture, and was characterized by Eastern Orthodox Christianity.\n\nDuring the high period of the Roman Empire known as the Pax Romana, the western parts of the empire went through Latinization, while the eastern parts of the empire maintained to a large degree their Hellenistic culture. Several events from the 4th to 6th centuries mark the period of transition during which the Roman Empire's Greek East and Latin West diverged. Constantine I (r. 324–337) reorganized the empire, made Constantinople the capital, and legalized Christianity. Under Theodosius I (r. 379–395), Christianity became the state religion, and other religious practices were proscribed. In the reign of Heraclius (r. 610–641), the empire's military and administration were restructured, and Greek was gradually adopted for official use in place of Latin.\n\nThe borders of the empire fluctuated through several cycles of decline and recovery. During the reign of Justinian I (r. 527–565), the empire reached its greatest extent after the fall of the west, re-conquering much of the historically Roman western Mediterranean coast, including Africa, Italy and Rome, which it held for two more centuries. The Byzantine–Sasanian War of 602–628 exhausted the empire's resources, and during the early Muslim conquests of the 7th century, it lost its richest provinces, Egypt and Syria, to the Rashidun Caliphate. It then lost Africa to the Umayyads in 698, before the empire was rescued by the Isaurian dynasty.\n\nDuring the Macedonian dynasty (9th–11th centuries), the empire expanded again and experienced the two-century-long Macedonian Renaissance, which came to an end with the defeat by Seljuk Turks at the Battle of Manzikert in 1071. Civil wars and the ensuing Seljuk invasion led to the loss of most of Asia Minor. The empire recovered during the Komnenian restoration, and by the 12th century, Constantinople was the largest and wealthiest city in Europe.\n\nThe empire was delivered a mortal blow during the Fourth Crusade when Constantinople was sacked in 1204 and the territories that the empire formerly governed were divided into competing Byzantine Greek and Latin realms. Despite the eventual recovery of Constantinople in 1261, the Byzantine Empire remained only one of several small rival states in the area for the final two centuries of its existence. Its remaining territories were progressively annexed by the Ottomans in the Byzantine–Ottoman wars over the 14th and 15th centuries.\n\nThe fall of Constantinople to the Ottoman Empire in 1453 marked the end of the Byzantine Empire. Refugees fleeing the city after its capture would settle in Italy and other parts of Europe, helping to ignite the Renaissance. The Empire of Trebizond was conquered eight years later when its eponymous capital surrendered to Ottoman forces after it was besieged in 1461. The last Byzantine rump state, the Principality of Theodoro, was conquered by the Ottomans in 1475. Arguments can be made that the fall of the Byzantine Empire to the Ottomans is one of several factors contributing to the end of the Middle Ages and the start of the early modern period.[not verified in body]\n\nAnswer:\n\nThe Byzantine Empire traces it's origins to the Roman Empire\n\n",
    "Instruction:\n\nIs there a New York Hotel in Salt Lake CityContext:\n\nThe New York Hotel in Salt Lake City, Utah, at 42 Post Office Pl., was built in 1906. It was listed on the National Register of Historic Places in 1980.\n\nIt was a work of leading Salt Lake City architect Richard K.A. Kletting.\n\nIt is a three-story brick building designed to have shops on the ground floor and 62 hotel rooms above. Some hotel room suites had bathrooms; there were also single rooms served by a bathroom on each floor. It was \"completely modern\" in 1906, having both steam heat and electric lights. \n\nThe building is 49 feet (15 m) tall; the first/second/third floors are 14 feet (4.3 m), 10 feet (3.0 m), and 10.5 feet (3.2 m) tall, respectively.\n\nIt was built as a luxury hotel for Orange J. Salisbury, a mining engineer and businessman who obtained patents and started the United Filter Corporation.\n\nAnswer:\n\nThe New York Hotel in Salt Lake City, Utah, at 42 Post Office Pl., was built in 1906. It was listed on the National Register of Historic Places in 1980.\n\nIt was a work of leading Salt Lake City architect Richard K.A. Kletting.\n\nIt is a three-story brick building designed to have shops on the ground floor and 62 hotel rooms above. Some hotel room suites had bathrooms; there were also single rooms served by a bathroom on each floor. It was \"completely modern\" in 1906, having both steam heat and electric lights.\n\nThe building is 49 feet (15 m) tall; the first/second/third floors are 14 feet (4.3 m), 10 feet (3.0 m), and 10.5 feet (3.2 m) tall, respectively.\n\nIt was built as a luxury hotel for Orange J. Salisbury, a mining engineer and businessman who obtained patents and started the United Filter Corporation.\n\n",
    "Instruction:\n\nWhere is Laskowice?Context:\n\nLaskowice [laskɔˈvit͡sɛ] (also known as Laskowice Pomorskie; German: Laskowitz) is a village in the administrative district of Gmina Jeżewo, within Świecie County, Kuyavian-Pomeranian Voivodeship, in north-central Poland. It lies approximately 5 kilometres (3 mi) south-west of Jeżewo, 8 km (5 mi) north of Świecie, 51 km (32 mi) north-east of Bydgoszcz, and 52 km (32 mi) north of Toruń.\n\nThe village has a population of 2,500. It is a major rail junction, where the Bydgoszcz-Gdynia line merges with the connection to Warsaw, via Grudziądz.\n\nAnswer:\n\nLaskowice is a village in north-central Poland\n\n",
    "Instruction:\n\nWhat is Github Copilot?Context:\n\nGitHub Copilot is a cloud-based artificial intelligence tool developed by GitHub and OpenAI to assist users of Visual Studio Code, Visual Studio, Neovim, and JetBrains integrated development environments (IDEs) by autocompleting code. Currently available by subscription to individual developers, the tool was first announced by GitHub on 29 June 2021, and works best for users coding in Python, JavaScript, TypeScript, Ruby, and Go.\n\nAnswer:\n\nGitHub Copilot is a cloud-based artificial intelligence tool developed by GitHub and OpenAI\n\n",
    "Instruction:\n\nGiven this paragraph about the experiment that led to the discovery of penicillin by Sir Alexander Fleming, tell me upon which types of bacteria penicillin has an anti-bacterial effect, and list the conditions that were necessary for the discovery of penicillinContext:\n\nBy 1927, Fleming had been investigating the properties of staphylococci. He was already well known from his earlier work, and had developed a reputation as a brilliant researcher. In 1928, he studied the variation of Staphylococcus aureus grown under natural condition, after the work of Joseph Warwick Bigger, who discovered that the bacterium could grow into a variety of types (strains). On 3 September 1928, Fleming returned to his laboratory having spent a holiday with his family at Suffolk. Before leaving for his holiday, he inoculated staphylococci on culture plates and left them on a bench in a corner of his laboratory. On his return, Fleming noticed that one culture was contaminated with a fungus, and that the colonies of staphylococci immediately surrounding the fungus had been destroyed, whereas other staphylococci colonies farther away were normal, famously remarking \"That's funny\". Fleming showed the contaminated culture to his former assistant Merlin Pryce, who reminded him, \"That's how you discovered lysozyme.\" He identified the mould as being from the genus Penicillium. He suspected it to be P. chrysogenum, but a colleague Charles J. La Touche identified it as P. rubrum. (It was later corrected as P. notatum and then officially accepted as P. chrysogenum; in 2011, it was resolved as P. rubens.)\nThe laboratory in which Fleming discovered and tested penicillin is preserved as the Alexander Fleming Laboratory Museum in St. Mary's Hospital, Paddington. The source of the fungal contaminant was established in 1966 as coming from La Touche's room, which was directly below Fleming's.\nFleming grew the mould in a pure culture and found that the culture broth contained an antibacterial substance. He investigated its anti-bacterial effect on many organisms, and noticed that it affected bacteria such as staphylococci and many other Gram-positive pathogens that cause scarlet fever, pneumonia, meningitis and diphtheria, but not typhoid fever or paratyphoid fever, which are caused by Gram-negative bacteria, for which he was seeking a cure at the time. It also affected Neisseria gonorrhoeae, which causes gonorrhoea, although this bacterium is Gram-negative. After some months of calling it \"mould juice\" or \"the inhibitor\", he gave the name penicillin on 7 March 1929 for the antibacterial substance present in the mould.\n\nAnswer:\n\nPenicillin has an anti-bacterial effect of a number of Gram-positive bacteria including but not limited to the bacteria that cause meningitis, diptheria, pneumonia, scarlet fever.  It also acts on (Gram-positive) staphylococci bacteria which cause skin and soft tissue infections such as boils.  Penicillin was also found to have an anti-bacterial action on the Gram-negative bacteria which causes gonorrhoea.  There were a series of fortuitous circumstances which combined to allow the discovery of penicillin, one of which was Sir Alexander's choice to take a holiday with his family after leaving staphylococci bacteria in a culture in his lab before departure.  Anecdotally Sir Alexander was a little sloppy with lab hygiene which contributed to his previous discovery of lysozyme and it seems the same lack of care was partly responsible for the discovery of penicillin.  Lastly the specific location of his lab and cultures played a role - the fungal contaminant that had an anti-bacterial effect on the staphylococci culture came from Sir Alexander's colleagues lab one floor below\n\n",
    "Instruction:\n\nHow long after the release of the album “Abbey Road” did The Beatles break up?Context:\n\nBy early 1964, the Beatles were international stars and had achieved unprecedented levels of critical and commercial success. They became a leading force in Britain's cultural resurgence, ushering in the British Invasion of the United States pop market, and soon made their film debut with A Hard Day's Night (1964). A growing desire to refine their studio efforts, coupled with the untenable nature of their concert tours, led to the band's retirement from live performances in 1966. At this time, they produced records of greater sophistication, including the albums Rubber Soul (1965), Revolver (1966) and Sgt. Pepper's Lonely Hearts Club Band (1967), and enjoyed further commercial success with The Beatles (also known as \"the White Album\", 1968) and Abbey Road (1969). The success of these records heralded the album era, as albums became the dominant form of record consumption over singles; they also increased public interest in psychedelic drugs and Eastern spirituality, and furthered advancements in electronic music, album art and music videos. In 1968, they founded Apple Corps, a multi-armed multimedia corporation that continues to oversee projects related to the band's legacy. After the group's break-up in 1970, all principal former members enjoyed success as solo artists and some partial reunions have occurred. Lennon was murdered in 1980 and Harrison died of lung cancer in 2001. McCartney and Starr remain musically active.\n\nAnswer:\n\nOne year after releasing Abbey Road (1969), the Beatles broke up (1970)\n\n",
    "Instruction:\n\nIn which century was Denis Thériault born?Context:\n\nDenis Thériault (born August 24, 1959) is a Canadian author, playwright and screenwriter of French-Canadian descent..\n\nAnswer:\n\nThe 20th century\n\n",
    "Instruction:\n\nGiven this paragraph about Berwick, what was its population during the most up to date census?Context:\n\nBerwick is a borough in Columbia County, Pennsylvania, United States. It is part of Northeastern Pennsylvania and is located 28 miles (45 km) southwest of Wilkes-Barre. As of the 2020 census, Berwick had a population of 10,355. It is one of the two principal communities of the Bloomsburg–Berwick metropolitan area, which covers Columbia and Montour counties, and had a combined population of 85,562 at the 2010 census.\n\nAnswer:\n\n10,355\n\n",
    "Instruction:\n\nGiven this paragraph about the longest living person, what was their name and when were they born?Context:\n\nThe longest documented and verified human lifespan is that of Jeanne Calment of France (1875–1997), a woman who lived to age 122 years and 164 days. She claimed to have met Vincent van Gogh when she was 12 or 13. She received news media attention in 1985, after turning 110. Calment's claim was investigated and authenticated by Jean-Marie Robine and Dr Michel Allard for the GRG. Her longevity claim was put into question in 2018, but the original assessing team stood by their judgement.\n\nAnswer:\n\nJeanne Calment is the longest living person to be verified. She was born in 1875 and lived to be 122 years old.\n\n",
    "Instruction:\n\nHow many times does Fred Allison try to escape captivity?Context:\n\nBritish Captain Fred Allison bids farewell to his new wife, Monica, whom he has only known for six days, and sets out to serve in World War I. He ends up a prisoner of war (POW), tortured by the fact that his wife has not written to him since the early days of his two year captivity.\n\nWhen a fellow inmate shoots a guard, the prisoners make an impromptu unsuccessful dash for freedom, resulting in much bloodshed on both sides. As punishment, they are locked in a crowded cell for about a month. Finally, a new commandant, Oberst Carl Ehrlich, takes charge of the camp. Allison persuades Ehrlich (a fellow Oxford alumnus) to rescind the punishment.\n\nOne day, a fresh batch of POWs arrives. Allison is delighted to find his oldest and best friend among them, Royal Flying Corps Lieutenant Jack \"Dig\" Digby. For some reason though, Dig is not as pleased to see him. However, Allison attributes that to their situation. Dig is determined to escape, regardless of the consequences to his fellow prisoners. He does manage to break free, stealing an aircraft from the nearby airfield.\n\nAnswer:\n\nIt seems from the text that Fred Allison tried to escape one time.\n\nThe prisoners made an impromptu unsuccessful dash for freedom when a fellow inmate shot a guard. We don't know for sure, but we can assume that Fred Allison was one of the prisoners that attempted to escape. Dig, Allison's oldest and best friend, managed to break free by stealing an aircraft from a nearby airfield, but it does not appear that Allison was involved.\n\n",
    "Instruction:\n\nHow did Draymond Green's minutes increase over time?Context:\n\nGreen was selected with the 35th overall pick in the 2012 NBA draft by the Golden State Warriors. On July 30, 2012, he signed a three-year, $2.6 million contract with the Warriors. In his NBA debut in the Warriors' season opener on October 31 against the Phoenix Suns, Green played one minute, made one defensive rebound, and committed one foul. Green gradually received more playing time in subsequent games, especially in the wake of injuries to Brandon Rush and Richard Jefferson. After getting only marginal floor time at the beginning of the season, by November 22, Green was playing 15–20 minutes per game, and by December 9, as Green gained a bigger role on the team, the Warriors had won 8 of 10 games. On December 12, Green made the winning layup with 0.9 seconds left in the Warriors' 97–95 win over the defending champion Miami Heat.\n\nAnswer:\n\nIn his NBA debut in the Warriors' season opener on October 31, 2012, against the Phoenix Suns, Green played one minute. Green gradually received more playing time in subsequent games, especially in the wake of injuries to Brandon Rush and Richard Jefferson. After getting only marginal floor time at the beginning of the season, by November 22, 2012, Green was playing 15–20 minutes per game.\n\nIt is not clear how Green's minutes increased over time beyond November 22, 2012 based on the provided text.\n\n",
    "Instruction:\n\nIf it's called \"free\" climbing, why do climbers use gear to climb?Context:\n\nFree climbing has been called \"rock climbing's most commonly mistaken term\", with problems including:\n\nIncorrectly assuming that \"free climbing\" always means solo climbing, i.e. that you must always be alone and without any partner. Free climbing in traditional climbing and sport climbing uses a supporting belayer.\nIncorrectly assuming that \"free climbing\" always means free soloing, i.e. that you must never use any climbing protection equipment. Free climbing in traditional climbing and sport climbing uses climbing protection (but not to aid progression).\nIncorrectly assuming that \"free climbing\" always means onsighting or flashing, i.e. that you must always climb the route first try. Free climbing in traditional climbing and sport climbing also uses the redpoint as a definition of a first free ascent.\n\nAnswer:\n\nFree climbing refers to a form of rock climbing in which the climber ascends without the use of gear to aid progression. It is a common misunderstanding that free climbing means climbing with no protective gear. Both sport and traditional climbing make use of protective gear to prevent injury and death, and are both considered free climbing. This is in contrast to free solo climbing, another form of free climbing in which the climber uses no protective gear.\n\n",
    "Instruction:\n\nGiven a reference text about Anoop Nautiyal, what did his work focus on?Context:\n\nAnoop Nautiyal is a social activist based in Dehradun, Uttarakhand. His work has focused on issues of environment and sustainable development of the state. He is the founder of Social Development Communities Foundation, an NGO and think tank based in Dehradun, which works works at the grassroots level for the empowerment of communities, as well as the sustainable development of the mountain state of Uttarakhand. He is a prolific social communicator and has also been a columnist for the Indian Express.\n\nHe had a brief foray in the political space and contested the 2017 Uttarakhand Legislative Assembly election.\n\nAnoop Nautiyal attended Shri Ram College of Commerce and National Institute of Fashion Technology in New Delhi.[1\n\nAnswer:\n\nAnoop Nautiyal's work has focused on issues regarding the environment and sustainable development.\n\n",
    "Instruction:\n\ngiven the plot of 1985 hit Back to the future, how could Marty McFly have avoided having to reconcile his mother and father in order to save his life?Context:\n\nIn 1985, teenager Marty McFly lives in Hill Valley, California, with his depressed alcoholic mother, Lorraine; his older siblings, who are professional and social failures; and his meek father, George, who is bullied by his supervisor, Biff Tannen. After Marty's band fails a music audition, he confides in his girlfriend, Jennifer Parker, that he fears becoming like his parents despite his ambitions.\n\nThat night, Marty meets his eccentric scientist friend, Emmett \"Doc\" Brown, in the Twin Pines mall parking lot. Doc unveils a time machine built from a modified DeLorean, powered by plutonium he swindled from Libyan terrorists. After Doc inputs a destination time of November 5, 1955 (the day he first conceived his time travel invention), the terrorists arrive unexpectedly and gun him down. Marty flees in the DeLorean, inadvertently activating time travel when he reaches 88 miles per hour (142 kilometers per hour).\n\nArriving in 1955, Marty discovers he has no plutonium to return. While exploring a burgeoning Hill Valley, Marty encounters his teenage father and discovers Biff was bullying George even then. George falls into the path of an oncoming car while spying on the teenage Lorraine changing clothes, and Marty is knocked unconscious while saving him. He wakes to find himself tended to by Lorraine, who becomes infatuated with him. Marty tracks down and convinces a younger Doc that he is from the future, but Doc explains the only source available in 1955 capable of generating the power required for time travel is a lightning bolt. Marty shows Doc a flyer from the future that documents an upcoming lightning strike at the town's courthouse. As Marty's siblings begin to fade from a photo he is carrying with him, Doc realizes Marty's actions are altering the future and jeopardizing his existence; Lorraine was supposed to tend to George instead of Marty after the car accident. Early attempts to get his parents acquainted fail, and Lorraine's infatuation with Marty deepens.\n\nLorraine asks Marty to the school dance, and he plots to feign inappropriate advances on her, allowing George to intervene and rescue her, but the plan goes awry when Biff's gang locks Marty in the trunk of the performing band's car, while Biff forces himself onto Lorraine. George arrives expecting to find Marty but is assaulted by Biff. After Biff hurts Lorraine, an enraged George knocks him unconscious and escorts the grateful Lorraine to the dance. The band frees Marty from their car, but the lead guitarist injures his hand in the process, so Marty takes his place, performing while George and Lorraine share their first kiss. With his future no longer in jeopardy, Marty heads to the courthouse to meet Doc.\n\nDoc discovers a letter from Marty warning him about his future and rips it, worried about the consequences. To save Doc, Marty recalibrates the DeLorean to return ten minutes before he left the future. The lightning strikes, sending Marty back to 1985, but the DeLorean breaks down, forcing Marty to run back to the mall. He arrives as Doc is being shot. While Marty grieves at his side, Doc sits up, revealing he pieced Marty's note back together and wore a bulletproof vest. He takes Marty home and departs to 2015 in the DeLorean. Marty wakes the next morning to discover his father is now a confident and successful science fiction author, his mother is fit and happy, his siblings are successful, and Biff is a servile valet in George's employ. As Marty reunites with Jennifer, Doc suddenly reappears in the DeLorean, insisting they return with him to the future to save their children from terrible fates.\n\nAnswer:\n\nHe could have not push his father out of the way when he fell into the path of an oncoming car.\n\n",
    "Instruction:\n\nGiven this reference test, what is the daily recommended amount of magnesium for women in the U.S.?Context:\n\nIn the UK, the recommended daily values for magnesium are 300 mg for men and 270 mg for women. In the U.S. the Recommended Dietary Allowances (RDAs) are 400 mg for men ages 19–30 and 420 mg for older; for women 310 mg for ages 19–30 and 320 mg for older.\n\nAnswer:\n\nThe daily recommended amount of magnesium for women in the U.S. is 310 mg for ages 19-30 and 320 mg for older.\n\n",
    "Instruction:\n\nWhy were the majority of African countries controlled by military dictatorships during the 1970's and 1980's?Context:\n\nFaced with increasingly frequent and severe violence, military rule was widely accepted by the population of many countries as means to maintain order, and during the 1970s and 1980s a majority of African countries were controlled by military dictatorships. Territorial disputes between nations and rebellions by groups seeking independence were also common in independent African states. The most devastating of these was the Nigerian Civil War, fought between government forces and an Igbo separatist republic, which resulted in a famine that killed 1–2 million people. Two civil wars in Sudan, the first lasting from 1955 to 1972 and the second from 1983 to 2005, collectively killed around 3 million. Both were fought primarily on ethnic and religious lines.\n\nAnswer:\n\nMilitary dictatorships were accepted as a means to maintain order in face of increasingly frequent and severe violence.\n\n",
    "Instruction:\n\nWho is Evelyn Quan Wang in the move \"Everything Everywhere All at Once\"?Context:\n\nEvelyn Quan Wang is a middle-aged Chinese American immigrant who runs a laundromat with her husband, Waymond; two decades earlier, they eloped to the United States and had a daughter, Joy. The laundromat is being audited by the Internal Revenue Service (IRS), Waymond is trying to serve Evelyn divorce papers in an attempt to get her attention so they can talk things out regarding their marriage, Evelyn's demanding father (referred to as Gong Gong, Cantonese for 'grandfather') is visiting for her Chinese New Year party, and Evelyn is reluctant to accept Joy's lesbian relationship with her non-Chinese girlfriend Becky (only introducing Becky to Gong Gong as Joy's \"very good friend\").\n\nAnswer:\n\nEvelyn Quan Wang is a middle-aged Chinese American immigrant who runs a laundromat with her husband, Waymond.\n\n",
    "Instruction:\n\nGiven a reference text about the Kumanichi Road Race, tell me when the race was first held and who holds the course records.Context:\n\nThe Kumanichi Road Race (Japanese: 熊本30K) is an annual road running competition over 30 kilometres which is typically held in February in Kumamoto, Japan. It was first held in 1957 as a men-only competition. A women's race was introduced in 2006. The race is one of the world's most prominent over the uncommon 30K distance. A total of eight Association of Road Racing Statisticians-recognised men's world records have been set at the competition, including the current world record.\n\nThe course records are held by Takayuki Matsumiya (1:28:00) and Yuka Hakoyama (1:43:26). It is mostly contested by Japanese athletes, with Kenya's Willy Kangogo becoming the event's sole non-national winner in 2007.\n\nAnswer:\n\nThe Kumanichi Road Race was first held in 1957. Takayuki Matsumiya and Yuka Hakoyama hold the course records.\n\n",
    "Instruction:\n\nWhat is handscroll used forContext:\n\nThe handscroll is a long, narrow, horizontal scroll format in East Asia used for calligraphy or paintings. A handscroll usually measures up to several meters in length and around 25–40 cm in height. Handscrolls are generally viewed starting from the right end. This kind of scroll is intended to be read or viewed flat on a table, in sections. The format thus allows for the depiction of a continuous narrative or journey. The traditional alternative format in East Asian paintings is the vertical hanging scroll, which is rarely as long.\n\nAnswer:\n\nThe handscroll is a long, narrow, horizontal scroll format in East Asia used for calligraphy or paintings.\n\n"
]