[
    "Instruction:\n\nGiven a reference text on the beginnings of triathlon, tell me where the event was first held, in what year, and what sport was first in the sequence of the race.Answer:\n\nThe first triathlon occurred in San Diego, California in 1974. Unlike today's events, the triathlon began with a run.\n\n",
    "Instruction:\n\nGiven this text about Major League Baseball, how many games do teams play in the regular season and how many games are played in the World Series.Answer:\n\nEach team will play 162 games per regular season, with the two top teams playing a best of seven in the World Series Championship.\n\n",
    "Instruction:\n\nGiven a reference text about spaghetti, what shape is it, where did it originate, and are there any variations of it?Answer:\n\nThe shape of spaghetti is long, thin, and cylindrical. It traditionally comes from Italy and has a two variations - those being Spaghettoni, which is thicker, and capellini, which is thiner and sometime called 'angel hair pasta'.\n\n",
    "Instruction:\n\nGiven this reference text about a video game, when was Donkey Kong released?Answer:\n\n1981\n\n",
    "Instruction:\n\nWhat is Leptodactylus tapiti?Answer:\n\nLeptodactylus tapiti is a species of frog and is native to Brazil.\n\n",
    "Instruction:\n\nWhat is one of Poseidon's many powers?Answer:\n\nPoseidon has power to control the winds that guide ships on the seas of the Mediterranean.\n\n",
    "Instruction:\n\nAccording to this paragraph, what was the most common type of castle in England following the Norman Conquest?Answer:\n\nAccording to this text, the Motte-and-bailey castles were the most common following the Norman Conquest.\n\n",
    "Instruction:\n\nGiven this reference text, tell me what the foundational BJJ concept wasAnswer:\n\nBJJ focuses on the concept that smaller and weaker practitioners can defend against larger and bigger opponents by taking the fight to the ground. Once on the ground, a BJJ practitioner can use leverage and weight distribution to defeat their opponent.\n\n",
    "Instruction:\n\nWho brews Shiner Bock beer?Answer:\n\nSpoetzl Brewery (originally Shiner Brewing Association) is a brewery located in Shiner, Texas, United States. It produces a diverse line of Shiner beers, including their flagship Shiner Bock, a dark lager that is distributed throughout the US.\n\n",
    "Instruction:\n\nGiven a reference text about Daal dhokli, tell me three commonly used daals.Answer:\n\nThree commonly used daals are toor, masoor, and moong.\n\n",
    "Instruction:\n\nGiven a reference text about Audrey Babette Blackman, tell me her parents names and occupations.Answer:\n\nAudrey Babette Blackman parents names were Hilda Sligman and Richard Seligman. Hilda was a sculptor and author and Richard was a chemical engineer.\n\n",
    "Instruction:\n\nGiven this plot summary from The Night Buffalo, what caused Manuel to discover these occurrences caused by his late friend?Answer:\n\nGregorio committed suicide, this caused Manuel to go down a path of discoveries uncovering what led him to suicide.\n\n",
    "Instruction:\n\nWhat direction did Italy Avenue go in Uruguay per this block of text?Answer:\n\neast to west\n\n",
    "Instruction:\n\nIs endosymbiosis bad?Answer:\n\nNo, endosymbiosis is a symbiotic relationship where the internal symbiont or the endosymbiont provides essential nutrients to the host. For example, a bacteria can provide necessary nutrients to an insect.\n\n",
    "Instruction:\n\nGiven this paragraph about surfboards, summarize what a surfboard is made ofAnswer:\n\nSurfboards can be made out of a variety of materials, but most surfboards these days are made from a foam core that is coated in a hard exterior\n\n",
    "Instruction:\n\nWhat is the history of olive oil?Answer:\n\nBesides food, olive oil has been used for religious rituals, medicines, as a fuel in oil lamps, soap-making, and skincare applications.\n\n",
    "Instruction:\n\nWhere will the third Summer Olympic Games be held?Answer:\n\nThe third Summer Games to be held in Australia will be hosted in Brisbane, Queensland.\n\n",
    "Instruction:\n\nhere is a blurb about Meaghan Benfeito, Between which years was Benfeito actively competing in the Olympics?Answer:\n\nBetween the Olympics of 2008 and 2020, in 2022 she retired from Diving.\n\n",
    "Instruction:\n\nBased on this text, what was Ruth Handler's inspiration for making the Barbie Doll?Answer:\n\nRuth Handler was inspired by the German Bild Lilli doll\n\n",
    "Instruction:\n\nGiven a reference text about the golden-green woodpecker, tell be how big they are.Answer:\n\nThe golden-green woodpecker weighs between 55 and 91 grams and is between 18 and 27 centimeters long.\n\n",
    "Instruction:\n\nGiven a reference text about Being There, tell me when the book was published and when a film about the book was created.Answer:\n\nBeing There was published on April 21, 1971 and a film about the book was made in 1979.\n\n",
    "Instruction:\n\nWhat is hidden at Oak Island?Answer:\n\nOak Island is rumored to have Captain Kidd's treasure buried. However despite numerous excavation attempts over the past 100 years nothing has been discovered. There are other theories which claim religious artifacts, manuscripts, or Marie Antionette's jewels are hidden at Oak Island.\n\n",
    "Instruction:\n\nHow long after the release of the album “Abbey Road” did The Beatles break up?Answer:\n\nOne year after releasing Abbey Road (1969), the Beatles broke up (1970)\n\n",
    "Instruction:\n\nAccording to this paragraph, what are the \"Old Dorms\" at the University of Virginia?Answer:\n\nThe \"Old Dorms\" at the University of Virginia often refer to the primary housing area for first-year students on McCormick Road.\n\n",
    "Instruction:\n\nGiven these paragraphs about the Tesla bot, what is its alias?Answer:\n\nOptimus\n\n",
    "Instruction:\n\nWhat was unique about Scrubs?Answer:\n\nMost episodes featured voice-overs done by Zach Braff (who stars as the main character, J.D.), as well as the comical daydreams of J.D. This opened up a unique visual medium that the comedy writers were not used to. Also, actors were given the chance to improvise their lines on set.\n\n",
    "Instruction:\n\nBased on this paragraph, who directed White Rabbit?Answer:\n\nTim McCann\n\n",
    "Instruction:\n\nGiven this paragraph on LeBron James' early career, when did he win his first NBA MVP?Answer:\n\nLeBron James won his first NBA MVP in 2009.\n\n",
    "Instruction:\n\nWho created the grading system for the I Liq Chuan martial art?Answer:\n\nSam F. S. Chin developed the grading system for the I Liq Chuan martial art.\n\n",
    "Instruction:\n\nWhich river can you hike in Utah?Answer:\n\nThe Narrows at Zion National Park\n\n",
    "Instruction:\n\nWhat was the most expensive watch ever sold at auctionAnswer:\n\nA Patek Philippe Grandmaster was sold for a reported 31.19 million USD\n\n",
    "Instruction:\n\nGiven a reference text about Amanecer, who made the album and what viral song did it include?Answer:\n\nBomba Estéreo made the album Amanecer. The album includes the viral song \"Soy Yo\".\n\n",
    "Instruction:\n\nGiven this paragraph from Wikipedia, what was Alan Wolffe's primary research interest?Answer:\n\nWolffe was principally interested in chromatin and its role in gene expression\n\n",
    "Instruction:\n\nGiven a reference text about Sean Dunphy, tell me where he is buried.Answer:\n\nSean Dunphy is buried at Greenogue cemetery in Ashbourne, County Meath.\n\n",
    "Instruction:\n\nIs the USS Rachel Seaman made of metal?Answer:\n\nNo, it is made of wood.\n\n",
    "Instruction:\n\nWho first used the term \"glass ceiling\"?Answer:\n\nThe term \"glass ceiling\" was first used by Marilyn Loden in a 1978 speech.\n\n",
    "Instruction:\n\nWhat is Ramadan?Answer:\n\nRamadan is the holy month of fasting observed by Muslims yearly all over the world.During this month Muslims abstain from food from dawn till dusk for 29 days. Ramadan is also one of the key pillars of Islam.\n\n",
    "Instruction:\n\nBased on the provided text, what technology rendered Extended ASCII obsolete?Answer:\n\nUnicode rendered extended ASCII obsolete.\n\n",
    "Instruction:\n\nGiven this paragraph about the tour de france, how many riders are in the tourAnswer:\n\nThe are approximately between 160 and 176 riders start the tour de france. Each team has 8 member riders with between 20 and 22 teams participating.\n\n",
    "Instruction:\n\nHow many prototypes were made?Answer:\n\nThree prototypes were made and improved over one year.\n\n",
    "Instruction:\n\nWhat is an \"outie\" in the context of this paragraph?Answer:\n\nBased on the provided paragraph, it's not clear what is an \"outie\". However, based on this sentence, \"He rushes to tell Devon, but is only able to say \"She's alive!\" before Milchick tackles Dylan, deactivating the overtime contingency and reverting the three to their outie state.\", it seems like an outie is a state that a person can be in and that the state can be switched on by deactivating the overtime contingency.\n\n",
    "Instruction:\n\nGiven the paragraph about the Grateful Dead, tell me when they were founded, who were the original members, and what other members were in the group.Answer:\n\nThe Grateful Dead were founded in the 1960's as the Warlocks by Jerry Garcia, Bob Weir, Ron \"Pigpen\" McKernan, Phil Lesh and Bill Kreutzmann. Over the years, the band had many other members, including Tom Constanten, John Perry Barlow, Keith Godchaux, Donna Godchaux, Brent Mydland, Vince Welnick and Bruce Hornsby.\n\n",
    "Instruction:\n\nWho were fighting each other in this battle and what's the consequence of itAnswer:\n\nChinese Nationalist and Chinese Communists fought this battle during Chinese Civil War in 1949. Chinese Nationalist won the battle which deterred Chinese Communists from taking over Taiwan, the last stronghold of Chinese Nationalist government fled from mainland in 1949 until today.\n\n",
    "Instruction:\n\nDid Paul Ernest Adolph ever served the military?Answer:\n\nYes, Paul Ernest Adolph served in the US Army Medical Corps as a Major from 1941 to 1945.\n\n",
    "Instruction:\n\nName someone who helped to stash national treasures during a war, so irreplaceable items would not fall into the hands of the enemy or become lostAnswer:\n\nEvdokia Reshetnik, a Ukranian zoologist and ecologist, helped squirrel away natural history artifacts from a Ukranian museum of Natural History, keeping them from falling into the hands of the Germans. Ironically, the story of her courage was nearly lost, only resurfacing in the twenty-first century.\n\n",
    "Instruction:\n\nDid Thomas Attewell bat with a right or left hand?Answer:\n\nright hand\n\n",
    "Instruction:\n\nGiven this paragraph about the United States Marine Corps, tell me when it was created in which city?Answer:\n\nThe Marine Corps was established on the 10th of November in 1775 in Philadelphia, PA.\n\n",
    "Instruction:\n\nList 10 highest-grossing actors in the world.Answer:\n\nThe following are non-definitive lists of the actors with the highest career-film grosses. There are box-office gross revenue lists, which are not adjusted for inflation, as well as lists for the number of box-office ticket sales. Because of the long-term effects of inflation on movie theater ticket prices, a list unadjusted for inflation gives far more weight to later actors. Therefore, the gross revenue lists are largely meaningless for comparing acting careers widely separated in time, as many actors from earlier eras will never appear on a modern unadjusted list, despite their films' achieving higher commercial success when adjusted for price increases.\n\nLead roles\nThis list only includes leading roles and lead ensemble roles, including voice acting. The list is updated as of 12 January 2023.\n\nRank\tActor\tWorldwide total\tTop-grossing film\tFilms\tAverage\n1\tScarlett Johansson\t$14,519,031,650\tAvengers: Endgame ($2,794,731,755)\t33\t$439,970,656\n2\tRobert Downey Jr.\t$14,393,065,668\tAvengers: Endgame ($2,794,731,755)\t43\t$334,722,457\n3\tSamuel L. Jackson\t$14,376,505,937\tAvengers: Endgame ($2,794,731,755)\t64\t$224,632,905\n4\tZoe Saldaña\t$12,805,874,340\tAvatar ($2,899,384,102)\t30\t$426,862,478\n5\tChris Hemsworth\t$11,958,567,765\tAvengers: Endgame ($2,794,731,755)\t25\t$478,342,711\n6\tChris Pratt\t$11,742,796,476\tAvengers: Endgame ($2,794,731,755)\t23\t$510,556,369\n7\tTom Cruise\t$11,547,725,996\tTop Gun: Maverick ($1,487,575,965)\t43\t$268,551,767\n8\tChris Evans\t$11,277,890,989\tAvengers: Endgame ($2,794,731,755)\t29\t$388,892,793\n9\tTom Hanks\t$10,704,310,520\tToy Story 4 ($1,073,064,540)\t55\t$194,623,828\n10\tVin Diesel\t$10,537,096,327\tAvengers: Infinity War ($2,048,359,754)\t27\t$390,262,827\n\n",
    "Instruction:\n\nTell me about Hong KongAnswer:\n\nHong Kong, officially the Hong Kong Special Administrative Region of the People's Republic of China (abbr. Hong Kong SAR or HKSAR), is a city and special administrative region of China on the eastern Pearl River Delta in South China. With 7.5 million residents of various nationalities in a 1,104-square-kilometre (426 sq mi) territory, Hong Kong is one of the most densely populated places in the world. Hong Kong is also a major global financial centre and one of the most developed cities in the world.\n\nHong Kong was established as a colony of the British Empire after the Qing Empire ceded Hong Kong Island from Xin'an County at the end of the First Opium War in 1841 then again in 1842. The colony expanded to the Kowloon Peninsula in 1860 after the Second Opium War and was further extended when Britain obtained a 99-year lease of the New Territories in 1898. British Hong Kong was occupied by Imperial Japan from 1941 to 1945 during World War II; British administration resumed after the surrender of Japan. The whole territory was transferred to China in 1997. As one of China's two special administrative regions (the other being Macau), Hong Kong maintains separate governing and economic systems from that of mainland China under the principle of \"one country, two systems\".\n\nOriginally a sparsely populated area of farming and fishing villages, the territory has become one of the world's most significant financial centres and commercial ports. As of 2021, it is the world's ninth-largest exporter and eight-largest importer. Hong Kong has a market economy characterised by a focus on services, low taxation and free trade; its currency, the Hong Kong dollar, is the eighth most traded currency in the world. Hong Kong is home to the third-highest number of billionaires of any city in the world, the second-highest number of billionaires of any city in Asia, and the largest concentration of ultra high-net-worth individuals of any city in the world. Although the city has one of the highest per capita incomes in the world, severe income inequality exists among the population. Most notably, housing in Hong Kong has been well-documented to experience a chronic persistent shortage; the extremely compact house sizes and the extremely high housing density are the effects of Hong Kong's housing market being the most expensive housing in the world.\n\nHong Kong is a highly developed territory and has a Human Development Index (HDI) of 0.952, ranking fourth in the world. The city has the largest number of skyscrapers of any city in the world, and its residents have some of the highest life expectancies in the world. The dense space has led to a highly developed transportation network with public transport rates exceeding 90%. Hong Kong is ranked 3rd in the Global Financial Centres Index.\n\n",
    "Instruction:\n\nHow many parts did O.J.: Made in America have, and could a documentary with the same length win an Oscar today?Answer:\n\nO.J.: Made in America had 5 parts. Today, documentaries cannot be multi part, so a 5 part documentary could no longer win an Oscar.\n\n",
    "Instruction:\n\nOf the living animal species which have been described, which group has the most?Answer:\n\nThere are 1.05 million (1,050,000) insect species, which is the largest group in the animal kingdom.\n\n",
    "Instruction:\n\nGiven a reference text about a former President of India, Dr. A. P. J. Abdul Kalam, tell me when he was born, where he was raised and the subjects he specialised in studies. Why was Abdul Kalam known as the Missile Man of India?Answer:\n\nAvul Pakir Jainulabdeen Abdul Kalam BR, referred to as APJ Abdul Kalam in short, was born on 15th October 1931. He was born and raised in Rameswaram in Tamil Nadu, South India. APJ Abdul Kalam specialised in Physics and Aerospace Engineering as part of his studies. \nHe had a career of around 4 decades as a scientist as well as an administrator with the organisations such as Defence Research and Development Organisation (DRDO) and Indian Space Research Organisation (ISRO). In these roles, APJ Abdul Kalam played a key role in India's civilian space program and military missile development activities. He also played a vital role in the development of ballistic missile and launch vehicle technology. As a result of his above mentioned contributions, Abdul Kalam was known as the Missile Man of India.\n\n",
    "Instruction:\n\nHow many cycling world championships has Peter Sagan won?Answer:\n\nSagan has won three consecutive cycling world championships\n\n",
    "Instruction:\n\nper this description of the game of fooseball, how many full rotations are allowed in the game at the championship level?Answer:\n\n2 360-degree rotations are allowed since January 2012.\n\n",
    "Instruction:\n\nGiven a refrence text about The Bobcaygeon Independent, tell me when it was established and when it ceased publication.Answer:\n\nThe Bobcaygeon Independent was established in 1869 and ceased publication in 2004.\n\n",
    "Instruction:\n\nWhen was IGFBP3 first characterized?Answer:\n\nThe Insulin-like growth factor-binding protein 3 or IGFBP-3 was first isolated, characterized, and quantitated in human plasma, in 1986.\n\n",
    "Instruction:\n\nGiven the reference article, Please give marriage date of indian actor Shahrukh KhanAnswer:\n\nShahrukh Khan married Gauri in a traditional Hindu wedding ceremony on 25 October 1991\n\n",
    "Instruction:\n\nWhat is the name of the family at the centre of the TV show Succession?Answer:\n\nSuccession centres on the Roy family, the owners of Waystar RoyCo\n\n",
    "Instruction:\n\nGiven this paragraph about a country, what is the most populous Spanish-speaking country?Answer:\n\nMexico\n\n",
    "Instruction:\n\nWhat are all the different ways of saying customer lifetime value?Answer:\n\nCustomer lifetime value is commonly referred to as customer lifetime value (CLV or often CLTV), lifetime customer value (LCV), or life-time value (LTV).\n\n",
    "Instruction:\n\nWhat is a community structure in the study of complex networks?Answer:\n\nIn the study of complex networks, a network is said to have community structure if the nodes of the network can be easily grouped into (potentially overlapping) sets of nodes such that each set of nodes is densely connected internally.\n\n",
    "Instruction:\n\nWhat is better: Tiramisu with chocolate or with Strawberries ?Answer:\n\nTiramisu with strawberries can not be called Tiramisu. Only with chocolate.\n\n",
    "Instruction:\n\nWhat is the oldest part of Boston to live in, based on the historic neighborhood?Answer:\n\nCharlestown, Massachusetts\n\n",
    "Instruction:\n\nWhere is the Black See?Answer:\n\nThe Black Sea is lying between Europe and Asia, east of the Balkans, south of the East European Plain, west of the Caucasus, and north of Anatolia. It is bounded by Bulgaria, Georgia, Romania, Russia, Turkey, and Ukraine.\n\n",
    "Instruction:\n\nGiven a reference text about Richard Brandon Morris, tell me what when and where he was born as well as the different colleges and universities he attended.Answer:\n\nRichard Brandon Morris was born on July 24, 1904. He attended City College and Columbia University.\n\n",
    "Instruction:\n\nWhat is the meaning of life?Answer:\n\npertains to the significance of living or existence in general\n\n",
    "Instruction:\n\nGiven a reference text about the Cuban Missile Crisis, when did the crisis occur and how long did it last?Answer:\n\nThe Cuban Missile crises lasted 35 days, from October 16 to November 20, 1962.\n\n",
    "Instruction:\n\nWhat is the meaning of \"tidal coupling\"?Answer:\n\nTidal coupling or synchronous rotation is what causes one astronomical object's face to be fixed pointing to another, just as the Moon's visible face is always pointing to the Earth. A coupled object takes the same amount of time to rotate about its axis as it does to translate around its companion. This synchronous rotation, also known as captured rotation or synchronous rotation, causes one hemisphere to point continuously toward the companion object. Normally, only the satellite couples around a larger planet, but if the mass difference between the two bodies and the distance between them is small, both objects may have a reciprocal tidal coupling, as Pluto and Charon do.\n\n",
    "Instruction:\n\nWhy is the sun more intense at high altitudeAnswer:\n\nIt's commonly known that the sun is more intense at higher altitudes. However, contrary to popular belief, the sun is not more intense due to being closer to the sun, but the angle of incidence of the sun. The angle of incidence is steeper, and therefore the density of the sun's  radiant energy is concentrated to a high density in a smaller area. This makes the sun's energy more intense\n\n",
    "Instruction:\n\nBased on this article, what countries have implemented the use of a dead man zone?Answer:\n\nAustralia and the United States have used the dead man zone from Project Vesta\n\n",
    "Instruction:\n\nGiven a reference text about Valery Moiseevich Leibin, tell me where he is a member of an editorial board and when he died.Answer:\n\nValery Moiseevich Leibin is still alive. He is a member of the following editorial boards:\n- \"Russian Psychoanalytic Bulletin\"\n- \"Archetype\"\n- \"Psychoanalytic Review\"\n- \"Review of Psychoanalysis\"\n\n",
    "Instruction:\n\nHow many member states does the European Union have?Answer:\n\n27\n\n",
    "Instruction:\n\nWhat was Goff's best game mentioned in the text?Answer:\n\nGoff's best game mentioned in the text was on October 2 when he threw four touchdowns passes, and added a tenure-high 378 passing yards during a 48–45 loss to the Seattle Seahawks.\n\nGoff played another good game against the Washington Commanders, when he threw for 256 yards and four touchdowns in a 36–27 victory, but this performance wasn't as good as the game against the Seahawks because he threw for fewer yards even though he threw for the same amount of touchdowns.\n\nNote that the text is also missing information that would be useful in judging Goff's performance such as QBR, completion percentage, etc.\n\n",
    "Instruction:\n\nWho is Teresa Giudice?Answer:\n\nTeresa Giudice is a reality TV star who is most famous for Bravo's The Real Housewives of New Jersey. She is also a New York Times best selling cookbook author who specializes in Italian cuisine.\n\n",
    "Instruction:\n\nGiven this paragraph, what is the out of state acceptance rate at the University of Virginia?Answer:\n\nThe out of state acceptance rate at the University of Virginia is 19%.\n\n",
    "Instruction:\n\nGiven this paragraph about Pittsford, New York, what year was the town settled?Answer:\n\nThe town of Pittsford was settled in 1789.\n\n",
    "Instruction:\n\nWhen will the The Doors of Stone, the third book of The Kingkiller Chronicle, come out?Answer:\n\nAs of 2023, The Doors of Stone is unreleased, with no stated release date. Rothfuss has stated that the book presented challenges to complete, and issues in his personal life and mental health have contributed to the delay.\n\n",
    "Instruction:\n\nLuka Modrić (Croatian pronunciation: [lûːka mǒːdritɕ]; born 9 September 1985) is a Croatian professional footballer who plays as a midfielder for La Liga club Real Madrid and captains the Croatia national team. He plays mainly as a central midfielder, but can also play as an attacking midfielder or as a defensive midfielder. He is widely regarded as one of the greatest midfielders of all time, and as the greatest ever Croatian footballer.\n\nBorn in Zadar, Modrić's childhood coincided with the Croatian War of Independence which displaced his family. In 2002, he was signed by Dinamo Zagreb at age 16, after showing promise with his hometown club NK Zadar's youth team. He continued his development in Zagreb, before spells on loan to Zrinjski Mostar and Inter Zaprešić. He made his debut for Dinamo in 2005 and won three consecutive league titles and domestic cups, being named the Prva HNL Player of the Year in 2007. In 2008, he moved to Premier League club Tottenham Hotspur for a club-record transfer fee of £16.5 million, where he led Spurs to their first UEFA Champions League appearance in almost 50 years, reaching the quarter-finals of the 2010–11 tournament.\n\nIn the summer of 2012, Modrić joined Real Madrid for a £30 million transfer fee. There he became a key contributor and helped the team win La Décima and was selected for the 2013–14 Champions League squad of the season. After Zinedine Zidane took over Madrid, Modrić was critical to three consecutive Champions League titles from 2015–16 to 2017–18, each time being voted into the squad of the season. He has won twenty-two major trophies at Real Madrid, including five UEFA Champions League titles, three La Liga titles, one Copa del Rey, four Supercopa de España titles, four UEFA Super Cup titles and five FIFA Club World Cup titles. He won the La Liga Award for \"Best Midfielder\" in 2016 for the second time, and the UEFA Club Football Award for \"Best Midfielder\" in 2017 and 2018. In 2015, he became the first Croatian player to be included in the FIFA FIFPRO World 11, in which he was regularly included until 2019 and then again in 2022, as well in the UEFA Team of the Year between 2016 and 2018. In 2018, Modrić became the first Croatian player to win the UEFA Men's Player of the Year Award, and by winning The Best FIFA Men's Player and Ballon d'Or awards, he became the first player other than Lionel Messi or Cristiano Ronaldo to claim the awards in more than a decade. In 2019, he was awarded the Golden Foot award for career results and personality.\n\nModrić made his international debut for Croatia against Argentina in March 2006, and scored his first international goal in a friendly match against Italy. Modrić has anchored Croatia's \"second Golden Generation\", participating in every major tournament Croatia has qualified for, including the UEFA Euro 2008, 2012, 2016, and 2020, as well as the 2006, 2014, 2018, and 2022 FIFA World Cup. At the Euro 2008, he was selected for the Team of the Tournament, becoming only the second Croatian to ever achieve this honour. Following group stage eliminations in his first two World Cups, Modrić led Croatia to the 2018 World Cup Final, winning the Golden Ball in process. At the following tournament, he led the team to a third-place finish, winning the Bronze Ball in process. In March 2021, he went on to become the country's most capped player in history. Furthermore, he has been named Croatian Footballer of the Year a record eleven times between 2007 and 2022.Answer:\n\nLuka Modric is a Croatian professional football (soccer) player. He is considered one of the best midfielders of all time and best Croatian player ever. He was born in Zadar, Croatia. In 2002, at the age of 16, he signed with the biggest Croatian soccer club, Dinamo Zagreb where is stayed till 2008 when he signed with Tottenham Hotspur in England. In 2012 he signed with Real Madrid in Spain where he currently plays.\n\n",
    "Instruction:\n\nWhat is on the DVD Our Favorite ThingsAnswer:\n\nOur Favorite Things is a compilation DVD by the band Negativland, released on November 27, 2007. The original release date on October 23 was skipped due to a pressing error in the DVDs and the bonus CD, a collection of Negativland covers done by an a cappella doo-wop group. \n\nIt contains 20 of the band's greatest \"hits\" animated by 20 different artists from all over the United States. The cover parodies the artwork of the film The Sound of Music as well as title of the film's song \"My Favorite Things\". The front features a \"review\" from the character Goofy saying, \"It's goofy\". The people on the cover are dolls.\n\n",
    "Instruction:\n\nWhere is Lake Como located?Answer:\n\nLake Como is located in the Lombardy region in Italy.\n\n",
    "Instruction:\n\nGiven this paragraph about marathon, what is the distance covered in kilometres and what are the most common ways to complete one?Answer:\n\nThe distance covered in a marathon is 42.195 kilometers and it can be completed by running and walking combined, though there are also possibilities for wheelchair participants.\n\n",
    "Instruction:\n\nIn which country is Jean Marie Ralph Féthière a politician?Answer:\n\nHaiti\n\n",
    "Instruction:\n\nGiven this paragraph, what is the definition of Long short-term memory ?Answer:\n\nLong-short term memory is an artificial neural network used in deep learning that can process not only single data points (such as images), but also entire sequences of data (such as speech or video).\n\n",
    "Instruction:\n\nGiven these paragraphs about Large language models, what are relevant dimensions influencing the skill with which they accomplish tasks, and the range of tasks at which they are capable?Answer:\n\nThe amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\n",
    "Instruction:\n\nGiven a reference text about Pablo Picasso, tell me when and where he was born, why he was famous, and what his most famous accomplishment was as a professionalAnswer:\n\nPablo Ruiz Picasso was born on 25 October 1881 in Málaga, Spain. He was a Spanish painter, sculptor, printmaker, ceramicist and theatre designer who spent most of his adult life in France. He is one of the most famous and influential artists of the 20th century because he co-founded the Cubist movement, the invention of constructed sculpture, co-invented collage, and he delveoped and explored a wide variety of other styles. Among his most famous works are the proto-Cubist Les Demoiselles d'Avignon (1907), and the anti-war painting Guernica (1937), a dramatic portrayal of the bombing of Guernica by German and Italian air forces during the Spanish Civil War.\n\n",
    "Instruction:\n\nWas Wilbur Snyder a good wrestlerAnswer:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. \n\nHe had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\n",
    "Instruction:\n\nHow many children did James S. Wall have?Answer:\n\nJames S. Wall had six children.\n\n",
    "Instruction:\n\nWho scored first in Austin FC's first victory in a home game in the 2021 MLS season?Answer:\n\nJon Gallagher scored the first goal in Austin FC's first win at home, over the Portland Timbers.\n\n",
    "Instruction:\n\nWhere is Ecsenius tessera commonly found?Answer:\n\nEcsenius tessera is commonly found in coral reefs in the western Pacific ocean, close to Vanuatu.\n\n",
    "Instruction:\n\nWhen did Google purchase YouTubeAnswer:\n\nGoogle purchased YouTube in October 2006 for $1.65 billion\n\n",
    "Instruction:\n\nAccording to this paragraph, did Frederic Foley hold the patent to the Foley catheter?Answer:\n\nAccording to this paragraph, Frederic Foley applied for the patent but it was ultimately awarded to Paul Riache instead.\n\n",
    "Instruction:\n\nGiven a reference text about Georg Friedrich Parrot, tell me when and where he was born as well as what he studied.Answer:\n\nGeorg Friedrich Parrot was born on July 15, 1767 in Mömpelgard. He studied physics and mathematics at the University of Stuttgart.\n\n",
    "Instruction:\n\nWhich sub-Saharan colony was the first to gain independence?Answer:\n\nGhana was the first sub-Saharan colony to gain independence.\n\n",
    "Instruction:\n\nWho does the Navy Cross is awarded to?Answer:\n\nThe Navy Cross is awarded to Sailors and Marines who display heroism in combat with an armed enemy force.\n\n",
    "Instruction:\n\nGiven a reference text bout the Tampa Convention Center, when did it open and how big is it?Answer:\n\nThe Tampa Convention Center opened in 1990 and is about 600,000 square feet.\n\n",
    "Instruction:\n\nHow many countries in Europe do have the Euro as monetary currency?Answer:\n\n20\n\n",
    "Instruction:\n\nGiven a reference text about José Francisco Miguel António de Mendonça, tell me when he was appointed patriarch and when he died.Answer:\n\nJosé Francisco Miguel António de Mendonça was appointed Patriarch of Lisbon in 1786 and died in 1808.\n\n",
    "Instruction:\n\nWhat is the minimum amount of points a player needs to score to win a badminton match?Answer:\n\nThe minimum number of points needed to win a match of badminton is 42. In such a match only 2 games are played with the winning player scoring 21 points in each of them.\n\n",
    "Instruction:\n\nWhat is Don’t Starve Together?Answer:\n\nDon't Starve Together is a cooperative multiplayer survival game developed by Klei Entertainment, where up to six players can play together online or offline. Players take on the role of a band of characters in a harsh wilderness world, and must work together to keep alive, fed, and mentally stable as they avoid a variety of surreal and supernatural enemies that will try to kill and devour them. The game features a unique hand-drawn art style, as well as randomly generated worlds, providing a new experience with each playthrough.\n\n",
    "Instruction:\n\nWhere is the Stade Louis-ll located?Answer:\n\nThe Stade Louis-ll is located in the Fontvielle district of Monaco.\n\n",
    "Instruction:\n\nHow many times did Jorge compete in the Olympics?Answer:\n\nTwo times\n\n",
    "Instruction:\n\nBased on the reference text, what was the start date and the expected completion date of the reconstruction project on the Howard Frankland bridge.Answer:\n\nThe reconstruction project of the Howard Frankland bridge started in fall of 2020 and is expected to be completed in 2025.\n\n",
    "Instruction:\n\nGiven a reference text about IMDB, tell me how it rates movies.Answer:\n\nIMDB allows users to submit their reviews and ratings.  As the most extensive internet movie database and the 54th most visited website across the planet, the scale of reviews and ratings collected for movies is massive.  IMDB uses various mathematical calculations to determine the rating of movies.  Many users decide whether to spend time and money on a film solely on ratings from IMDB.  Because of IMDB's scale and impact, it is now a subsidiary of Amazon.\n\n",
    "Instruction:\n\nWhat is graph theory?Answer:\n\nGraph theory is the study of graphs, which are mathematical structures used to model pairwise relations between objects.\n\n",
    "Instruction:\n\nwhat was population of India during Mauryan Era?Answer:\n\nIt was around 31,000,000 during Maurya Era (200BC) .\n\n",
    "Instruction:\n\nWhat percentage of the world's population did the British Empire hold sway over?Answer:\n\n23 per cent of the world population\n\n",
    "Instruction:\n\nGiven this paragraph about Corsica, when was Napoleon Bonaparte born and where?Answer:\n\nNapoleon Bonaparte was born in 1769, the same year that France annexed Corsica. He was born in Ajaccio, Corsica.\n\n",
    "Instruction:\n\nGiven this paragraph about Aronia, what is another name for the plant and where were they first cultivated?Answer:\n\nAronia is also known as chokeberries and they were first cultivated in Scandinavia and Russia.\n\n",
    "Instruction:\n\nWho is the 46th president of the United States?Answer:\n\nThe president of the United States (POTUS) is the head of state and head of government of the United States of America and the commander-in-chief of the United States Armed Forces. The president is also the head of the executive branch of the federal government of the United States and is the chairman of the presidential cabinet.\n\nJoe Biden is the 46th and current president of the United States, in office since January 2021.\n\n",
    "Instruction:\n\nIs black hole truly black?Answer:\n\nAccording to general relativity, a black hole emits no lights at all. Thus it is 100% black by definition. However, when quantum effects are included, a black hole has finite temperature,  emitting lights called Hawking radiation. In this sense, a black hole is not truly black.\n\n",
    "Instruction:\n\nWhat is the largest fresh water lake?Answer:\n\nLake Baikal, located in Russia in the southern region of Sibera is the largest and deepest fresh water lake, containing 20% of Earth's fresh surface water.\n\n",
    "Instruction:\n\nWhich temple was the first female holocaust survivor ordained as a rabbi?Answer:\n\nTemple Emanuel in Ridgefield Park, NJ\n\n",
    "Instruction:\n\nWhat is use of bezier curve in Robotics?Answer:\n\nBézier curves can be used in robotics to produce trajectories of an end-effector due to the virtue of the control polygon’s ability to give a clear indication of whether the path is colliding with any nearby obstacle or object.\n\n",
    "Instruction:\n\nhere is a blurb about byte pair encoding for encryption, what benefits does this concept have besides compression?Answer:\n\nAn alternate use for byte pair encoding besides compression would be tokenization.  Tokenization can be used in Natural Language Processing to encode tokens of words for simplicity and speed in NLP tasks.\n\n",
    "Instruction:\n\nExplain the Montessori Method of education in pre-school and kindergartenAnswer:\n\nThe Montessori Method for Education in pre-school and kindergarten is a unique approach to teaching children to build self-confidence and independence. Learning takes place in Children's Houses and are fully staffed with a mixture of qualified teachers and teaching assistants who guide and consult the individual child by letting each child create their own learning pathway. Activities are introduced by the teacher, but there is no requirement for a child to complete the activity until they are ready, as what the child learns is fully guided by an individual child's interest. Classrooms are equipped with child-sized tables and chairs with learning materials on child height shelves. \nEducation covers a variety of areas, for example completing practical tasks including pouring water, washing up, cleaning tables and sweeping floors. They will have access to materials relating to mathematics, languages, music, art and culture. They are taught to learn basic concepts of mathematics and writing through a hands-on approach using tactile materials.\n\n",
    "Instruction:\n\nWhy was Tamazulapam del Espíritu Santo placed under quarantine?Answer:\n\nTamazulapam del Espíritu Santo was placed under quarantine due to the COVID-19 pandemic.\n\n",
    "Instruction:\n\nGiven this paragraph about the NFL, in what year was the Super Bowl first held?Answer:\n\n1967\n\n",
    "Instruction:\n\nHow large is the Gull Harbour and where exactly is it locatedAnswer:\n\nGull Harbour, that has been formerly named as States Harbour or Great Harbour is the 1.3 km wide bay indenting for 2.8 km the east coast of Weddell Island in the Falkland Islands.\n\nIt is entered north of Gull Point and south of Mark Point, and is centred at 51°53′56″S 60°53′20″W. The principal settlement of the island, Weddell Settlement, is situated at the head of the bay. Until the mid-nineteenth century Gull Harbour was known as Great Harbour.\n\n",
    "Instruction:\n\nGiven this reference text about beneficence, what can I do to ensure compliance to the beneficence concept?Answer:\n\nEnsure you are not harming your research participants, while maximizing benefits and minimizing any potential harm.  Engage with your community to determine best practices when encountering ethical concerns.  This should ensure your compliance with beneficence.\n\n",
    "Instruction:\n\nWhat is Hinton's citizenship?Answer:\n\nBritish and Canadian.\n\n",
    "Instruction:\n\nGiven this text about the Major League Baseball, where do Major League Baseball teams play spring training games and why.Answer:\n\nSpring training games are played in the states of Arizona or Florida due to the warm weather, even early in the year.\n\n",
    "Instruction:\n\nGiven the reference text about the science fiction novel Neuromancer, tell me the novel's author and the name of the main protagonist.Answer:\n\nNeuromancer was written by William Gibson and its main protagonist is Henry Case.\n\n",
    "Instruction:\n\nBased on this passage, what is the average number of people per family in Zangisheh?Answer:\n\nI can only tell you what it was in 2006, because this is when the survey data provided is from. The average number of people per family at that time is the population divided by the number of families, or 153 / 34.\n\n",
    "Instruction:\n\nHere is some reference information about Huaquechula, When does the feast of the Holy Cross in Huaquechula start?Answer:\n\nApril 25th.  It ends on May 3rd, and lasts 9 days.\n\n",
    "Instruction:\n\nAccording to this text, when did Disney become a public company?Answer:\n\nAccording to this text, Disney became a publicly listed company on the New York Stock Exchange (NYSE) in 1940 with the ticker symbol DIS.\n\n",
    "Instruction:\n\nGiven the reference text, where would I be able to find The Oath of Leo III?Answer:\n\nThe Oath of Leo III, painted by Raphael, can be found in the Apostolic Palace in the Vatican.\n\n",
    "Instruction:\n\nGiven this paragraph about the demographics of Osaka, what was the highest number of residents ever recorded to be living in Osaka at any one point in time?Answer:\n\nThe highest population ever recorded in Osaka was 3,252,340 in 1940.\n\n",
    "Instruction:\n\nGiven this paragraph, what were the regional release dates for Viva Piñata: Party Animals?Answer:\n\nViva Piñata: Party Animals was released for the Xbox 360 gaming console on October 30, 2007 in North America, November 15, 2007 in Australia, November 16, 2007 in Europe, and December 6, 2007 in Japan.\n\n",
    "Instruction:\n\nFrom the paragraph about the painting, \"The Little Street\", tell me the painting's significance with reference to the Dutch Golden Age in that period.Answer:\n\nVermeer's \"The Little Street\" is significant in the context of the Dutch Golden Age movement as it depicts a typical aspect of life in a Dutch Golden Age town during the 17th century. It is one of only two known Vermeer paintings of views of Delft, the others being \"View of Delft\". Its attention to detail, the use of light, and the realistic portrayal of everyday life are characteristic of the Dutch Golden Age movement's focus on realism and domesticity in art.\n\n",
    "Instruction:\n\nGiven this paragraph about Chinese cuisine, tell me what are the sub-cuisines, and what made them different.Answer:\n\nThe modern Chinese cuisine were broken down into 8 different styles of local cuisine, which are Anhui, Guangdong, Fujian, Hunan , Jiangsu , Shandong, Sichuan, and Zhejiang cuisines. They are different because of many reasons, such as geographic features and climate which shaped the locals to specialize in certain ingredients or flavors, as well as religion and ethnic groups.\n\n",
    "Instruction:\n\nGiven this paragraph about ferrets, do they spend the majority of the time sleeping in a 24 hour day?Answer:\n\nYes, ferrets sleep 14 to 18 hours per day.\n\n",
    "Instruction:\n\nGiven this paragraph about the terrain of the Iberian Peninsula, tell me the highest point in the peninsula and its altitude.Answer:\n\nThe highest point in the Iberian Peninsula is Mulhacen, located within the Penibaetic System. Its altitude is 3,478 m, or 11,411 ft\n\n",
    "Instruction:\n\nGiven this paragraph about Mass–energy equivalence, tell me what each part of the equation E=mc² stands for.Answer:\n\nE is for energy, m is for mass, and c² is for the speed of light squared\n\n",
    "Instruction:\n\nWhat is a chemical structure?Answer:\n\nA chemical structure determination includes a chemist's specifying the molecular geometry and, when feasible and necessary, the electronic structure of the target molecule or other solid.\n\n",
    "Instruction:\n\nWhat new economies developed because of the anti-slave treaties?Answer:\n\nInstead of exporting slaves, Africa began exporting palm oil, cocoa, timber, and gold.\n\n",
    "Instruction:\n\nWhat is a small-world network?Answer:\n\nA small-world network is a mathematical graph in which most nodes are not neighbors of one another, but the neighbors of any given node are likely to be neighbors of each other.\n\n",
    "Instruction:\n\nWhat was the first name of Thomas Attewell's brother and cousin?Answer:\n\nWilliam and Walter\n\n",
    "Instruction:\n\nHow many arms does Hapalochlaena lunulata have?Answer:\n\nHapalochlaena lunulata is an octopus, so it must have eight arms.\n\n",
    "Instruction:\n\nGiven this paragraph about Kevum, explain when it is typically consumed?Answer:\n\nIt's consumed usually for Sinahala and Tamil celebrations. Particularly, the New Year.\n\n",
    "Instruction:\n\nWhat is special about the number 1729?Answer:\n\n1729, known as the Hardy–Ramanujan number, is the smallest integer that can be expressed as the sum of the cubes of two unique pairs of integers.\n\n",
    "Instruction:\n\nGiven this paragraph about different types of eyes, how are eye types categorized and why?Answer:\n\nEyes are categorized into two types, \"simple eyes\" and \"compound eyes\". In this case, \"simple eyes\" do not mean that they have reduced complexity or acuity, but rather that they have one concave photoreceptive surface. This is in contrast to \"compound eyes\" which are comprised of a number of individual lenses on a convex surface. In other words, eyes fall into two groups based on their photoreceptor's cellular construction either being cilliated (as in the vertebrates) or rhabdomeric.\n\n",
    "Instruction:\n\nGiven this paragraph about Arlington, Virginia, what are the 3 public high schools in Arlington?Answer:\n\nThe 3 public high schools in Arlington, Va are Wakefield High School, Washington-Liberty High School, and Yorktown High School.\n\n",
    "Instruction:\n\nBased on this paragraph, what was the main focus of Mohammad Shah I's reign over his sultanate?Answer:\n\nMohammad was mainly focused on establishing law and order within his territory during his reign in order to remove thieves and robbers.\n\n",
    "Instruction:\n\nWhat is the population of Breezy Point city in Minnesota?Answer:\n\nBreezy Point's population was 2,346 at the 2010 census.\n\n",
    "Instruction:\n\nWhere did Kamlaksha Rama Naik receive his Business Management degree?Answer:\n\nThe Jamnalal Bajaj Institute in Mumbai\n\n",
    "Instruction:\n\nHow does the \"fire power\" help Fargus?Answer:\n\nIt grants Fargus invincibility and a deadly touch.\n\n",
    "Instruction:\n\nGiven a reference text about a film, tell me who directed it, the main cast, and the Academy Awards it won.Answer:\n\nThis film was directed by Ang Lee and stars Chow Yun-fat, Michelle Yeoh, Zhang Ziyi, and Chang Chen. In the 73rd Academy Awards in 2001, it won Best Foreign Language Film, Best Art Direction, Best Original Score, and Best Cinematography.\n\n",
    "Instruction:\n\nIn the summary below of episode 158 of the series Black Clover, how did the Spade army lose?Answer:\n\nAsta countered the Spade Kingdom's commandor's poison attack with the demon destroyer sword, then cut the attacking citadel in half, defeating the captain in a single blow.\n\n",
    "Instruction:\n\nGiven this paragraph about Africa, why Africa's per capita  GDP is low?Answer:\n\nWhile there are several reasons high population growth, corruption and colonialism and neocolonialism are some of the the factors.\n\n",
    "Instruction:\n\nWhy Bangalore climate is pleasantAnswer:\n\nBangalore city is positioned at a 920 mt high altitude from the sea level. Bangalore is nearest to both Arabian Sea & Bay of Bengal. Hence it receives plenty of rainfall & makes the place cooler as compared to rest of the cities in India. Along with this the city is full of big & old trees which adds up to the environment and makes more cooler with greenery.\n\n"
]