[
    "Context:\n\nWhile the Philippines is generally considered a civil law nation, its Supreme Court is heavily modelled after the American Supreme Court. This can be attributed to the fact that the Philippines was colonized by both Spain and the United States, and the system of laws of both nations strongly influenced the development of Philippine laws and jurisprudence. Even as the body of Philippine laws remain mostly codified, the Philippine Civil Code expressly recognizes that decisions of the Supreme Court \"form part of the law of the land\", belonging to the same class as statutes. The 1987 Philippine Constitution also explicitly grants to the Supreme Court the power of judicial review over laws and executive actions. The Supreme Court is composed of 1 Chief Justice and 14 Associate Justices. The court sits either en banc or in divisions, depending on the nature of the case to be decided.\n\nInstruction:\n\nWhat type of legal system is the Philippines officially?Answer:\n\na civil law nation\n\n",
    "Context:\n\nIn Canada, the largest Presbyterian denomination – and indeed the largest Protestant denomination – was the Presbyterian Church in Canada, formed in 1875 with the merger of four regional groups. In 1925, the United Church of Canada was formed by the majority of Presbyterians combining with the Methodist Church, Canada, and the Congregational Union of Canada. A sizable minority of Canadian Presbyterians, primarily in southern Ontario but also throughout the entire nation, withdrew, and reconstituted themselves as a non-concurring continuing Presbyterian body. They regained use of the original name in 1939.\n\nInstruction:\n\nIn what year did they discontinue use of the original name?Answer:\n\nN/A\n\n",
    "Context:\n\nCommissioners have various privileges, such as being exempt from member state taxes (but not EU taxes), and having immunity from prosecution for doing official acts. Commissioners have sometimes been found to have abused their offices, particularly since the Santer Commission was censured by Parliament in 1999, and it eventually resigned due to corruption allegations. This resulted in one main case, Commission v Edith Cresson where the European Court of Justice held that a Commissioner giving her dentist a job, for which he was clearly unqualified, did in fact not break any law. By contrast to the ECJ's relaxed approach, a Committee of Independent Experts found that a culture had developed where few Commissioners had ‘even the slightest sense of responsibility’. This led to the creation of the European Anti-fraud Office. In 2012 it investigated the Maltese Commissioner for Health, John Dalli, who quickly resigned after allegations that he received a €60m bribe in connection with a Tobacco Products Directive. Beyond the Commission, the European Central Bank has relative executive autonomy in its conduct of monetary policy for the purpose of managing the euro. It has a six-person board appointed by the European Council, on the Council's recommendation. The President of the Council and a Commissioner can sit in on ECB meetings, but do not have voting rights.\n\nInstruction:\n\nCan the President of the Council vote on important matters related to the European Central Bank?Answer:\n\ndo not have voting rights\n\n",
    "Context:\n\nSince 1934, the sale of Federal Duck Stamps has generated $670 million, and helped to purchase or lease 5,200,000 acres (8,100 sq mi; 21,000 km2) of habitat. The stamps serve as a license to hunt migratory birds, an entrance pass for all National Wildlife Refuge areas, and are also considered collectors items often purchased for aesthetic reasons outside of the hunting and birding communities. Although non-hunters buy a significant number of Duck Stamps, eighty-seven percent of their sales are contributed by hunters, which is logical, as hunters are required to purchase them. Distribution of funds is managed by the Migratory Bird Conservation Commission (MBCC).\n\nInstruction:\n\nWhat do the Duck Stamps serve as?Answer:\n\nlicense to hunt migratory birds\n\n",
    "Context:\n\nA national university is generally a university created or run by a national state but at the same time represents a state autonomic institution which functions as a completely independent body inside of the same state. Some national universities are closely associated with national cultural or political aspirations, for instance the National University of Ireland in the early days of Irish independence collected a large amount of information on the Irish language and Irish culture. Reforms in Argentina were the result of the University Revolution of 1918 and its posterior reforms by incorporating values that sought for a more equal and laic higher education system.\n\nInstruction:\n\nWhat was a focus of the National University of Ireland during the beginning of Irish Independence?Answer:\n\nIrish language and Irish culture\n\n",
    "Context:\n\nIn response to concerns that clubs were increasingly passing over young English players in favour of foreign players, in 1999, the Home Office tightened its rules for granting work permits to players from countries outside of the European Union. A non-EU player applying for the permit must have played for his country in at least 75 per cent of its competitive 'A' team matches for which he was available for selection during the previous two years, and his country must have averaged at least 70th place in the official FIFA world rankings over the previous two years. If a player does not meet those criteria, the club wishing to sign him may appeal.\n\nInstruction:\n\nIn what year did the Home Office loosen rules for granting work permits?Answer:\n\nN/A\n\n",
    "Context:\n\nThe acme of the horizontal engine was the Corliss steam engine, patented in 1849, which was a four-valve counter flow engine with separate steam admission and exhaust valves and automatic variable steam cutoff. When Corliss was given the Rumford medal the committee said that \"no one invention since Watt's time has so enhanced the efficiency of the steam engine\". In addition to using 30% less steam, it provided more uniform speed due to variable steam cut off, making it well suited to manufacturing, especially cotton spinning.\n\nInstruction:\n\nHow many valves did the Rumford engine use?Answer:\n\nN/A\n\n",
    "Context:\n\nThe halogen lamp reduces uneven evaporation of the filament and eliminates darkening of the envelope by filling the lamp with a halogen gas at low pressure, rather than an inert gas. The halogen cycle increases the lifetime of the bulb and prevents its darkening by redepositing tungsten from the inside of the bulb back onto the filament. The halogen lamp can operate its filament at a higher temperature than a standard gas filled lamp of similar power without loss of operating life. Such bulbs are much smaller than normal incandescent bulbs, and are widely used where intense illumination is needed in a limited space. Fiber-optic lamps for optical microscopy is one typical application.\n\nInstruction:\n\nDoes a halogen bulb operate at a higher or lower temperature than an incandescent?Answer:\n\nhigher\n\n",
    "Context:\n\nTypographically, the basic difference between the majuscules and minuscules is not that the majuscules are big and minuscules small, but that the majuscules generally have the same height. The height of the minuscules varies, as some of them have parts higher or lower than the average, i.e. ascenders and descenders. In Times New Roman, for instance, b, d, f, h, k, l, t  are the letters with ascenders, and g, j, p, q, y are the ones with descenders. Further to this, with old-style numerals still used by some traditional or classical fonts—although most do have a set of alternative Lining Figures— 6 and 8 make up the ascender set, and 3, 4, 5, 7 and 9 the descender set.\n\nInstruction:\n\nBesides the number 6, which number makes of the ascender set in some traditional or classical fonts?Answer:\n\n8\n\n",
    "Context:\n\nAccording to Eurostat, Greece's largest port by tons of goods transported in 2010 is the port of Aghioi Theodoroi, with 17.38 million tons. The Port of Thessaloniki comes second with 15.8 million tons, followed by the Port of Piraeus, with 13.2 million tons, and the port of Eleusis, with 12.37 million tons. The total number of goods transported through Greece in 2010 amounted to 124.38 million tons, a considerable drop from the 164.3 million tons transported through the country in 2007. Since then, Piraeus has grown to become the Mediterranean's third-largest port thanks to heavy investment by Chinese logistics giant COSCO. In 2013, Piraeus was declared the fastest-growing port in the world.\n\nInstruction:\n\nHow many million of tons went through Aghioi Theodoroi in 2010?Answer:\n\n17.38\n\n",
    "Context:\n\nLaws dating from 17th-century colonial America defined children of African slave mothers as taking the status of their mothers, and born into slavery regardless of the race or status of the father, under partus sequitur ventrem. The association of slavery with a \"race\" led to slavery as a racial caste. But, most families of free people of color formed in Virginia before the American Revolution were the descendants of unions between white women and African men, who frequently worked and lived together in the looser conditions of the early colonial period. While interracial marriage was later prohibited, white men frequently took sexual advantage of slave women, and numerous generations of multiracial children were born. By the late 1800s it had become common among African Americans to use passing to gain educational opportunities as did the first African-American graduate of Vassar College Anita Florence Hemmings. Some 19th-century categorization schemes defined people by proportion of African ancestry: a person whose parents were black and white was classified as mulatto, with one black grandparent and three white as quadroon, and with one black great-grandparent and the remainder white as octoroon. The latter categories remained within an overall black or colored category, but before the Civil War, in Virginia and some other states, a person of one-eighth or less black ancestry was legally white. Some members of these categories passed temporarily or permanently as white.\n\nInstruction:\n\nWho were free people of color in New York descended from?Answer:\n\nN/A\n\n",
    "Context:\n\nAnother popular argument for affirmative action is the compensation argument. Blacks were mistreated in the past for a morally irrelevant characteristic of being black so society today should compensate for the injuries. This causes reverse discrimination in the form of preferential hirings, contracts, and scholarships as a means to ameliorate past wrongs. Many opponents argue that this form of reparation is morally indefensible because if blacks were harmed for being black in the past, then preferential treatment for this same trait is illogical. In addition, arguments are made that whites today who innocently benefited from past injustices should not be punished for something they had no control over. Therefore, they are being reverse discriminated against because they are receiving the punishment that should be given to people who willingly and knowingly benefited from discriminatory practices\n\nInstruction:\n\nIn terms of whites, what is an argument that is used to try and refute the benefits of affirmative action as it relates to the compensation argument?Answer:\n\nwhites today who innocently benefited from past injustices should not be punished for something they had no control over\n\n",
    "Context:\n\nThe Total Force Policy was adopted by Chief of Staff of the Army General Creighton Abrams in the aftermath of the Vietnam War and involves treating the three components of the army – the Regular Army, the Army National Guard and the Army Reserve as a single force. Believing that no U.S. president should be able to take the United States (and more specifically the U.S. Army) to war without the support of the American people, General Abrams intertwined the structure of the three components of the army in such a way as to make extended operations impossible, without the involvement of both the Army National Guard and the Army Reserve.\n\nInstruction:\n\nWho rejected the Total Force Policy?Answer:\n\nN/A\n\n",
    "Context:\n\nLighting or illumination is the deliberate use of light to achieve a practical or aesthetic effect. Lighting includes the use of both artificial light sources like lamps and light fixtures, as well as natural illumination by capturing daylight. Daylighting (using windows, skylights, or light shelves) is sometimes used as the main source of light during daytime in buildings. This can save energy in place of using artificial lighting, which represents a major component of energy consumption in buildings. Proper lighting can enhance task performance, improve the appearance of an area, or have positive psychological effects on occupants.\n\nInstruction:\n\nLamps and light fixtures are a form of what?Answer:\n\nartificial light sources\n\n",
    "Context:\n\nThe city hosts numerous theatres and production houses, including the Yale Repertory Theatre, the Long Wharf Theatre, and the Shubert Theatre. There is also theatre activity from the Yale School of Drama, which works through the Yale University Theatre and the student-run Yale Cabaret. Southern Connecticut State University hosts the Lyman Center for the Performing Arts. The shuttered Palace Theatre (opposite the Shubert Theatre) is being renovated and will reopen as the College Street Music Hall in May, 2015. Smaller theatres include the Little Theater on Lincoln Street. Cooperative Arts and Humanities High School also boasts a state-of-the-art theatre on College Street. The theatre is used for student productions as well as the home to weekly services to a local non-denominational church, the City Church New Haven.\n\nInstruction:\n\nIn what year did the newly renovated College Street Music Hall reopen? Answer:\n\n2015\n\n",
    "Context:\n\nThe team placed fifth in the Premier League automatically qualifies for the UEFA Europa League, and the sixth and seventh-placed teams can also qualify, depending on the winners of the two domestic cup competitions i.e. the FA Cup and the Capital One Cup (League Cup). Two Europa League places are reserved for the winners of each tournament; if the winner of either the FA Cup or League Cup qualifies for the Champions League, then that place will go to the next-best placed finisher in the Premier League. A further place in the UEFA Europa League is also available via the Fair Play initiative. If the Premier League has one of the three highest Fair Play rankings in Europe, the highest ranked team in the Premier League Fair Play standings which has not already qualified for Europe will automatically qualify for the UEFA Europa League first qualifying round.\n\nInstruction:\n\nHow many Europa League places are reserved for domestic tournament winners?Answer:\n\nTwo\n\n",
    "Context:\n\nNonvascular land plants are embryophytes that lack the vascular tissues xylem and phloem. They include mosses, liverworts and hornworts. Pteridophytic vascular plants with true xylem and phloem that reproduced by spores germinating into free-living gametophytes evolved during the Silurian period and diversified into several lineages during the late Silurian and early Devonian. Representatives of the lycopods have survived to the present day. By the end of the Devonian period, several groups, including the lycopods, sphenophylls and progymnosperms, had independently evolved \"megaspory\" – their spores were of two distinct sizes, larger megaspores and smaller microspores. Their reduced gametophytes developed from megaspores retained within the spore-producing organs (megasporangia) of the sporophyte, a condition known as endospory. Seeds consist of an endosporic megasporangium surrounded by one or two sheathing layers (integuments). The young sporophyte develops within the seed, which on germination splits to release it. The earliest known seed plants date from the latest Devonian Famennian stage. Following the evolution of the seed habit, seed plants diversified, giving rise to a number of now-extinct groups, including seed ferns, as well as the modern gymnosperms and angiosperms. Gymnosperms produce \"naked seeds\" not fully enclosed in an ovary; modern representatives include conifers, cycads, Ginkgo, and Gnetales. Angiosperms produce seeds enclosed in a structure such as a carpel or an ovary. Ongoing research on the molecular phylogenetics of living plants appears to show that the angiosperms are a sister clade to the gymnosperms.\n\nInstruction:\n\nWhat protects the young plant in the seed?Answer:\n\none or two sheathing layers\n\n",
    "Context:\n\nAt the end of the Late Middle Ages, professional actors began to appear in England and Europe. Richard III and Henry VII both maintained small companies of professional actors. Their plays were performed in the Great Hall of a nobleman's residence, often with a raised platform at one end for the audience and a \"screen\" at the other for the actors. Also important were Mummers' plays, performed during the Christmas season, and court masques. These masques were especially popular during the reign of Henry VIII who had a House of Revels built and an Office of Revels established in 1545.\n\nInstruction:\n\nIn what part of a nobleman's house were plays performed?Answer:\n\nthe Great Hall\n\n",
    "Context:\n\nThe war was successful for Great Britain, which gained the bulk of New France in North America, Spanish Florida, some individual Caribbean islands in the West Indies, the colony of Senegal on the West African coast, and superiority over the French trading outposts on the Indian subcontinent. The Native American tribes were excluded from the settlement; a subsequent conflict, known as Pontiac's War, was also unsuccessful in returning them to their pre-war status. In Europe, the war began disastrously for Prussia, but a combination of good luck and successful strategy saw King Frederick the Great manage to retrieve the Prussian position and retain the status quo ante bellum. Prussia emerged as a new European great power. The involvement of Portugal, Spain and Sweden did not return them to their former status as great powers. France was deprived of many of its colonies and had saddled itself with heavy war debts that its inefficient financial system could barely handle. Spain lost Florida but gained French Louisiana and regained control of its colonies, e.g., Cuba and the Philippines, which had been captured by the British during the war. France and other European powers will soon avenge their defeat in 1778 when American Revolutionary War broke out, with hopes of destroying Britain's dominance once and for all.\n\nInstruction:\n\nWhat were two factors that redeemed the outcome for the Prussians?Answer:\n\ngood luck and successful strategy\n\n",
    "Context:\n\nMaplecroft Child Labour Index 2012 survey reports 76 countries pose extreme child labour complicity risks for companies operating worldwide. The ten highest risk countries in 2012, ranked in decreasing order, were: Myanmar, North Korea, Somalia, Sudan, DR Congo, Zimbabwe, Afghanistan, Burundi, Pakistan and Ethiopia. Of the major growth economies, Maplecroft ranked Philippines 25th riskiest, India 27th, China 36th, Viet Nam 37th, Indonesia 46th, and Brazil 54th - all of them rated to involve extreme risks of child labour uncertainties, to corporations seeking to invest in developing world and import products from emerging markets.\n\nInstruction:\n\nAccording to the Maplecroft Child Labour Index how many countries post risks for child labour?Answer:\n\n76\n\n",
    "Context:\n\nThe Yoga school builds on the Samkhya school theory that jñāna (knowledge) is a sufficient means to moksha. It suggests that systematic techniques/practice (personal experimentation) combined with Samkhya's approach to knowledge is the path to moksha. Yoga shares several central ideas with Advaita Vedanta, with the difference that Yoga is a form of experimental mysticism while Advaita Vedanta is a form of monistic personalism. Like Advaita Vedanta, the Yoga school of Hindu philosophy states that liberation/freedom in this life is achievable, and this occurs when an individual fully understands and realizes the equivalence of Atman (soul, self) and Brahman.\n\nInstruction:\n\nWhat is the meaning of jnana?Answer:\n\nknowledge\n\n",
    "Context:\n\nDNA samples from 1228 Russians show that the Y chromosomes analyzed, all except 20 (1.6%) fall into seven major haplogroups all characteristic to West Eurasian populations. Taken together, they account for 95% of the total Russian Y chromosomal pool. Only (0.7%) fell into haplogroups that are specific to East and South Asian populations. Mitochondrial DNA (mtDNA) examined in Poles and Russians revealed the presence of all major European haplogroups, which were characterized by similar patterns of distribution in Poles and Russians. An analysis of the DNA did not reveal any specific combinations of unique mtDNA haplotypes and their subclusters. The DNA clearly shows that both Poles and Russians are not different from the neighbouring European populations.\n\nInstruction:\n\nTaken together, they account for what percentage of the total Russian Y chromosomal pool?Answer:\n\n95%\n\n",
    "Context:\n\nThe 2nd edition (1787) contained a Refutation of Idealism to distinguish his transcendental idealism from Descartes's Sceptical Idealism and Berkeley's anti-realist strain of Subjective Idealism. The section Paralogisms of Pure Reason is an implicit critique of Descartes' idealism. Kant says that it is not possible to infer the 'I' as an object (Descartes' cogito ergo sum) purely from \"the spontaneity of thought\". Kant focused on ideas drawn from British philosophers such as Locke, Berkeley and Hume but distinguished his transcendental or critical idealism from previous varieties;\n\nInstruction:\n\nWhat sort of idealist was Descartes?Answer:\n\nSceptical\n\n",
    "Context:\n\nWithin the world's Jewish population there are distinct ethnic divisions, most of which are primarily the result of geographic branching from an originating Israelite population, and subsequent independent evolutions. An array of Jewish communities was established by Jewish settlers in various places around the Old World, often at great distances from one another, resulting in effective and often long-term isolation. During the millennia of the Jewish diaspora the communities would develop under the influence of their local environments: political, cultural, natural, and populational. Today, manifestations of these differences among the Jews can be observed in Jewish cultural expressions of each community, including Jewish linguistic diversity, culinary preferences, liturgical practices, religious interpretations, as well as degrees and sources of genetic admixture.\n\nInstruction:\n\nName one way Jewish cultural expressions differ in each community?Answer:\n\nreligious interpretations\n\n",
    "Context:\n\nThe addition of new rock units, both depositionally and intrusively, often occurs during deformation. Faulting and other deformational processes result in the creation of topographic gradients, causing material on the rock unit that is increasing in elevation to be eroded by hillslopes and channels. These sediments are deposited on the rock unit that is going down. Continual motion along the fault maintains the topographic gradient in spite of the movement of sediment, and continues to create accommodation space for the material to deposit. Deformational events are often also associated with volcanism and igneous activity. Volcanic ashes and lavas accumulate on the surface, and igneous intrusions enter from below. Dikes, long, planar igneous intrusions, enter along cracks, and therefore often form in large numbers in areas that are being actively deformed. This can result in the emplacement of dike swarms, such as those that are observable across the Canadian shield, or rings of dikes around the lava tube of a volcano.\n\nInstruction:\n\nWhat is another name for a deformational event?Answer:\n\nN/A\n\n",
    "Context:\n\nAbout that time the \"executionist movement\" (Polish: \"egzekucja praw\"--\"execution of the laws\") began to take form. Its members would seek to curb the power of the magnates at the Sejm and to strengthen the power of king and country. In 1562 at the Sejm in Piotrków they would force the magnates to return many leased crown lands to the king, and the king to create a standing army (wojsko kwarciane). One of the most famous members of this movement was Jan Zamoyski. After his death in 1605, the movement lost its political force.\n\nInstruction:\n\nWHen did Jan Zamoyski. die?Answer:\n\n1605\n\n",
    "Context:\n\nFor 36 years, NATO and the Warsaw Pact never directly waged war against each other in Europe; the United States and the Soviet Union and their respective allies implemented strategic policies aimed at the containment of each other in Europe, while working and fighting for influence within the wider Cold War on the international stage.\n\nInstruction:\n\nWho waged war against each other for 36 years?Answer:\n\nN/A\n\n",
    "Context:\n\nRuben Studdard emerged as the winner, beating Clay Aiken by a small margin. Out of a total of 24 million votes, Studdard finished just 134,000 votes ahead of Aiken. This slim margin of victory was controversial due to the large number of calls that failed to get through. In an interview prior to season five, executive producer Nigel Lythgoe indicated that Aiken had led the fan voting from the wildcard week onward until the finale.\n\nInstruction:\n\nHow many more votes did Studdard have at the finale?Answer:\n\n134,000\n\n",
    "Context:\n\nThe structure of a mosque is simple and it expresses openness. Calligraphic inscriptions from the Quran decorate mosques and mausoleums in Punjab. The inscriptions on bricks and tiles of the mausoleum of Shah Rukn-e-Alam (1320 AD) at Multan are outstanding specimens of architectural calligraphy. The earliest existing building in South Asia with enamelled tile-work is the tomb of Shah Yusuf Gardezi (1150 AD) at Multan. A specimen of the sixteenth century tile-work at Lahore is the tomb of Sheikh Musa Ahangar, with its brilliant blue dome. The tile-work of Emperor Shah Jahan is of a richer and more elaborate nature. The pictured wall of Lahore Fort is the last line in the tile-work in the entire world.\n\nInstruction:\n\nWhat kind of inscriptions decorate Punjab's burial places?Answer:\n\nCalligraphic inscriptions from the Quran\n\n",
    "Context:\n\nAfter the disastrous defeat of the Prussian Army at the Battle of Jena-Auerstedt in 1806, Napoleon occupied Berlin and had the officials of the Prussian General Directory swear an oath of allegiance to him, while King Frederick William III and his consort Louise fled via Königsberg and the Curonian Spit to Memel. The French troops immediately took up pursuit but were delayed in the Battle of Eylau on 9 February 1807 by an East Prussian contingent under General Anton Wilhelm von L'Estocq. Napoleon had to stay at the Finckenstein Palace, but in May, after a siege of 75 days, his troops led by Marshal François Joseph Lefebvre were able to capture the city Danzig, which had been tenaciously defended by General Count Friedrich Adolf von Kalkreuth. On 14 June, Napoleon ended the War of the Fourth Coalition with his victory at the Battle of Friedland. Frederick William and Queen Louise met with Napoleon for peace negotiations, and on 9 July the Prussian king signed the Treaty of Tilsit.\n\nInstruction:\n\nWho was the leader of the army Napoleon beat at the Battle of Friedland?Answer:\n\nN/A\n\n",
    "Context:\n\nIn 1919, following the Treaty of Versailles, the city was restituted to France in accordance with U.S. President Woodrow Wilson's \"Fourteen Points\" without a referendum. The date of the assignment was retroactively established on Armistice Day. It is doubtful whether a referendum in Strasbourg would have ended in France's favour since the political parties striving for an autonomous Alsace or a connection to France accounted only for a small proportion of votes in the last Reichstag as well as in the local elections. The Alsatian autonomists who were pro French had won many votes in the more rural parts of the region and other towns since the annexation of the region by Germany in 1871. The movement started with the first election for the Reichstag; those elected were called \"les députés protestataires\", and until the fall of Bismarck in 1890, they were the only deputies elected by the Alsatians to the German parliament demanding the return of those territories to France. At the last Reichstag election in Strasbourg and its periphery, the clear winners were the Social Democrats; the city was the administrative capital of the region, was inhabited by many Germans appointed by the central government in Berlin and its flourishing economy attracted many Germans. This could explain the difference between the rural vote and the one in Strasbourg. After the war, many Germans left Strasbourg and went back to Germany; some of them were denounced by the locals or expelled by the newly appointed authorities. The Saverne Affair was vivid in the memory among the Alsatians.\n\nInstruction:\n\nIn what year did the Social Democrats form?Answer:\n\nN/A\n\n",
    "Context:\n\nThe nervous system is large relative to the bird's size. The most developed part of the brain is the one that controls the flight-related functions, while the cerebellum coordinates movement and the cerebrum controls behaviour patterns, navigation, mating and nest building. Most birds have a poor sense of smell with notable exceptions including kiwis, New World vultures and tubenoses. The avian visual system is usually highly developed. Water birds have special flexible lenses, allowing accommodation for vision in air and water. Some species also have dual fovea. Birds are tetrachromatic, possessing ultraviolet (UV) sensitive cone cells in the eye as well as green, red and blue ones. This allows them to perceive ultraviolet light, which is involved in courtship. Birds have specialized light-sensing cells deep in their brains that respond to light without input from eyes or other sensory neurons. These photo-receptive cells in the hypothalamus are involved in detecting the longer days of spring, and thus regulate breeding activities.\n\nInstruction:\n\nWhat is tetrachromatic?Answer:\n\npossessing ultraviolet (UV) sensitive cone cells in the eye as well as green, red and blue ones\n\n",
    "Context:\n\nIn the early 1980s, Chicago radio jocks The Hot Mix 5, and club DJs Ron Hardy and Frankie Knuckles played various styles of dance music, including older disco records (mostly Philly disco and Salsoul tracks), electro funk tracks by artists such as Afrika Bambaataa, newer Italo disco, B-Boy hip hop music by Man Parrish, Jellybean Benitez, Arthur Baker, and John Robie, and electronic pop music by Kraftwerk and Yellow Magic Orchestra. Some made and played their own edits of their favorite songs on reel-to-reel tape, and sometimes mixed in effects, drum machines, and other rhythmic electronic instrumentation. In this era,\n\nInstruction:\n\nwhat style of music did afrika bambaataa play?Answer:\n\nelectro funk\n\n",
    "Context:\n\nIn Dutch, the diminutive is not merely restricted to nouns and exist in numerals (met z'n tweetjes, \"the two of us\"), pronouns (onderonsje, \"tête-à-tête\"), verbal particles (moetje, \"shotgun marriage\"), and even prepositions (toetje, \"dessert\"). Most notable however, are the diminutive forms of adjectives and adverbs. The former take an diminutive ending and thus functions as a noun, the latter remain adverbs and have always the diminutive with the -s appended, e.g. adjective: groen (\"green\") → noun: groentje (\"rookie\"); adverb: even (\"just\") → adverb: eventjes (\"just a minute\").\n\nInstruction:\n\nWhat word do Dutch speakers use for what we call a \"shotgun marriage\"?Answer:\n\nmoetje\n\n",
    "Context:\n\nAfter the development of the large London Porter breweries in the 18th century, the trend grew for pubs to become tied houses which could only sell beer from one brewery (a pub not tied in this way was called a Free house). The usual arrangement for a tied house was that the pub was owned by the brewery but rented out to a private individual (landlord) who ran it as a separate business (even though contracted to buy the beer from the brewery). Another very common arrangement was (and is) for the landlord to own the premises (whether freehold or leasehold) independently of the brewer, but then to take a mortgage loan from a brewery, either to finance the purchase of the pub initially, or to refurbish it, and be required as a term of the loan to observe the solus tie.\n\nInstruction:\n\nIn what century did the habit arise of pubs selling beer from only one brewery?Answer:\n\n18th\n\n",
    "Context:\n\nImperial submitted a total of 1,257 staff across 14 units of assessment to the 2014 Research Excellence Framework (REF) assessment. In the REF results 46% of Imperial's submitted research was classified as 4*, 44% as 3*, 9% as 2* and 1% as 1*, giving an overall GPA of 3.36. In rankings produced by Times Higher Education based upon the REF results Imperial was ranked 2nd overall for GPA and 8th for \"research power\" (compared to 6th and 7th respectively in the equivalent rankings for the RAE 2008).\n\nInstruction:\n\nWho was ranked 6th and 7th in research power?Answer:\n\nN/A\n\n",
    "Context:\n\nOn 9 September the OKL appeared to be backing two strategies. Its round-the-clock bombing of London was an immediate attempt to force the British government to capitulate, but it was also striking at Britain's vital sea communications to achieve a victory through siege. Although the weather was poor, heavy raids took place that afternoon on the London suburbs and the airfield at Farnborough. The day's fighting cost Kesselring and Luftflotte 2 (Air Fleet 2) 24 aircraft, including 13 Bf 109s. Fighter Command lost 17 fighters and six pilots. Over the next few days weather was poor and the next main effort would not be made until 15 September 1940.\n\nInstruction:\n\nWhat was the name of the airfield where heavy raids took place?Answer:\n\nFarnborough\n\n",
    "Context:\n\nThe earliest writers on sexual orientation usually understood it to be intrinsically linked to the subject's own sex. For example, it was thought that a typical female-bodied person who is attracted to female-bodied persons would have masculine attributes, and vice versa. This understanding was shared by most of the significant theorists of sexual orientation from the mid nineteenth to early twentieth century, such as Karl Heinrich Ulrichs, Richard von Krafft-Ebing, Magnus Hirschfeld, Havelock Ellis, Carl Jung, and Sigmund Freud, as well as many gender-variant homosexual people themselves. However, this understanding of homosexuality as sexual inversion was disputed at the time, and, through the second half of the twentieth century, gender identity came to be increasingly seen as a phenomenon distinct from sexual orientation. Transgender and cisgender people may be attracted to men, women, or both, although the prevalence of different sexual orientations is quite different in these two populations. An individual homosexual, heterosexual or bisexual person may be masculine, feminine, or androgynous, and in addition, many members and supporters of lesbian and gay communities now see the \"gender-conforming heterosexual\" and the \"gender-nonconforming homosexual\" as negative stereotypes. Nevertheless, studies by J. Michael Bailey and Kenneth Zucker found a majority of the gay men and lesbians sampled reporting various degrees of gender-nonconformity during their childhood years.\n\nInstruction:\n\nWhat did a majority of gay men and women experience in their childhood?Answer:\n\ngender-nonconformity\n\n",
    "Context:\n\nIn his investiture address, given on 28 October 1969 in Bonn, Chancellor Willy Brandt proposed that the government would consider Article 29 of the Basic Law as a binding order. An expert commission was established, named after its chairman, the former Secretary of State Professor Werner Ernst. After two years of work, the experts delivered their report in 1973. It provided an alternative proposal for both northern Germany and central and southwestern Germany. In the north, either a single new state consisting of Schleswig-Holstein, Hamburg, Bremen and Lower Saxony should be created (solution A) or two new states, one in the northeast consisting of Schleswig-Holstein, Hamburg and the northern part of Lower Saxony (from Cuxhaven to Lüchow-Dannenberg) and one in the northwest consisting of Bremen and the rest of Lower Saxony (solution B). In the Center and South West either Rhineland-Palatinate (with the exception of the Germersheim district but including the Rhine-Neckar region) should be merged with Hesse and the Saarland (solution C), the district of Germersheim would then become part of Baden-Württemberg.\n\nInstruction:\n\nWho established an expert commission to discuss article 29?Answer:\n\nN/A\n\n",
    "Context:\n\nDell has been attempting to offset its declining PC business, which still accounted for half of its revenue and generates steady cash flow, by expanding into the enterprise market with servers, networking, software, and services. It avoided many of the acquisition writedowns and management turnover that plagued its chief rival Hewlett Packard. Dell also managed some success in taking advantage of its high-touch direct sales heritage to establish close relationships and design solutions for clients. Despite spending $13 billion on acquisitions to diversify its portfolio beyond hardware, the company was unable to convince the market that it could thrive or made the transformation in the post-PC world, as it suffered continued declines in revenue and share price. Dell's market share in the corporate segment was previously a \"moat\" against rivals but this has no longer been the case as sales and profits have fallen precipitously.\n\nInstruction:\n\nHow much did Dell spend on acquiring different divisions?Answer:\n\n$13 billion\n\n",
    "Context:\n\nThe first Sky television rights agreement was worth £304 million over five seasons. The next contract, negotiated to start from the 1997–98 season, rose to £670 million over four seasons. The third contract was a £1.024 billion deal with BSkyB for the three seasons from 2001–02 to 2003–04. The league brought in £320 million from the sale of its international rights for the three-year period from 2004–05 to 2006–07. It sold the rights itself on a territory-by-territory basis. Sky's monopoly was broken from August 2006 when Setanta Sports was awarded rights to show two out of the six packages of matches available. This occurred following an insistence by the European Commission that exclusive rights should not be sold to one television company. Sky and Setanta paid a total of £1.7 billion, a two-thirds increase which took many commentators by surprise as it had been widely assumed that the value of the rights had levelled off following many years of rapid growth. Setanta also hold rights to a live 3 pm match solely for Irish viewers. The BBC has retained the rights to show highlights for the same three seasons (on Match of the Day) for £171.6 million, a 63 per cent increase on the £105 million it paid for the previous three-year period. Sky and BT have agreed to jointly pay £84.3 million for delayed television rights to 242 games (that is the right to broadcast them in full on television and over the internet) in most cases for a period of 50 hours after 10 pm on matchday. Overseas television rights fetched £625 million, nearly double the previous contract. The total raised from these deals is more than £2.7 billion, giving Premier League clubs an average media income from league games of around £40 million-a-year from 2007 to 2010.\n\nInstruction:\n\nHow much was the first television rights contract awarded to Sky worth?Answer:\n\n£304 million\n\n",
    "Context:\n\nHyderabad's lakes and the sloping terrain of its low-lying hills provide habitat for an assortment of flora and fauna. The forest region in and around the city encompasses areas of ecological and biological importance, which are preserved in the form of national parks, zoos, mini-zoos and a wildlife sanctuary. Nehru Zoological Park, the city's one large zoo, is the first in India to have a lion and tiger safari park. Hyderabad has three national parks (Mrugavani National Park, Mahavir Harina Vanasthali National Park and Kasu Brahmananda Reddy National Park), and the Manjira Wildlife Sanctuary is about 50 km (31 mi) from the city. Hyderabad's other environmental reserves are: Kotla Vijayabhaskara Reddy Botanical Gardens, Shamirpet Lake, Hussain Sagar, Fox Sagar Lake, Mir Alam Tank and Patancheru Lake, which is home to regional birds and attracts seasonal migratory birds from different parts of the world. Organisations engaged in environmental and wildlife preservation include the Telangana Forest Department, Indian Council of Forestry Research and Education, the International Crops Research Institute for the Semi-Arid Tropics (ICRISAT), the Animal Welfare Board of India, the Blue Cross of Hyderabad and the University of Hyderabad.\n\nInstruction:\n\nHow many national parks does Hyderabad have?Answer:\n\nthree\n\n",
    "Context:\n\nHumbert is at the center of ascetic writers in the Dominican Order. In this role, he added significantly to its spirituality. His writings are permeated with \"religious good sense,\" and he used uncomplicated language that could edify even the weakest member. Humbert advised his readers, \"[Young Dominicans] are also to be instructed not to be eager to see visions or work miracles, since these avail little to salvation, and sometimes we are fooled by them; but rather they should be eager to do good in which salvation consists. Also, they should be taught not to be sad if they do not enjoy the divine consolations they hear others have; but they should know the loving Father for some reason sometimes withholds these. Again, they should learn that if they lack the grace of compunction or devotion they should not think they are not in the state of grace as long as they have good will, which is all that God regards\".\n\nInstruction:\n\nWho did not significantly add to the order's spirituality?Answer:\n\nN/A\n\n",
    "Context:\n\nIn March 2011, it was said on the Wayback Machine forum that \"The Beta of the new Wayback Machine has a more complete and up-to-date index of all crawled materials into 2010, and will continue to be updated regularly. The index driving the classic Wayback Machine only has a little bit of material past 2008, and no further index updates are planned, as it will be phased out this year\".\n\nInstruction:\n\nWhen were details of the final version of the released?Answer:\n\nN/A\n\n",
    "Context:\n\nComplications may occur immediately following the heart attack (in the acute phase), or may need time to develop (a chronic problem). Acute complications may include heart failure if the damaged heart is no longer able to pump blood adequately around the body; aneurysm of the left ventricle myocardium; ventricular septal rupture or free wall rupture; mitral regurgitation, in particular if the infarction causes dysfunction of the papillary muscle; Dressler's syndrome; and abnormal heart rhythms, such as ventricular fibrillation, ventricular tachycardia, atrial fibrillation, and heart block. Longer-term complications include heart failure, atrial fibrillation, and an increased risk of a second MI.\n\nInstruction:\n\nWhat does mitral regurgitation cause?Answer:\n\nN/A\n\n",
    "Context:\n\nThe Occupy Wall Street protests in Zuccotti Park in the Financial District of Lower Manhattan began on September 17, 2011, receiving global attention and spawning the Occupy movement against social and economic inequality worldwide.\n\nInstruction:\n\nOn what date did the Occupy Wall Street protests commence?Answer:\n\nSeptember 17, 2011\n\n",
    "Context:\n\nThe Devonian spanned roughly from 419 to 359 Ma. The period was a time of great tectonic activity, as Laurasia and Gondwana drew closer together. The continent Euramerica (or Laurussia) was created in the early Devonian by the collision of Laurentia and Baltica, which rotated into the natural dry zone along the Tropic of Capricorn. In these near-deserts, the Old Red Sandstone sedimentary beds formed, made red by the oxidized iron (hematite) characteristic of drought conditions. Near the equator Pangaea began to consolidate from the plates containing North America and Europe, further raising the northern Appalachian Mountains and forming the Caledonian Mountains in Great Britain and Scandinavia. The southern continents remained tied together in the supercontinent of Gondwana. The remainder of modern Eurasia lay in the Northern Hemisphere. Sea levels were high worldwide, and much of the land lay submerged under shallow seas. The deep, enormous Panthalassa (the \"universal ocean\") covered the rest of the planet. Other minor oceans were Paleo-Tethys, Proto-Tethys, Rheic Ocean and Ural Ocean (which was closed during the collision with Siberia and Baltica).\n\nInstruction:\n\nWhat two continents where moving away from each other during Devonian?Answer:\n\nN/A\n\n",
    "Context:\n\niPods have also gained popularity for use in education. Apple offers more information on educational uses for iPods on their website, including a collection of lesson plans. There has also been academic research done in this area in nursing education and more general K-16 education. Duke University provided iPods to all incoming freshmen in the fall of 2004, and the iPod program continues today with modifications. Entertainment Weekly put it on its end-of-the-decade, \"best-of\" list, saying, \"Yes, children, there really was a time when we roamed the earth without thousands of our favorite jams tucked comfortably into our hip pockets. Weird.\"\n\nInstruction:\n\nWhich major university began issuing iPods to all incoming freshmen starting in 2004?Answer:\n\nDuke\n\n",
    "Context:\n\nOne means by which this is done is with a special signal called an interrupt, which can periodically cause the computer to stop executing instructions where it was and do something else instead. By remembering where it was executing prior to the interrupt, the computer can return to that task later. If several programs are running \"at the same time\". then the interrupt generator might be causing several hundred interrupts per second, causing a program switch each time. Since modern computers typically execute instructions several orders of magnitude faster than human perception, it may appear that many programs are running at the same time even though only one is ever executing in any given instant. This method of multitasking is sometimes termed \"time-sharing\" since each program is allocated a \"slice\" of time in turn.\n\nInstruction:\n\nA signal that stops a compute executing instructions is called what?Answer:\n\nan interrupt,\n\n",
    "Context:\n\nThe institutions and practices of canon law paralleled the legal development of much of Europe, and consequently both modern civil law and common law (legal system) bear the influences of canon law. Edson Luiz Sampel, a Brazilian expert in canon law, says that canon law is contained in the genesis of various institutes of civil law, such as the law in continental Europe and Latin American countries. Sampel explains that canon law has significant influence in contemporary society.\n\nInstruction:\n\nWhat does Sampel claim had a great impact on?Answer:\n\ncontemporary society\n\n",
    "Context:\n\nProbably the most influential single device on the interpretation of these characters was the Teletype Model 33 ASR, which was a printing terminal with an available paper tape reader/punch option. Paper tape was a very popular medium for long-term program storage until the 1980s, less costly and in some ways less fragile than magnetic tape. In particular, the Teletype Model 33 machine assignments for codes 17 (Control-Q, DC1, also known as XON), 19 (Control-S, DC3, also known as XOFF), and 127 (Delete) became de facto standards. The Model 33 was also notable for taking the description of Control-G (BEL, meaning audibly alert the operator) literally as the unit contained an actual bell which it rang when it received a BEL character. Because the keytop for the O key also showed a left-arrow symbol (from ASCII-1963, which had this character instead of underscore), a noncompliant use of code 15 (Control-O, Shift In) interpreted as \"delete previous character\" was also adopted by many early timesharing systems but eventually became neglected.\n\nInstruction:\n\nWhat code eventually became neglected?Answer:\n\ncode 15 (Control-O, Shift In)\n\n",
    "Context:\n\nThe Alps (/ælps/; Italian: Alpi [ˈalpi]; French: Alpes [alp]; German: Alpen [ˈʔalpm̩]; Slovene: Alpe [ˈáːlpɛ]) are the highest and most extensive mountain range system that lies entirely in Europe, stretching approximately 1,200 kilometres (750 mi) across eight Alpine countries: Austria, France, Germany, Italy, Liechtenstein, Monaco, Slovenia, and Switzerland. The Caucasus Mountains are higher, and the Urals longer, but both lie partly in Asia. The mountains were formed over tens of millions of years as the African and Eurasian tectonic plates collided. Extreme shortening caused by the event resulted in marine sedimentary rocks rising by thrusting and folding into high mountain peaks such as Mont Blanc and the Matterhorn. Mont Blanc spans the French–Italian border, and at 4,810 m (15,781 ft) is the highest mountain in the Alps. The Alpine region area contains about a hundred peaks higher than 4,000 m (13,123 ft), known as the \"four-thousanders\".\n\nInstruction:\n\nThe Alpine region is also known as what? Answer:\n\nthe \"four-thousanders\"\n\n",
    "Context:\n\nWhile on one hand the Heian period was an unusually long period of peace, it can also be argued that the period weakened Japan economically and led to poverty for all but a tiny few of its inhabitants. The control of rice fields provided a key source of income for families such as the Fujiwara and were a fundamental base for their power. The aristocratic beneficiaries of Heian culture, the Ryōmin (良民 \"Good People\") numbered about five thousand in a land of perhaps five million. One reason the samurai were able to take power was that the ruling nobility proved incompetent at managing Japan and its provinces. By the year 1000 the government no longer knew how to issue currency and money was gradually disappearing. Instead of a fully realised system of money circulation, rice was the primary unit of exchange. The lack of a solid medium of economic exchange is implicitly illustrated in novels of the time. For instance, messengers were rewarded with useful objects, e.g., an old silk kimono, rather than paid a fee.\n\nInstruction:\n\nWhat was the name of the beneficiaries of Heian culture?Answer:\n\nRyōmin\n\n",
    "Context:\n\nStepper motors are a type of motor frequently used when precise rotations are required. In a stepper motor an internal rotor containing PMs or a magnetically soft rotor with salient poles is controlled by a set of external magnets that are switched electronically. A stepper motor may also be thought of as a cross between a DC electric motor and a rotary solenoid. As each coil is energized in turn, the rotor aligns itself with the magnetic field produced by the energized field winding. Unlike a synchronous motor, in its application, the stepper motor may not rotate continuously; instead, it \"steps\"—starts and then quickly stops again—from one position to the next as field windings are energized and de-energized in sequence. Depending on the sequence, the rotor may turn forwards or backwards, and it may change direction, stop, speed up or slow down arbitrarily at any time.\n\nInstruction:\n\nWhat types of velocities and positions is the stepper motor capable of?Answer:\n\nforwards or backwards, and it may change direction, stop, speed up or slow down\n\n",
    "Context:\n\nIn November 2013 MGM and the McClory estate formally settled the issue with Danjaq, LLC—sister company of Eon Productions—with MGM acquiring the full copyright film rights to the concept of Spectre and all of the characters associated with it. With the acquisition of the film rights and the organisation's re-introduction to the series' continuity, the SPECTRE acronym was discarded and the organisation reimagined as \"Spectre\".\n\nInstruction:\n\nWhat is the name of the LLC sister company of Eon Productions?Answer:\n\nDanjaq\n\n",
    "Context:\n\nThe first extant Estonian book is a bilingual German-Estonian translation of the Lutheran catechism by S. Wanradt and J. Koell dating to 1535, during the Protestant Reformation period. An Estonian grammar book to be used by priests was printed in German in 1637. The New Testament was translated into southern Estonian in 1686 (northern Estonian, 1715). The two languages were united based on northern Estonian by Anton thor Helle.\n\nInstruction:\n\nWhat year was the priests' grammar book put into print?Answer:\n\n1637\n\n",
    "Context:\n\nThe definition of symbiosis has varied among scientists. Some believe symbiosis should only refer to persistent mutualisms, while others believe it should apply to any type of persistent biological interaction (in other words mutualistic, commensalistic, or parasitic). After 130 years of debate, current biology and ecology textbooks now use the latter \"de Bary\" definition or an even broader definition (where symbiosis means all species interactions), with the restrictive definition no longer used (in other words, symbiosis means mutualism).\n\nInstruction:\n\nHow long did it take for scientists to stop using the narrow definition of symbiosis?Answer:\n\n130 years\n\n",
    "Context:\n\nIn conjunction with the system of months there is a system of weeks. A physical or electronic calendar provides conversion from a given date to the weekday, and shows multiple dates for a given weekday and month. Calculating the day of the week is not very simple, because of the irregularities in the Gregorian system. When the Gregorian calendar was adopted by each country, the weekly cycle continued uninterrupted. For example, in the case of the few countries that adopted the reformed calendar on the date proposed by Gregory XIII for the calendar's adoption, Friday, 15 October 1582, the preceding date was Thursday, 4 October 1582 (Julian calendar).\n\nInstruction:\n\nWhat is simple to do using the Gregorian system?Answer:\n\nN/A\n\n",
    "Context:\n\nInfection begins when an organism successfully enters the body, grows and multiplies. This is referred to as colonization. Most humans are not easily infected. Those who are weak, sick, malnourished, have cancer or are diabetic have increased susceptibility to chronic or persistent infections. Individuals who have a suppressed immune system are particularly susceptible to opportunistic infections. Entrance to the host at host-pathogen interface, generally occurs through the mucosa in orifices like the oral cavity, nose, eyes, genitalia, anus, or the microbe can enter through open wounds. While a few organisms can grow at the initial site of entry, many migrate and cause systemic infection in different organs. Some pathogens grow within the host cells (intracellular) whereas others grow freely in bodily fluids.\n\nInstruction:\n\nWhat group is not easily infected?Answer:\n\nhumans\n\n",
    "Context:\n\nReferred to as \"Hyderabadi\", the residents of Hyderabad are predominantly Telugu and Urdu speaking people, with minority Bengali, Gujarati (including Memon), Kannada (including Nawayathi), Malayalam, Marathi, Marwari, Odia, Punjabi, Tamil and Uttar Pradeshi communities. Hyderabad is home to a unique dialect of Urdu called Hyderabadi Urdu, which is a type of Dakhini, and is the mother tongue of most Hyderabadi Muslims, a unique community who owe much of their history, language, cuisine, and culture to Hyderabad, and the various dynasties who previously ruled. Hadhrami Arabs, African Arabs, Armenians, Abyssinians, Iranians, Pathans and Turkish people are also present; these communities, of which the Hadhrami are the largest, declined after Hyderabad State became part of the Indian Union, as they lost the patronage of the Nizams.\n\nInstruction:\n\nHyderabadi is a type of what langauge?Answer:\n\nDakhini\n\n",
    "Context:\n\nSomalis constitute the largest ethnic group in Somalia, at approximately 85% of the nation's inhabitants. They are traditionally nomads, but since the late 20th century, many have moved to urban areas. While most Somalis can be found in Somalia proper, large numbers also live in Ethiopia, Djibouti, Kenya, Yemen, the Middle East, South Asia and Europe due to their seafaring tradition.\n\nInstruction:\n\nWhat is the biggest ethnic group in Somalia?Answer:\n\nSomalis\n\n",
    "Context:\n\nMurdoch found he had such a rapport with Larry Lamb over lunch that other potential recruits as editor were not interviewed and Lamb was appointed as the first editor of the new Sun. He was scathing in his opinion of the Mirror, where he had recently been employed as a senior sub-editor, and shared Murdoch's view that a paper's quality was best measured by its sales, and he regarded the Mirror as overstaffed, and primarily aimed at an ageing readership. Lamb hastily recruited a staff of about 125 reporters, who were mostly selected for their availability rather than their ability.\n\nInstruction:\n\nWhat position did Larry Lamb take with the Sun?Answer:\n\neditor\n\n",
    "Context:\n\nThe vocabulary (mainly abstract and literary words), principles of word formations, and, to some extent, inflections and literary style of Russian have been also influenced by Church Slavonic, a developed and partly russified form of the South Slavic Old Church Slavonic language used by the Russian Orthodox Church. However, the East Slavic forms have tended to be used exclusively in the various dialects that are experiencing a rapid decline. In some cases, both the East Slavic and the Church Slavonic forms are in use, with many different meanings. For details, see Russian phonology and History of the Russian language.\n\nInstruction:\n\nWhat language does the Russian Orthodox Church use?Answer:\n\nSouth Slavic Old Church Slavonic\n\n",
    "Context:\n\nLater chapters provide evidence that evolution has occurred, supporting the idea of branching, adaptive evolution without directly proving that selection is the mechanism. Darwin presents supporting facts drawn from many disciplines, showing that his theory could explain a myriad of observations from many fields of natural history that were inexplicable under the alternate concept that species had been individually created. The structure of Darwin's argument showed the influence of John Herschel, whose philosophy of science maintained that a mechanism could be called a vera causa (true cause) if three things could be demonstrated: its existence in nature, its ability to produce the effects of interest, and its ability to explain a wide range of observations.\n\nInstruction:\n\nWhat does Darwin do to show that his theory can support many theories that could not be explained by individual creation of species?Answer:\n\nDarwin presents supporting facts drawn from many disciplines\n\n",
    "Context:\n\nThe Jawa Dwipa Hindu kingdom in Java and Sumatra existed around 200 BCE. The history of the Malay-speaking world began with the advent of Indian influence, which dates back to at least the 3rd century BCE. Indian traders came to the archipelago both for its abundant forest and maritime products and to trade with merchants from China, who also discovered the Malay world at an early date. Both Hinduism and Buddhism were well established in the Malay Peninsula by the beginning of the 1st century CE, and from there spread across the archipelago.\n\nInstruction:\n\nWhich religions were well established in the Malay peninsula by the beginning of the 1st century CE?Answer:\n\nHinduism and Buddhism\n\n",
    "Context:\n\nSmith's first Macintosh board was built to Raskin's design specifications: it had 64 kilobytes (kB) of RAM, used the Motorola 6809E microprocessor, and was capable of supporting a 256×256-pixel black-and-white bitmap display. Bud Tribble, a member of the Mac team, was interested in running the Apple Lisa's graphical programs on the Macintosh, and asked Smith whether he could incorporate the Lisa's Motorola 68000 microprocessor into the Mac while still keeping the production cost down. By December 1980, Smith had succeeded in designing a board that not only used the 68000, but increased its speed from 5 MHz to 8 MHz; this board also had the capacity to support a 384×256-pixel display. Smith's design used fewer RAM chips than the Lisa, which made production of the board significantly more cost-efficient. The final Mac design was self-contained and had the complete QuickDraw picture language and interpreter in 64 kB of ROM – far more than most other computers; it had 128 kB of RAM, in the form of sixteen 64 kilobit (kb) RAM chips soldered to the logicboard. Though there were no memory slots, its RAM was expandable to 512 kB by means of soldering sixteen IC sockets to accept 256 kb RAM chips in place of the factory-installed chips. The final product's screen was a 9-inch, 512x342 pixel monochrome display, exceeding the size of the planned screen.\n\nInstruction:\n\nWhich design feature did Smith eventually use to make production of a newly designed board less cost-efficient?Answer:\n\nN/A\n\n",
    "Context:\n\nAlpine crystals have been studied and collected for hundreds of years, and began to be classified in the 18th century. Leonhard Euler studied the shapes of crystals, and by the 19th century crystal hunting was common in Alpine regions. David Friedrich Wiser amassed a collection of 8000 crystals that he studied and documented. In the 20th century Robert Parker wrote a well-known work about the rock crystals of the Swiss Alps; at the same period a commission was established to control and standardize the naming of Alpine minerals.\n\nInstruction:\n\nWho studied the shapes of crystals? Answer:\n\nLeonhard Euler\n\n",
    "Context:\n\nSunni Islam of the Hanafi school has been officially recognized by the government since 2009. Tajikistan considers itself a secular state with a Constitution providing for freedom of religion. The Government has declared two Islamic holidays, Id Al-Fitr and Idi Qurbon, as state holidays. According to a U.S. State Department release and Pew research group, the population of Tajikistan is 98% Muslim. Approximately 87%–95% of them are Sunni and roughly 3% are Shia and roughly 7% are non-denominational Muslims. The remaining 2% of the population are followers of Russian Orthodoxy, Protestantism, Zoroastrianism and Buddhism. A great majority of Muslims fast during Ramadan, although only about one third in the countryside and 10% in the cities observe daily prayer and dietary restrictions.\n\nInstruction:\n\nWhat school has been recognized by the government?Answer:\n\nSunni Islam of the Hanafi\n\n",
    "Context:\n\nAtticus does not want Jem and Scout to be present at Tom Robinson's trial. No seat is available on the main floor, so by invitation of Rev. Sykes, Jem, Scout, and Dill watch from the colored balcony. Atticus establishes that the accusers—Mayella and her father, Bob Ewell, the town drunk—are lying. It also becomes clear that the friendless Mayella made sexual advances toward Tom, and that her father caught her and beat her. Despite significant evidence of Tom's innocence, the jury convicts him. Jem's faith in justice becomes badly shaken, as is Atticus', when the hapless Tom is shot and killed while trying to escape from prison.\n\nInstruction:\n\nWhat happens to Tom when he attempts to escape prison?Answer:\n\nshot and killed\n\n",
    "Context:\n\nAt the 57th Annual Grammy Awards in February 2015, Beyoncé was nominated for six awards, ultimately winning three: Best R&B Performance and Best R&B Song for \"Drunk in Love\", and Best Surround Sound Album for Beyoncé. She was nominated for Album of the Year but the award was won by Beck for his Morning Phase album. In August, the cover of the September issue of Vogue magazine was unveiled online, Beyoncé as the cover star, becoming the first African-American artist and third African-American woman in general to cover the September issue. She headlined the 2015 Made in America festival in early September and also the Global Citizen Festival later that month. Beyoncé made an uncredited featured appearance on the track \"Hymn for the Weekend\" by British rock band Coldplay, on their seventh studio album A Head Full of Dreams (2015), which saw release in December. On January 7, 2016, Pepsi announced Beyoncé would perform alongside Coldplay at Super Bowl 50 in February. Knowles has previously performed at four Super Bowl shows throughout her career, serving as the main headliner of the 47th Super Bowl halftime show in 2013.\n\nInstruction:\n\nBeyoncé lost the Album of the Year award to which entertainer?Answer:\n\nBeck\n\n",
    "Context:\n\nNon-revolutionary civil disobedience is a simple disobedience of laws on the grounds that they are judged \"wrong\" by an individual conscience, or as part of an effort to render certain laws ineffective, to cause their repeal, or to exert pressure to get one's political wishes on some other issue. Revolutionary civil disobedience is more of an active attempt to overthrow a government (or to change cultural traditions, social customs, religious beliefs, etc...revolution doesn't have to be political, i.e. \"cultural revolution\", it simply implies sweeping and widespread change to a section of the social fabric). Gandhi's acts have been described as revolutionary civil disobedience. It has been claimed that the Hungarians under Ferenc Deák directed revolutionary civil disobedience against the Austrian government. Thoreau also wrote of civil disobedience accomplishing \"peaceable revolution.\" Howard Zinn, Harvey Wheeler, and others have identified the right espoused in The Declaration of Independence to \"alter or abolish\" an unjust government to be a principle of civil disobedience. \n\nInstruction:\n\nRevolutionary civil disobedience towards culture is highlighted by example of who? Answer:\n\nGandhi's\n\n",
    "Context:\n\n Among the vast varieties of microorganisms, relatively few cause disease in otherwise healthy individuals. Infectious disease results from the interplay between those few pathogens and the defenses of the hosts they infect. The appearance and severity of disease resulting from any pathogen, depends upon the ability of that pathogen to damage the host as well as the ability of the host to resist the pathogen. However a host's immune system can also cause damage to the host itself in an attempt to control the infection. Clinicians therefore classify infectious microorganisms or microbes according to the status of host defenses - either as primary pathogens or as opportunistic pathogens:\n\nInstruction:\n\nWhat is prevented by interplay between pathogens and attacks of hosts?Answer:\n\nN/A\n\n",
    "Context:\n\nThe BBC also introduced Ceefax, the first teletext service, starting in 1974. This service allows BBC viewers to view textual information such as the latest news on their television. CEEFAX has not made a full transition to digital television, instead being replaced by the new interactive BBCi service.\n\nInstruction:\n\nWhat is the modern replacement for Ceefax?Answer:\n\nBBCi\n\n",
    "Context:\n\nThe Slavic autonym is reconstructed in Proto-Slavic as *Slověninъ, plural *Slověne. The oldest documents written in Old Church Slavonic and dating from the 9th century attest Словѣне Slověne to describe the Slavs. Other early Slavic attestations include Old East Slavic Словѣнѣ Slověně for \"an East Slavic group near Novgorod.\" However, the earliest written references to the Slavs under this name are in other languages. In the 6th century AD Procopius, writing in Byzantine Greek, refers to the Σκλάβοι Sklaboi, Σκλαβηνοί Sklabēnoi, Σκλαυηνοί Sklauenoi, Σθλαβηνοί Sthlabenoi, or Σκλαβῖνοι Sklabinoi, while his contemporary Jordanes refers to the Sclaveni in Latin.\n\nInstruction:\n\nProcopius' contemporary Jordanes referred to the Slavs in what language?Answer:\n\nLatin\n\n",
    "Context:\n\nIn February 2014, Bloomberg reported that Microsoft would be lowering the price of Windows 8 licenses by 70% for devices that retail under US$250; alongside the announcement that an update to the operating system would allow OEMs to produce devices with as little as 1 GB of RAM and 16 GB of storage, critics felt that these changes would help Windows compete against Linux-based devices in the low-end market, particularly those running Chrome OS. Microsoft had similarly cut the price of Windows XP licenses to compete against the early waves of Linux-based netbooks. Reports also indicated that Microsoft was planning to offer cheaper Windows 8 licenses to OEMs in exchange for setting Internet Explorer's default search engine to Bing. Some media outlets falsely reported that the SKU associated with this plan, \"Windows 8.1 with Bing\", was a variant which would be a free or low-cost version of Windows 8 for consumers using older versions of Windows. On April 2, 2014, Microsoft ultimately announced that it would be removing license fees entirely for devices with screens smaller than 9 inches, and officially confirmed the rumored \"Windows 8.1 with Bing\" OEM SKU on May 23, 2014.\n\nInstruction:\n\nWhen did Windows 8 decrease the price of Windows 8 for devices that cost less than $250?Answer:\n\nFebruary 2014\n\n",
    "Context:\n\nPreaspirated stops also occur in most Sami languages; for example, in North Sami, the unvoiced stop and affricate phonemes /p/, /t/, /ts/, /tʃ/, /k/ are pronounced preaspirated ([ʰp], [ʰt] [ʰts], [ʰtʃ], [ʰk]) when they occur in medial or final position.\n\nInstruction:\n\nThe Sami tongue also has what?Answer:\n\nPreaspirated stops\n\n",
    "Context:\n\nIn total, 156 prisoners have been either acquitted, or received pardons or commutations on the basis of possible innocence, between 1973 to 2015. Death penalty opponents often argue that this statistic shows how perilously close states have come to undertaking wrongful executions; proponents point out that the statistic refers only to those exonerated in law, and that the truly innocent may be a smaller number. Statistics likely understate the actual problem of wrongful convictions because once an execution has occurred there is often insufficient motivation and finance to keep a case open, and it becomes unlikely at that point that the miscarriage of justice will ever be exposed.\n\nInstruction:\n\nBetween 1973 and 2015, how amny prisoners were acquitted or received pardons or commutations of their death sentences due to possible innocence?Answer:\n\n156\n\n",
    "Context:\n\nThe study of genocide has mainly been focused towards the legal aspect of the term. By formally recognizing the act of genocide as a crime, involves the undergoing prosecution that begins with not only seeing genocide as outrageous past any moral standpoint but also may be a legal liability within international relations. When genocide is looked at in a general aspect it is viewed as the deliberate killing of a certain group. Yet is commonly seen to escape the process of trial and prosecution due to the fact that genocide is more often than not committed by the officials in power of a state or area. In 1648 before the term genocide had been coined, the Peace of Westphalia was established to protect ethnic, national, racial and in some instances religious groups. During the 19th century humanitarian intervention was needed due to the fact of conflict and justification of some of the actions executed by the military.\n\nInstruction:\n\nWho was the Peace of Westphalia designed to eliminate?Answer:\n\nN/A\n\n",
    "Context:\n\nThe Laurentian Highlands, the Interior Plains and the Interior Highlands lie between the two coasts, stretching from the Gulf of Mexico northward, far beyond the national boundary, to the Arctic Ocean. The central plains are divided by a hardly perceptible height of land into a Canadian and a United States portion. It is from the United States side, that the great Mississippi system discharges southward to the Gulf of Mexico. The upper Mississippi and some of the Ohio basin is the semi-arid prairie region, with trees originally only along the watercourses. The uplands towards the Appalachians were included in the great eastern forested area, while the western part of the plains has so dry a climate that its native plant life is scanty, and in the south it is practically barren.\n\nInstruction:\n\nWhat is the name of the three highlands that stretched from the Gulf of Mexico to the Arctic Ocean?Answer:\n\nN/A\n\n",
    "Context:\n\nTeeth (singular tooth) are small whitish structures found in the jaws (or mouths) of many vertebrates that are used to tear, scrape, milk and chew food. Teeth are not made of bone, but rather of tissues of varying density and hardness, such as enamel, dentine and cementum. Human teeth have a blood and nerve supply which enables proprioception. This is the ability of sensation when chewing, for example if we were to bite into something too hard for our teeth, such as a chipped plate mixed in food, our teeth send a message to our brain and we realise that it cannot be chewed, so we stop trying.\n\nInstruction:\n\nWhere are teeth found?Answer:\n\nin the jaws (or mouths)\n\n",
    "Context:\n\nThuringia became a landgraviate in 1130 AD. After the extinction of the reigning Ludowingian line of counts and landgraves in 1247 and the War of the Thuringian Succession (1247–1264), the western half became independent under the name of \"Hesse\", never to become a part of Thuringia again. Most of the remaining Thuringia came under the rule of the Wettin dynasty of the nearby Margraviate of Meissen, the nucleus of the later Electorate and Kingdom of Saxony. With the division of the house of Wettin in 1485, Thuringia went to the senior Ernestine branch of the family, which subsequently subdivided the area into a number of smaller states, according to the Saxon tradition of dividing inheritance amongst male heirs. These were the \"Saxon duchies\", consisting, among others, of the states of Saxe-Weimar, Saxe-Eisenach, Saxe-Jena, Saxe-Meiningen, Saxe-Altenburg, Saxe-Coburg, and Saxe-Gotha; Thuringia became merely a geographical concept.\n\nInstruction:\n\nWhen did Thuringia lose status as a landgraviate?Answer:\n\nN/A\n\n",
    "Context:\n\nOn 24 March 2009, the Nigerian Federal Ministry of Science and Technology, NigComSat Ltd. and CGWIC signed another contract for the in-orbit delivery of the NigComSat-1R satellite. NigComSat-1R was also a DFH-4 satellite, and the replacement for the failed NigComSat-1 was successfully launched into orbit by China in Xichang on December 19, 2011. The satellite according to then-Nigerian President Goodluck Jonathan which was paid for by the insurance policy on NigComSat-1 which de-orbited in 2009, would have a positive impact on national development in various sectors such as communications, internet services, health, agriculture, environmental protection and national security.\n\nInstruction:\n\nWhen was Nigeria's fourth satellite launched?Answer:\n\nDecember 19, 2011\n\n",
    "Context:\n\nPortugal has considerable resources of wind and river power, the two most cost-effective renewable sources. Since the turn of the 21st century, there has been a trend towards the development of a renewable resource industry and reduction of both consumption and use of fossil fuel resources. In 2006, the world's largest solar power plant at that date, the Moura Photovoltaic Power Station, began operating near Moura, in the south, while the world's first commercial wave power farm, the Aguçadoura Wave Farm, opened in the Norte region (2008). By the end of 2006, 66% of the country's electrical production was from coal and fuel power plants, while 29% were derived from hydroelectric dams, and 6% by wind energy.\n\nInstruction:\n\nWhere was Moura Photovoltaic Power Station located?Answer:\n\nMoura, in the south\n\n",
    "Context:\n\nThe loss of viewers continued into season 12, which saw the show hitting a number of series low in the 18-49 demo. The finale had 7.2 million fewer viewers than the previous season, and saw a drop of 44% in the 18-49 demo. The season viewers averaged at 13.3 million, a drop of 24% from the previous season. The thirteenth season suffered a huge decline in the 18–49 demographic, a drop of 28% from the twelfth season, and American Idol lost its Top 10 position in the Nielsen ratings by the end of the 2013–14 television season for the first time since its entry to the rankings in 2003 as a result, although the entire series to date had not yet been dropped from the Nielsen Top 30 rankings since its inception in 2002.\n\nInstruction:\n\nHow many viewers watched on average this season?Answer:\n\n13.3 million\n\n",
    "Context:\n\nHistorically, migration has been recorded as much as 3,000 years ago by Ancient Greek authors including Homer and Aristotle, and in the Book of Job, for species such as storks, turtle doves, and swallows. More recently, Johannes Leche began recording dates of arrivals of spring migrants in Finland in 1749, and scientific studies have used techniques including bird ringing and satellite tracking. Threats to migratory birds have grown with habitat destruction especially of stopover and wintering sites, as well as structures such as power lines and wind farms.\n\nInstruction:\n\nWhich species of birds were recorded 3,000 years ago?Answer:\n\nstorks, turtle doves, and swallows\n\n",
    "Context:\n\nOn 25 May 1963, the pope suffered another haemorrhage and required several blood transfusions, but the cancer had perforated the stomach wall and peritonitis soon set in. The doctors conferred in a decision regarding this matter and John XXIII's aide Loris F. Capovilla broke the news to him saying that the cancer had done its work and nothing could be done for him. Around this time, his remaining siblings arrived to be with him. By 31 May, it had become clear that the cancer had overcome the resistance of John XXIII – it had left him confined to his bed.\n\nInstruction:\n\nWhat had happened to the cancer Loris F. Capovilla was suffering from?Answer:\n\nN/A\n\n",
    "Context:\n\nBetween April 1877 and February 1878, she threatened five times to abdicate while pressuring Disraeli to act against Russia during the Russo-Turkish War, but her threats had no impact on the events or their conclusion with the Congress of Berlin. Disraeli's expansionist foreign policy, which Victoria endorsed, led to conflicts such as the Anglo-Zulu War and the Second Anglo-Afghan War. \"If we are to maintain our position as a first-rate Power\", she wrote, \"we must ... be Prepared for attacks and wars, somewhere or other, CONTINUALLY.\" Victoria saw the expansion of the British Empire as civilising and benign, protecting native peoples from more aggressive powers or cruel rulers: \"It is not in our custom to annexe countries\", she said, \"unless we are obliged & forced to do so.\" To Victoria's dismay, Disraeli lost the 1880 general election, and Gladstone returned as prime minister. When Disraeli died the following year, she was blinded by \"fast falling tears\", and erected a memorial tablet \"placed by his grateful Sovereign and Friend, Victoria R.I.\"\n\nInstruction:\n\nWho won the 1880 general election?Answer:\n\nGladstone\n\n",
    "Context:\n\nSaint-Barthélemy (French: Saint-Barthélemy, French pronunciation: ​[sɛ̃baʁtelemi]), officially the Territorial collectivity of Saint-Barthélemy (French: Collectivité territoriale de Saint-Barthélemy), is an overseas collectivity of France. Often abbreviated to Saint-Barth in French, or St. Barts or St. Barths in English, the indigenous people called the island Ouanalao. St. Barthélemy lies about 35 kilometres (22 mi) southeast of St. Martin and north of St. Kitts. Puerto Rico is 240 kilometres (150 mi) to the west in the Greater Antilles.\n\nInstruction:\n\nWhat is the French abbreviation for Saint-Barthélemy?Answer:\n\nSaint-Barth\n\n",
    "Context:\n\nExcept for the five species of monotremes (egg-laying mammals), all modern mammals give birth to live young. Most mammals, including the six most species-rich orders, belong to the placental group. The three largest orders in numbers, are first Rodentia: mice, rats, porcupines, beavers, capybaras, and other gnawing mammals; then Chiroptera: bats; and then Soricomorpha: shrews, moles and solenodons. The next three orders, depending on the biological classification scheme used, are the Primates including the humans; the Cetartiodactyla including the whales and the even-toed hoofed mammals; and the Carnivora, that is, cats, dogs, weasels, bears, seals, and their relatives.\n\nInstruction:\n\nHow many species of mammals do not have a live birth?Answer:\n\nfive species\n\n",
    "Context:\n\nIn 1958, the Soviet Union developed Тransformator (Russian: Трансформатор, meaning Transformer), the first high-resolution (definition) television system capable of producing an image composed of 1,125 lines of resolution aimed at providing teleconferencing for military command. It was a research project and the system was never deployed by either the military or consumer broadcasting.\n\nInstruction:\n\nIn the end what was the Non-Soviet Union's Transformator system used for?Answer:\n\nN/A\n\n",
    "Context:\n\nBorn in 1926, Harper Lee grew up in the Southern town of Monroeville, Alabama, where she became close friends with soon-to-be famous writer Truman Capote. She attended Huntingdon College in Montgomery (1944–45), and then studied law at the University of Alabama (1945–49). While attending college, she wrote for campus literary magazines: Huntress at Huntingdon and the humor magazine Rammer Jammer at the University of Alabama. At both colleges, she wrote short stories and other works about racial injustice, a rarely mentioned topic on such campuses at the time. In 1950, Lee moved to New York City, where she worked as a reservation clerk for British Overseas Airways Corporation; there, she began writing a collection of essays and short stories about people in Monroeville. Hoping to be published, Lee presented her writing in 1957 to a literary agent recommended by Capote. An editor at J. B. Lippincott , who bought the manuscript, advised her to quit the airline and concentrate on writing. Donations from friends allowed her to write uninterrupted for a year.\n\nInstruction:\n\nWhere did Lee attend law school?Answer:\n\nUniversity of Alabama\n\n",
    "Context:\n\nThe peaceful introduction of Islam in the early medieval era of Somalia's history brought Islamic architectural influences from Arabia and Persia. This had the effect of stimulating a shift in construction from drystone and other related materials to coral stone, sundried bricks, and the widespread use of limestone in Somali architecture. Many of the new architectural designs, such as mosques, were built on the ruins of older structures. This practice would continue over and over again throughout the following centuries.\n\nInstruction:\n\nIn the medieval period, what buildings were notably built atop older ruins?Answer:\n\nmosques\n\n",
    "Context:\n\nThe Permian–Triassic extinction event, which was a prolonged event due to the accumulation of several extinction pulses, ended the dominance of the carnivores among the therapsids. In the early Triassic, all the medium to large land carnivore niches were taken over by archosaurs which, over an extended period of time (35 million years), came to include the crocodylomorphs, the pterosaurs, and the dinosaurs. By the Jurassic, the dinosaurs had come to dominate the large terrestrial herbivore niches as well.\n\nInstruction:\n\nWhy was the Jurassic a prolonged event?Answer:\n\nN/A\n\n",
    "Context:\n\nMost bacteria have a single circular chromosome that can range in size from only 160,000 base pairs in the endosymbiotic bacteria Candidatus Carsonella ruddii, to 12,200,000 base pairs in the soil-dwelling bacteria Sorangium cellulosum. Spirochaetes of the genus Borrelia are a notable exception to this arrangement, with bacteria such as Borrelia burgdorferi, the cause of Lyme disease, containing a single linear chromosome. The genes in bacterial genomes are usually a single continuous stretch of DNA and although several different types of introns do exist in bacteria, these are much rarer than in eukaryotes.\n\nInstruction:\n\nWhat shape is chromosome of bacteria?Answer:\n\ncircular chromosome\n\n",
    "Context:\n\nIn 2014, Turkey was ordered by the European Court of Human Rights to pay well over $100m in compensation to Cyprus for the invasion; Ankara announced that it would ignore the judgment. In 2014, a group of Cypriot refugees and a European parliamentarian, later joined by the Cypriot government, filed a complaint to the International Court of Justice, accusing Turkey of violating the Geneva Conventions by directly or indirectly transferring its civilian population into occupied territory. Over the preceding ten years, civilian transfer by Turkey had \"reached new heights\", in the words of one US ambassador.[f] Other violations of the Geneva and the Hague Conventions—both ratified by Turkey—amount to what archaeologist Sophocles Hadjisavvas called \"the organized destruction of Greek and Christian heritage in the north\". These violations include looting of cultural treasures, deliberate destruction of churches, neglect of works of art, and altering the names of important historical sites, which was condemned by the International Council on Monuments and Sites. Hadjisavvas has asserted that these actions are motivated by a Turkish policy of erasing the Greek presence in Northern Cyprus within a framework of ethnic cleansing, as well as by greed and profit-seeking on the part of the individuals involved.\n\nInstruction:\n\nWho was accused of violating the Geneva Conventions?Answer:\n\nTurkey\n\n",
    "Context:\n\nAs of December 2015[update], Barcelona has won 23 La Liga, 27 Copa del Rey, 11 Supercopa de España, three Copa Eva Duarte[note 2] and two Copa de la Liga trophies, as well as being the record holder for the latter four competitions. They have also won five UEFA Champions League, a record four UEFA Cup Winners' Cup, a shared record five UEFA Super Cup and a record three FIFA Club World Cup trophies. They also won a record three Inter-Cities Fairs Cup trophies, considered the predecessor to the UEFA Cup-Europa League.\n\nInstruction:\n\nWhat is the  number of UEFA Cup Winners' Cup competitions Barcelona has won?Answer:\n\nfour\n\n",
    "Context:\n\nIn other contexts the term does not necessarily have pejorative overtones and may even be complimentary when used, in areas where innovation is welcome, of ideas that are in fundamental disagreement with the status quo in any practice and branch of knowledge. Scientist/author Isaac Asimov considered heresy as an abstraction, Asimov's views are in Forward: The Role of the Heretic. mentioning religious, political, socioeconomic and scientific heresies. He divided scientific heretics into endoheretics (those from within the scientific community) and exoheretics (those from without). Characteristics were ascribed to both and examples of both kinds were offered. Asimov concluded that science orthodoxy defends itself well against endoheretics (by control of science education, grants and publication as examples), but is nearly powerless against exoheretics. He acknowledged by examples that heresy has repeatedly become orthodoxy.\n\nInstruction:\n\nWho did not believe in heresy?Answer:\n\nN/A\n\n",
    "Context:\n\nConfer With the White House. If his or her party controls the White House, the minority leader confers regularly with the President and his aides about issues before Congress, the Administration's agenda, and political events generally. Strategically, the role of the minority leader will vary depending on whether the President is of the same party or the other party. In general, minority leaders will often work to advance the goals and aspirations of their party's President in Congress. When Robert Michel, R-IL, was minority leader (1981–1995), he typically functioned as the \"point man\" for Republican presidents. President Ronald Reagan's 1981 policy successes in the Democratic controlled House was due in no small measure to Minority Leader Michel's effectiveness in wooing so-called \"Reagan Democrats\" to support, for instance, the Administration's landmark budget reconciliation bill. There are occasions, of course, when minority leaders will fault the legislative initiatives of their President. On an administration proposal that could adversely affect his district, Michel stated that he might \"abdicate my leadership role [on this issue] since I can't harmonize my own views with the administration's.\" Minority Leader Gephardt, as another example, has publicly opposed a number of President Clinton's legislative initiatives from \"fast track\" trade authority to various budget issues.\n\nInstruction:\n\nWhat did Gephardt function as for Republican presidents?Answer:\n\nN/A\n\n",
    "Context:\n\nSky UK Limited (formerly British Sky Broadcasting or BSkyB) is a British telecommunications company which serves the United Kingdom. Sky provides television and broadband internet services and fixed line telephone services to consumers and businesses in the United Kingdom. It is the UK's largest pay-TV broadcaster with 11 million customers as of 2015. It was the UK's most popular digital TV service until it was overtaken by Freeview in April 2007. Its corporate headquarters are based in Isleworth.\n\nInstruction:\n\nSky UK Limited is formerly known by what name?Answer:\n\nBSkyB\n\n",
    "Context:\n\nIn 1977, Gaddafi dissolved the Republic and created a new socialist state, the Jamahiriya (\"state of the masses\"). Officially adopting a symbolic role in governance, he retained power as military commander-in-chief and head of the Revolutionary Committees responsible for policing and suppressing opponents. Overseeing unsuccessful border conflicts with Egypt and Chad, Gaddafi's support for foreign militants and alleged responsibility for the Lockerbie bombing led to Libya's label of \"international pariah\". A particularly hostile relationship developed with the United States and United Kingdom, resulting in the 1986 U.S. bombing of Libya and United Nations-imposed economic sanctions. Rejecting his earlier ideological commitments, from 1999 Gaddafi encouraged economic privatization and sought rapprochement with Western nations, also embracing Pan-Africanism and helping to establish the African Union. Amid the Arab Spring, in 2011 an anti-Gaddafist uprising led by the National Transitional Council (NTC) broke out, resulting in the Libyan Civil War. NATO intervened militarily on the side of the NTC, bringing about the government's downfall. Retreating to Sirte, Gaddafi was captured and killed by NTC militants.\n\nInstruction:\n\nHow did the world respond to Libya in 1986?Answer:\n\nU.S. bombing of Libya and United Nations-imposed economic sanctions.\n\n",
    "Context:\n\nFrom 1990 to 2005, Manuel Fraga, former minister and ambassador in the Franco dictature, presided over the Galician autonomous government, the Xunta de Galicia. Fraga was associated with the Partido Popular ('People's Party', Spain's main national conservative party) since its founding. In 2002, when the oil tanker Prestige sank and covered the Galician coast in oil, Fraga was accused by the grassroots movement Nunca Mais (\"Never again\") of having been unwilling to react. In the 2005 Galician elections, the 'People's Party' lost its absolute majority, though remaining (barely) the largest party in the parliament, with 43% of the total votes. As a result, power passed to a coalition of the Partido dos Socialistas de Galicia (PSdeG) ('Galician Socialists' Party'), a federal sister-party of Spain's main social-democratic party, the Partido Socialista Obrero Español (PSOE, 'Spanish Socialist Workers Party') and the nationalist Bloque Nacionalista Galego (BNG). As the senior partner in the new coalition, the PSdeG nominated its leader, Emilio Perez Touriño, to serve as Galicia's new president, with Anxo Quintana, the leader of BNG, as its vice president.\n\nInstruction:\n\nThe sinking of which oil tanker precipitated the downfall of that party's rule?Answer:\n\nPrestige\n\n",
    "Context:\n\nDuring World War II, the British destroyed the major government buildings, oil wells and mines for tungsten, tin, lead and silver to keep them from the Japanese. Myanmar was bombed extensively by both sides. After independence, the country was in ruins with its major infrastructure completely destroyed. After a parliamentary government was formed in 1948, Prime Minister U Nu embarked upon a policy of nationalisation and the state was declared the owner of all land. The government also tried to implement a poorly considered Eight-Year plan. By the 1950s, rice exports had fallen by two thirds and mineral exports by over 96% (as compared to the pre-World War II period). Plans were partly financed by printing money, which led to inflation.\n\nInstruction:\n\nWhen was Myanmar given sovereignty to rule it's own nation ?Answer:\n\n1948, Prime Minister U Nu embarked upon a policy of nationalisation and the state was declared the owner of all land.\n\n",
    "Context:\n\nA Christian ( pronunciation (help·info)) is a person who adheres to Christianity, an Abrahamic, monotheistic religion based on the life and teachings of Jesus Christ. \"Christian\" derives from the Koine Greek word Christós (Χριστός), a translation of the Biblical Hebrew term mashiach.\n\nInstruction:\n\nWhich word does Christos derive from?Answer:\n\nN/A\n\n",
    "Context:\n\nThe first attempts to use standard-frequency single-phase AC were made in Hungary as far back as 1923, by the Hungarian Kálmán Kandó on the line between Budapest-Nyugati and Alag, using 16 kV at 50 Hz. The locomotives carried a four-pole rotating phase converter feeding a single traction motor of the polyphase induction type at 600 to 1,100 V. The number of poles on the 2,500 hp motor could be changed using slip rings to run at one of four synchronous speeds. The tests were a success so, from 1932 until the 1960s, trains on the Budapest-Hegyeshalom line (towards Vienna) regularly used the same system. A few decades after the Second World War, the 16 kV was changed to the Russian and later French 25 kV system.\n\nInstruction:\n\nThe locomotives carrying a three-pole rotating phase converter could feed what?Answer:\n\nN/A\n\n",
    "Context:\n\nThe Finnish and Baltic invasions began a deterioration of relations between the Soviets and Germany. Stalin's invasions were a severe irritant to Berlin, as the intent to accomplish these was not communicated to the Germans beforehand, and prompted concern that Stalin was seeking to form an anti-German bloc. Molotov's reassurances to the Germans, and the Germans' mistrust, intensified. On June 16, as the Soviets invaded Lithuania, but before they had invaded Latvia and Estonia, Ribbentrop instructed his staff \"to submit a report as soon as possible as to whether in the Baltic States a tendency to seek support from the Reich can be observed or whether an attempt was made to form a bloc.\"\n\nInstruction:\n\nWhat brought trust between the German and Soviet governments?Answer:\n\nN/A\n\n",
    "Context:\n\nEgypt recognises only three religions: Islam, Christianity, and Judaism. Other faiths and minority Muslim sects practised by Egyptians, such as the small Bahá'í and Ahmadi community, are not recognised by the state and face persecution since they are labelled as far right groups that threaten Egypt's national security. Individuals, particularly Baha'is and atheists, wishing to include their religion (or lack thereof) on their mandatory state issued identification cards are denied this ability (see Egyptian identification card controversy), and are put in the position of either not obtaining required identification or lying about their faith. A 2008 court ruling allowed members of unrecognised faiths to obtain identification and leave the religion field blank.\n\nInstruction:\n\nUntil what year did some minorities need to lie about religion or not get mandatory state issued ID?Answer:\n\n2008\n\n",
    "Context:\n\nGarry Trudeau, creator of the political Doonesbury comic strip, attended Yale University. There he met fellow student and later Green Party candidate for Congress Charles Pillsbury, a long-time New Haven resident for whom Trudeau's comic strip is named. During his college years, Pillsbury was known by the nickname \"The Doones\". A theory of international law, which argues for a sociological normative approach in regards to jurisprudence, is named the New Haven Approach, after the city. Connecticut US senator Richard Blumenthal is a Yale graduate, as is former Connecticut US Senator Joe Lieberman who also was a New Haven resident for many years, before moving back to his hometown of Stamford.\n\nInstruction:\n\nWhat was the Charles Pillsbury's nickname during college?Answer:\n\n\"The Doones\"\n\n",
    "Context:\n\nTerrestrial annelids can be invasive in some situations. In the glaciated areas of North America, for example, almost all native earthworms are thought to have been killed by the glaciers and the worms currently found in those areas are all introduced from other areas, primarily from Europe, and, more recently, from Asia. Northern hardwood forests are especially negatively impacted by invasive worms through the loss of leaf duff, soil fertility, changes in soil chemistry and the loss of ecological diversity. Especially of concern is Amynthas agrestis and at least one state (Wisconsin) has listed it as a prohibited species.\n\nInstruction:\n\nWhat type of forests can be hurt by invasive worms?Answer:\n\nNorthern hardwood forests\n\n",
    "Context:\n\nHistorically home to the Kumeyaay people, San Diego was the first site visited by Europeans on what is now the West Coast of the United States. Upon landing in San Diego Bay in 1542, Juan Rodríguez Cabrillo claimed the entire area for Spain, forming the basis for the settlement of Alta California 200 years later. The Presidio and Mission San Diego de Alcalá, founded in 1769, formed the first European settlement in what is now California. In 1821, San Diego became part of the newly-independent Mexico, which reformed as the First Mexican Republic two years later. In 1850, it became part of the United States following the Mexican–American War and the admission of California to the union.\n\nInstruction:\n\nWhat native people lived in the San Diego area before the Mexicans arrived?Answer:\n\nN/A\n\n",
    "Context:\n\nA traditional sport played in Tuvalu is kilikiti, which is similar to cricket. A popular sport specific to Tuvalu is Ano, which is played with two round balls of 12 cm (5 in) diameter. Ano is a localised version of volleyball, in which the two hard balls made from pandanus leaves are volleyed at great speed with the team members trying to stop the Ano hitting the ground. Traditional sports in the late 19th century were foot racing, lance throwing, quarterstaff fencing and wrestling, although the Christian missionaries disapproved of these activities.\n\nInstruction:\n\nWhat is the traditional sport on Tuvalu?Answer:\n\nkilikiti\n\n",
    "Context:\n\nIn the 1980s green became the color of a number of new European political parties organized around an agenda of environmentalism. Green was chosen for its association with nature, health, and growth. The largest green party in Europe is Alliance '90/The Greens (German: Bündnis 90/Die Grünen) in Germany, which was formed in 1993 from the merger of the German Green Party, founded in West Germany in 1980, and Alliance 90, founded during the Revolution of 1989–1990 in East Germany. In the 2009 federal elections, the party won 10.7% of the votes and 68 out of 622 seats in the Bundestag.\n\nInstruction:\n\nWhat percentage of the votes did The Greens win in 1993?Answer:\n\nN/A\n\n",
    "Context:\n\nThe multitude of Middle Iranian languages and peoples indicate that great linguistic diversity must have existed among the ancient speakers of Iranian languages. Of that variety of languages/dialects, direct evidence of only two have survived. These are:\n\nInstruction:\n\nHow many of the Middlie Iranian tongues have remained in existence since ancient time?Answer:\n\ntwo\n\n",
    "Context:\n\nAnother who contributed significantly to the spirituality of the order is Albertus Magnus, the only person of the period to be given the appellation \"Great\". His influence on the brotherhood permeated nearly every aspect of Dominican life. Albert was a scientist, philosopher, astrologer, theologian, spiritual writer, ecumenist, and diplomat. Under the auspices of Humbert of Romans, Albert molded the curriculum of studies for all Dominican students, introduced Aristotle to the classroom and probed the work of Neoplatonists, such as Plotinus. Indeed, it was the thirty years of work done by Thomas Aquinas and himself (1245–1274) that allowed for the inclusion of Aristotelian study in the curriculum of Dominican schools.\n\nInstruction:\n\nWho did not greatly help the Dominican Order?Answer:\n\nN/A\n\n",
    "Context:\n\nAAA battalions were also used to help suppress ground targets. Their larger 90 mm M3 gun would prove, as did the eighty-eight, to make an excellent anti-tank gun as well, and was widely used late in the war in this role. Also available to the Americans at the start of the war was the 120 mm M1 gun stratosphere gun, which was the most powerful AA gun with an impressive 60,000 ft (18 km) altitude capability. No 120 M1 was ever fired at an enemy aircraft. The 90 mm and 120 mm guns would continue to be used into the 1950s.\n\nInstruction:\n\nWhat decade were the 90 and 120 millimeter guns used until?Answer:\n\n1950s\n\n",
    "Context:\n\nThe neopositivists subscribed to a notion of philosophy as the conceptual clarification of the methods, insights and discoveries of the sciences. They saw in the logical symbolism elaborated by Frege (1848–1925) and Bertrand Russell (1872–1970) a powerful instrument that could rationally reconstruct all scientific discourse into an ideal, logically perfect, language that would be free of the ambiguities and deformations of natural language. This gave rise to what they saw as metaphysical pseudoproblems and other conceptual confusions. By combining Frege's thesis that all mathematical truths are logical with the early Wittgenstein's idea that all logical truths are mere linguistic tautologies, they arrived at a twofold classification of all propositions: the analytic (a priori) and the synthetic (a posteriori). On this basis, they formulated a strong principle of demarcation between sentences that have sense and those that do not: the so-called verification principle. Any sentence that is not purely logical, or is unverifiable is devoid of meaning. As a result, most metaphysical, ethical, aesthetic and other traditional philosophical problems came to be considered pseudoproblems.\n\nInstruction:\n\nWhen did Wittgenstein die?Answer:\n\nN/A\n\n",
    "Context:\n\nThe Flying Fathers, a Canadian group of Catholic priests, regularly toured North America playing exhibition hockey games for charity. One of the organization's founders, Les Costello, was a onetime NHL player who was ordained as a priest after retiring from professional hockey. Another prominent exhibition hockey team is the Buffalo Sabres Alumni Hockey Team, which is composed almost entirely of retired NHL players, the majority of whom (as the name suggests) played at least a portion of their career for the Buffalo Sabres.\n\nInstruction:\n\nWhat nationality is the Flying Fathers team?Answer:\n\nCanadian\n\n",
    "Context:\n\nIn December 1943, President Roosevelt decided that Eisenhower – not Marshall – would be Supreme Allied Commander in Europe. The following month, he resumed command of ETOUSA and the following month was officially designated as the Supreme Allied Commander of the Allied Expeditionary Force (SHAEF), serving in a dual role until the end of hostilities in Europe in May 1945. He was charged in these positions with planning and carrying out the Allied assault on the coast of Normandy in June 1944 under the code name Operation Overlord, the liberation of Western Europe and the invasion of Germany.\n\nInstruction:\n\nOther than Eisenhower, who was considered for the appointment of Supreme Allied Commander in Europe?Answer:\n\nMarshall\n\n",
    "Context:\n\nHokkien dialects are analytic; in a sentence, the arrangement of words is important to its meaning. A basic sentence follows the subject–verb–object pattern (i.e. a subject is followed by a verb then by an object), though this order is often violated because Hokkien dialects are topic-prominent. Unlike synthetic languages, seldom do words indicate time, gender and plural by inflection. Instead, these concepts are expressed through adverbs, aspect markers, and grammatical particles, or are deduced from the context. Different particles are added to a sentence to further specify its status or intonation.\n\nInstruction:\n\nHow are synthetic languages analytic?Answer:\n\nN/A\n\n",
    "Context:\n\nThe dry lands of Namibia were inhabited since early times by San, Damara, Nama and, since about the 14th century AD, by immigrating Bantu who came with the Bantu expansion from central Africa. From the late 18th century onwards, Orlam clans from the Cape Colony crossed the Orange River and moved into the area that today is southern Namibia. Their encounters with the nomadic Nama tribes were largely peaceful. The missionaries accompanying the Orlams were well received by them, the right to use waterholes and grazing was granted against an annual payment. On their way further northwards, however, the Orlams encountered clans of the Herero tribe at Windhoek, Gobabis, and Okahandja which were less accommodating. The Nama-Herero War broke out in 1880, with hostilities ebbing only when Imperial Germany deployed troops to the contested places and cemented the status quo between Nama, Orlams, and Herero.\n\nInstruction:\n\nWho deployed troops to start the Nama-Herero war?Answer:\n\nImperial Germany\n\n",
    "Context:\n\nInitially the change in strategy caught the RAF off-guard, and caused extensive damage and civilian casualties. Some 107,400 long tons (109,100 t) of shipping was damaged in the Thames Estuary and 1,600 civilians were casualties. Of this total around 400 were killed. The fighting in the air was more intense in daylight. Overall Loge had cost the Luftwaffe 41 aircraft; 14 bombers, 16 Messerschmitt Bf 109s, seven Messerschmitt Bf 110s and four reconnaissance aircraft. Fighter Command lost 23 fighters, with six pilots killed and another seven wounded. Another 247 bombers from Sperrle's Luftflotte 3 (Air Fleet 3) attacked that night. On 8 September, the Luftwaffe returned. This time 412 people were killed and 747 severely wounded.\n\nInstruction:\n\nHow many aircraft did the Luftwaffe lose?Answer:\n\n41\n\n",
    "Context:\n\nWhitehead was unimpressed by this objection. In the notes of one his students for a 1927 class, Whitehead was quoted as saying: \"Every scientific man in order to preserve his reputation has to say he dislikes metaphysics. What he means is he dislikes having his metaphysics criticized.\" In Whitehead's view, scientists and philosophers make metaphysical assumptions about how the universe works all the time, but such assumptions are not easily seen precisely because they remain unexamined and unquestioned. While Whitehead acknowledged that \"philosophers can never hope finally to formulate these metaphysical first principles,\" he argued that people need to continually re-imagine their basic assumptions about how the universe works if philosophy and science are to make any real progress, even if that progress remains permanently asymptotic. For this reason Whitehead regarded metaphysical investigations as essential to both good science and good philosophy.\n\nInstruction:\n\nWhat quotation of Whitehead's was noted by a student in 1927?Answer:\n\n\"Every scientific man in order to preserve his reputation has to say he dislikes metaphysics. What he means is he dislikes having his metaphysics criticized.\"\n\n",
    "Context:\n\nOn January 31, 1958, nearly four months after the launch of Sputnik 1, von Braun and the United States successfully launched its first satellite on a four-stage Juno I rocket derived from the US Army's Redstone missile, at Cape Canaveral. The satellite Explorer 1 was 30.8 pounds (14.0 kg) in mass. It carried a micrometeorite gauge and a Geiger-Müller tube. It passed in and out of the Earth-encompassing radiation belt with its 194-by-1,368-nautical-mile (360 by 2,534 km) orbit, therefore saturating the tube's capacity and proving what Dr. James Van Allen, a space scientist at the University of Iowa, had theorized. The belt, named the Van Allen radiation belt, is a doughnut-shaped zone of high-level radiation intensity around the Earth above the magnetic equator. Van Allen was also the man who designed and built the satellite instrumentation of Explorer 1. The satellite actually measured three phenomena: cosmic ray and radiation levels, the temperature in the spacecraft, and the frequency of collisions with micrometeorites. The satellite had no memory for data storage, therefore it had to transmit continuously. Two months later in March 1958, a second satellite was sent into orbit with augmented cosmic ray instruments.\n\nInstruction:\n\nThe first US satellite to launch without failure was on what date?Answer:\n\nJanuary 31, 1958\n\n",
    "Context:\n\nHenry III rebuilt the abbey in honour of a royal saint, Edward the Confessor, whose relics were placed in a shrine in the sanctuary. Henry III himself was interred nearby, as were many of the Plantagenet kings of England, their wives and other relatives. Until the death of George II of Great Britain in 1760, most kings and queens were buried in the abbey, some notable exceptions being Henry VI, Edward IV, Henry VIII and Charles I who are buried in St George's Chapel at Windsor Castle. Other exceptions include Richard III, now buried at Leicester Cathedral, and the de facto queen Lady Jane Grey, buried in the chapel of St Peter ad Vincula in the Tower of London. Most monarchs and royals who died after 1760 are buried either in St George's Chapel or at Frogmore to the east of Windsor Castle.[citation needed]\n\nInstruction:\n\nHenry II rebuilt the abbey in honour of whom?Answer:\n\nN/A\n\n",
    "Context:\n\nCharleston is the primary medical center for the eastern portion of the state. The city has several major hospitals located in the downtown area: Medical University of South Carolina Medical Center (MUSC), Ralph H. Johnson VA Medical Center, and Roper Hospital. MUSC is the state's first school of medicine, the largest medical university in the state, and the sixth-oldest continually operating school of medicine in the United States. The downtown medical district is experiencing rapid growth of biotechnology and medical research industries coupled with substantial expansions of all the major hospitals. Additionally, more expansions are planned or underway at another major hospital located in the West Ashley portion of the city: Bon Secours-St Francis Xavier Hospital. The Trident Regional Medical Center located in the City of North Charleston and East Cooper Regional Medical Center located in Mount Pleasant also serve the needs of residents of the city of Charleston.\n\nInstruction:\n\nWhat is the state's first school of medicine?Answer:\n\nMedical University of South Carolina Medical Center\n\n",
    "Context:\n\nIn the late 1980s, key breakthroughs in GaN epitaxial growth and p-type doping ushered in the modern era of GaN-based optoelectronic devices. Building upon this foundation, Dr. Moustakas at Boston University patented a method for producing high-brightness blue LEDs using a new two-step process. Two years later, in 1993, high-brightness blue LEDs were demonstrated again by Shuji Nakamura of Nichia Corporation using a gallium nitride growth process similar to Dr. Moustakas's. Both Dr. Moustakas and Mr. Nakamura were issued separate patents, which confused the issue of who was the original inventor (partly because although Dr. Moustakas invented his first, Dr. Nakamura filed first).[citation needed] This new development revolutionized LED lighting, making high-power blue light sources practical, leading to the development of technologies like BlueRay, as well as allowing the bright high resolution screens of modern tablets and phones.[citation needed]\n\nInstruction:\n\nWho first invented a method to produce high-brightness red LEDs?Answer:\n\nN/A\n\n",
    "Context:\n\nThe revived Georgian style that emerged in Britain at the beginning of the 20th century is usually referred to as Neo-Georgian; the work of Edwin Lutyens includes many examples. Versions of the Neo-Georgian style were commonly used in Britain for certain types of urban architecture until the late 1950s, Bradshaw Gass & Hope's Police Headquarters in Salford of 1958 being a good example. In both the United States and Britain, the Georgian style is still employed by architects like Quinlan Terry Julian Bicknell and Fairfax and Sammons for private residences.\n\nInstruction:\n\nWhich architects in the US and Britain still employ the Georgian style for private residences?Answer:\n\nQuinlan Terry Julian Bicknell and Fairfax and Sammons\n\n",
    "Context:\n\nHokkien dialects are analytic; in a sentence, the arrangement of words is important to its meaning. A basic sentence follows the subject–verb–object pattern (i.e. a subject is followed by a verb then by an object), though this order is often violated because Hokkien dialects are topic-prominent. Unlike synthetic languages, seldom do words indicate time, gender and plural by inflection. Instead, these concepts are expressed through adverbs, aspect markers, and grammatical particles, or are deduced from the context. Different particles are added to a sentence to further specify its status or intonation.\n\nInstruction:\n\nBeing topic prominant, what basic sentence pattern is often not used?Answer:\n\nsubject–verb–object\n\n",
    "Context:\n\nDuring the 18th century, systems of plant identification were developed comparable to dichotomous keys, where unidentified plants are placed into taxonomic groups (e.g. family, genus and species) by making a series of choices between pairs of characters. The choice and sequence of the characters may be artificial in keys designed purely for identification (diagnostic keys) or more closely related to the natural or phyletic order of the taxa in synoptic keys. By the 18th century, new plants for study were arriving in Europe in increasing numbers from newly discovered countries and the European colonies worldwide. In 1753 Carl von Linné (Carl Linnaeus) published his Species Plantarum, a hierarchical classification of plant species that remains the reference point for modern botanical nomenclature. This established a standardised binomial or two-part naming scheme where the first name represented the genus and the second identified the species within the genus. For the purposes of identification, Linnaeus's Systema Sexuale classified plants into 24 groups according to the number of their male sexual organs. The 24th group, Cryptogamia, included all plants with concealed reproductive parts, mosses, liverworts, ferns, algae and fungi.\n\nInstruction:\n\nHow are the plants classified?Answer:\n\nnumber of their male sexual organs\n\n",
    "Context:\n\nOn 2 July 2012, GlaxoSmithKline pleaded guilty to criminal charges and agreed to a $3 billion settlement of the largest health-care fraud case in the U.S. and the largest payment by a drug company. The settlement is related to the company's illegal promotion of prescription drugs, its failure to report safety data, bribing doctors, and promoting medicines for uses for which they were not licensed. The drugs involved were Paxil, Wellbutrin, Advair, Lamictal, and Zofran for off-label, non-covered uses. Those and the drugs Imitrex, Lotronex, Flovent, and Valtrex were involved in the kickback scheme.\n\nInstruction:\n\nHow much was the settlement GlaxoSmithKline agree to?Answer:\n\n$3 billion\n\n",
    "Context:\n\nResearch focusing on sexual orientation uses scales of assessment to identify who belongs in which sexual population group. It is assumed that these scales will be able to reliably identify and categorize people by their sexual orientation. However, it is difficult to determine an individual's sexual orientation through scales of assessment, due to ambiguity regarding the definition of sexual orientation. Generally, there are three components of sexual orientation used in assessment. Their definitions and examples of how they may be assessed are as follows:\n\nInstruction:\n\nWhat can cause problems with these scales that are used?Answer:\n\nambiguity regarding the definition of sexual orientation\n\n",
    "Context:\n\nZhejiang consists mostly of hills, which account for about 70% of its total area. Altitudes tend to be the highest to the south and west and the highest peak of the province, Huangmaojian Peak (1,929 meters or 6,329 feet), is located there. Other prominent mountains include Mounts Yandang, Tianmu, Tiantai, and Mogan, which reach altitudes of 700 to 1,500 meters (2,300 to 4,900 ft).\n\nInstruction:\n\nWhat percent of Zhejiang is flat?Answer:\n\nN/A\n\n",
    "Context:\n\nZhejiang consists mostly of hills, which account for about 70% of its total area. Altitudes tend to be the highest to the south and west and the highest peak of the province, Huangmaojian Peak (1,929 meters or 6,329 feet), is located there. Other prominent mountains include Mounts Yandang, Tianmu, Tiantai, and Mogan, which reach altitudes of 700 to 1,500 meters (2,300 to 4,900 ft).\n\nInstruction:\n\n How low is Huangmaojian Peak in meters?Answer:\n\nN/A\n\n",
    "Context:\n\nReligion is extremely important to the Tibetans and has a strong influence over all aspects of their lives. Bön is the ancient religion of Tibet, but has been almost eclipsed by Tibetan Buddhism, a distinctive form of Mahayana and Vajrayana, which was introduced into Tibet from the Sanskrit Buddhist tradition of northern India. Tibetan Buddhism is practiced not only in Tibet but also in Mongolia, parts of northern India, the Buryat Republic, the Tuva Republic, and in the Republic of Kalmykia and some other parts of China. During China's Cultural Revolution, nearly all Tibet's monasteries were ransacked and destroyed by the Red Guards. A few monasteries have begun to rebuild since the 1980s (with limited support from the Chinese government) and greater religious freedom has been granted – although it is still limited. Monks returned to monasteries across Tibet and monastic education resumed even though the number of monks imposed is strictly limited. Before the 1950s, between 10 and 20% of males in Tibet were monks.\n\nInstruction:\n\nHow many males in Tibet were monks in 1950?Answer:\n\nN/A\n\n",
    "Context:\n\nOn 12 January 1938 by Letters Patent the islands were declared a dependency of Saint Helena. Prior to roughly this period, passing ships stopped irregularly at the island for a period of mere hours.\n\nInstruction:\n\nFor how long did Letters Patent stop at the island?Answer:\n\nN/A\n\n",
    "Context:\n\nBroadcasters were faced with having to adapt daily to the varied recording characteristics of many sources: various makers of \"home recordings\" readily available to the public, European recordings, lateral-cut transcriptions, and vertical-cut transcriptions. Efforts were started in 1942 to standardize within the National Association of Broadcasters (NAB), later known as the National Association of Radio and Television Broadcasters (NARTB). The NAB, among other items, issued recording standards in 1949 for laterally and vertically cut records, principally transcriptions. A number of 78 rpm record producers as well as early LP makers also cut their records to the NAB/NARTB lateral standard.\n\nInstruction:\n\nWho made the move to standardize recordings?Answer:\n\nNational Association of Broadcasters\n\n",
    "Context:\n\nReserved matters are subjects that are outside the legislative competence of the Scotland Parliament. The Scottish Parliament is unable to legislate on such issues that are reserved to, and dealt with at, Westminster (and where Ministerial functions usually lie with UK Government ministers). These include abortion, broadcasting policy, civil service, common markets for UK goods and services, constitution, electricity, coal, oil, gas, nuclear energy, defence and national security, drug policy, employment, foreign policy and relations with Europe, most aspects of transport safety and regulation, National Lottery, protection of borders, social security and stability of UK's fiscal, economic and monetary system.\n\nInstruction:\n\nMost aspects of transport safety is a subject dealt with by whom?Answer:\n\nUK Government ministers\n\n",
    "Context:\n\nThe Republic of the Congo also has large untapped base metal, gold, iron and phosphate deposits. The country is a member of the Organization for the Harmonization of Business Law in Africa (OHADA). The Congolese government signed an agreement in 2009 to lease 200,000 hectares of land to South African farmers to reduce its dependence on imports.\n\nInstruction:\n\nHow much land did South Africa lease to the Congo?Answer:\n\nN/A\n\n",
    "Context:\n\nAlthough the European Union does not have a codified constitution, like every political body it has laws which \"constitute\" its basic governance structure. The EU's primary constitutional sources are the Treaty on European Union (TEU) and the Treaty on the Functioning of the European Union (TFEU), which have been agreed or adhered to among the governments of all 28 member states. The Treaties establish the EU's institutions, list their powers and responsibilities, and explain the areas in which the EU can legislate with Directives or Regulations. The European Commission has the initiative to propose legislation. During the ordinary legislative procedure, the Council (which are ministers from member state governments) and the European Parliament (elected by citizens) can make amendments and must give their consent for laws to pass. The Commission oversees departments and various agencies that execute or enforce EU law. The \"European Council\" (rather than the Council, made up of different government Ministers) is composed of the Prime Ministers or executive Presidents of the member states. It appoints the Commissioners and the board of the European Central Bank. The European Court of Justice is the supreme judicial body which interprets EU law, and develops it through precedent. The Court can review the legality of the EU institutions' actions, in compliance with the Treaties. It can also decide upon claims for breach of EU laws from member states and citizens.\n\nInstruction:\n\nWho elects the members of the European Parliament?Answer:\n\ncitizens\n\n",
    "Context:\n\nPollination is the process by which pollen is transferred in the reproduction of plants, thereby enabling fertilisation and sexual reproduction. Most flowering plants require an animal to do the transportation. While other animals are included as pollinators, the majority of pollination is done by insects. Because insects usually receive benefit for the pollination in the form of energy rich nectar it is a grand example of mutualism. The various flower traits (and combinations thereof) that differentially attract one type of pollinator or another are known as pollination syndromes. These arose through complex plant-animal adaptations. Pollinators find flowers through bright colorations, including ultraviolet, and attractant pheromones. The study of pollination by insects is known as anthecology.\n\nInstruction:\n\nWhat do insects receive in return for pollination?Answer:\n\nenergy rich nectar\n\n",
    "Context:\n\nThe legal process to change the definition of the kilogram is already underway, but it had been decided that no final decision would be made before the next meeting of the General Conference on Weights and Measures in 2011. (For more detailed information, see kilogram definitions.) The Planck constant is a leading contender to form the basis of the new definition, although not the only one. Possible new definitions include \"the mass of a body at rest whose equivalent energy equals the energy of photons whose frequencies sum to 7050135639273999999♠135639274×1042 Hz\", or simply \"the kilogram is defined so that the Planck constant equals 6966662606895999999♠6.62606896×10−34 J⋅s\".\n\nInstruction:\n\nWhat is the only thing that can form the basis of the new definition?Answer:\n\nN/A\n\n",
    "Context:\n\nIn Iberia, the Christian states, which had been confined to the north-western part of the peninsula, began to push back against the Islamic states in the south, a period known as the Reconquista. By about 1150, the Christian north had coalesced into the five major kingdoms of León, Castile, Aragon, Navarre, and Portugal. Southern Iberia remained under control of Islamic states, initially under the Caliphate of Córdoba, which broke up in 1031 into a shifting number of petty states known as taifas, who fought with the Christians until the Almohad Caliphate re-established centralised rule over Southern Iberia in the 1170s. Christian forces advanced again in the early 13th century, culminating in the capture of Seville in 1248.\n\nInstruction:\n\nWhat Islamic state controlled southern Iberia until 1031?Answer:\n\nthe Caliphate of Córdoba\n\n",
    "Context:\n\nMost of the Alsatian population is Roman Catholic, but, largely because of the region's German heritage, a significant Protestant community also exists: today, the EPCAAL (a Lutheran church) is France's second largest Protestant church, also forming an administrative union (UEPAL) with the much smaller Calvinist EPRAL. Unlike the rest of France, the Local law in Alsace-Moselle still provides for to the Napoleonic Concordat of 1801 and the organic articles, which provides public subsidies to the Roman Catholic, Lutheran, and Calvinist churches, as well as to Jewish synagogues; religion classes in one of these faiths is compulsory in public schools. This divergence in policy from the French majority is due to the region having been part of Imperial Germany when the 1905 law separating the French church and state was instituted (for a more comprehensive history, see: Alsace-Lorraine). Controversy erupts periodically on the appropriateness of this legal disposition, as well as on the exclusion of other religions from this arrangement.\n\nInstruction:\n\nWhen was the Calvinist EPRAL formed?Answer:\n\nN/A\n\n",
    "Context:\n\nConventionally, a computer consists of at least one processing element, typically a central processing unit (CPU), and some form of memory. The processing element carries out arithmetic and logic operations, and a sequencing and control unit can change the order of operations in response to stored information. Peripheral devices allow information to be retrieved from an external source, and the result of operations saved and retrieved.\n\nInstruction:\n\nWhat are the devices called that are from an external source?Answer:\n\nPeripheral devices\n\n",
    "Context:\n\nThe army's most common vehicle is the High Mobility Multipurpose Wheeled Vehicle (HMMWV), commonly called the Humvee, which is capable of serving as a cargo/troop carrier, weapons platform, and ambulance, among many other roles. While they operate a wide variety of combat support vehicles, one of the most common types centers on the family of HEMTT vehicles. The M1A2 Abrams is the army's main battle tank, while the M2A3 Bradley is the standard infantry fighting vehicle. Other vehicles include the Stryker, and the M113 armored personnel carrier, and multiple types of Mine Resistant Ambush Protected (MRAP) vehicles.\n\nInstruction:\n\nWhat is the HMMWV also known as?Answer:\n\nHumvee\n\n",
    "Context:\n\nTeenage alcohol drug use is currently at an all-time low. Out of a polled body of students, 4.4% of 8th graders reported having been on at least one occasion been drunk within the previous month; for 10th graders, the number was 13.7%, and for 12th graders, 25%. More drastically, cigarette smoking has become a far less prevalent activity among American middle- and high-school students; in fact, a greater number of teens now smoke marijuana than smoke cigarettes, with one recent study showing a respective 15.2% versus 11.7% of surveyed students. Recent studies have shown that male late adolescents are far more likely to smoke cigarettes rather than females. The study indicated that there was a discernible gender difference in the prevalence of smoking among the students. The finding of the study show that more males than females began smoking when they were in primary and high schools whereas most females started smoking after high school. This may be attributed to recent changing social and political views towards marijuana; issues such as medicinal use and legalization have tended towards painting the drug in a more positive light than historically, while cigarettes continue to be vilified due to associated health risks.\n\nInstruction:\n\nAre male or female late adolescents more likely to smoke cigarettes?Answer:\n\nmale\n\n",
    "Context:\n\nAs one of the oldest parts of town, Central Tucson is anchored by the Broadway Village shopping center designed by local architect Josias Joesler at the intersection of Broadway Boulevard and Country Club Road. The 4th Avenue Shopping District between downtown and the University and the Lost Barrio just East of downtown, also have many unique and popular stores. Local retail business in Central Tucson is densely concentrated along Fourth Avenue and the Main Gate Square on University Boulevard near the UA campus. The El Con Mall is also located in the eastern part of midtown.\n\nInstruction:\n\nWhere is the 4th Avenue Shopping District?Answer:\n\nbetween downtown and the University\n\n",
    "Context:\n\nCork was originally a monastic settlement, reputedly founded by Saint Finbarr in the 6th century. Cork achieved an urban character at some point between 915 and 922 when Norseman (Viking) settlers founded a trading port. It has been proposed that, like Dublin, Cork was an important trading centre in the global Scandinavian trade network. The ecclesiastical settlement continued alongside the Viking longphort, with the two developing a type of symbiotic relationship; the Norsemen providing otherwise unobtainable trade goods for the monastery, and perhaps also military aid.\n\nInstruction:\n\nWhen did Viking travelers establish a trading post in Cork?Answer:\n\nsome point between 915 and 922\n\n",
    "Context:\n\nMill's empiricism thus held that knowledge of any kind is not from direct experience but an inductive inference from direct experience. The problems other philosophers have had with Mill's position center around the following issues: Firstly, Mill's formulation encounters difficulty when it describes what direct experience is by differentiating only between actual and possible sensations. This misses some key discussion concerning conditions under which such \"groups of permanent possibilities of sensation\" might exist in the first place. Berkeley put God in that gap; the phenomenalists, including Mill, essentially left the question unanswered. In the end, lacking an acknowledgement of an aspect of \"reality\" that goes beyond mere \"possibilities of sensation\", such a position leads to a version of subjective idealism. Questions of how floor beams continue to support a floor while unobserved, how trees continue to grow while unobserved and untouched by human hands, etc., remain unanswered, and perhaps unanswerable in these terms. Secondly, Mill's formulation leaves open the unsettling possibility that the \"gap-filling entities are purely possibilities and not actualities at all\". Thirdly, Mill's position, by calling mathematics merely another species of inductive inference, misapprehends mathematics. It fails to fully consider the structure and method of mathematical science, the products of which are arrived at through an internally consistent deductive set of procedures which do not, either today or at the time Mill wrote, fall under the agreed meaning of induction.\n\nInstruction:\n\nwhat did Mill realize about mathematics?Answer:\n\nN/A\n\n",
    "Context:\n\nThe 2011 Business Software Alliance Piracy Study Standard, estimates the total commercial value of illegally copied software to be at $59 billion in 2010, with emerging markets accounting for $31.9 billion, over half of the total. Furthermore, mature markets for the first time received less PC shipments than emerging economies in 2010, making emerging markets now responsible for more than half of all computers in use worldwide. In addition with software infringement rates of 68 percent comparing to 24 percent of mature markets, emerging markets thus possess the majority of the global increase in the commercial value of counterfeit software. China continues to have the highest commercial value of such software at $8.9 billion among developing countries and second in the world behind the US at $9.7 billion in 2011. In 2011, the Business Software Alliance announced that 83 percent of software deployed on PCs in Africa has been pirated (excluding South Africa).\n\nInstruction:\n\n What did the established markets receive for the first time?Answer:\n\nless PC shipments than emerging economies\n\n",
    "Context:\n\nThe Chicago Transit Authority's elevated train running through Evanston is called the Purple Line, taking its name from Northwestern's school color. The Foster and Davis stations are within walking distance of the southern end of the campus, while the Noyes station is close to the northern end of the campus. The Central station is close to Ryan Field, Northwestern's football stadium. The Evanston Davis Street Metra station serves the Northwestern campus in downtown Evanston and the Evanston Central Street Metra station is near Ryan Field. Pace Suburban Bus Service and the CTA have several bus routes that run through or near the Evanston campus.\n\nInstruction:\n\nWhat is the name of the Chicago Transit Authority's elevated train through Central?Answer:\n\nN/A\n\n"
]