[
    "Context:\n\nRio de Janeiro is one of the most visited cities in the Southern Hemisphere and is known for its natural settings, carnival, samba, bossa nova, and balneario beaches such as Barra da Tijuca, Copacabana, Ipanema, and Leblon. In addition to the beaches, some of the most famous landmarks include the giant statue of Christ the Redeemer atop Corcovado mountain, named one of the New Seven Wonders of the World; Sugarloaf Mountain with its cable car; the Sambódromo (Sambadrome), a permanent grandstand-lined parade avenue which is used during Carnival; and Maracanã Stadium, one of the world's largest football stadiums. Rio de Janeiro was the host of the 2016 Summer Olympics and the 2016 Summer Paralympics, making the city the first South American and Portuguese-speaking city to ever host the events, and the third time the Olympics were held in a Southern Hemisphere city. The Maracanã Stadium held the finals of the 1950 and 2014 FIFA World Cups, the 2013 FIFA Confederations Cup, and the XV Pan American Games.\n\nInstruction:\n\nWhat is Rio de Janeiro famous for?Answer:\n\nRio de Janeiro is famous for its beaches, rainforest, samba, football stadium (Maracana), carnival and bossa nova music.\n\n",
    "Context:\n\nThe event was established in 1855, and it was originally called the Prix de l'Empereur. It was initially held at the Champ de Mars, and was transferred to Longchamp in 1857. It was cancelled due to the Franco-Prussian War in 1871, and was renamed the Grande Poule des Produits in 1872.\n\nThe race was one of several trials for the Prix du Jockey Club collectively known as the Poules des Produits. The others (listed by their modern titles) were the Prix Daru, the Prix Hocquart, the Prix Noailles and the Prix Greffulhe. Unlike those races, the Grande Poule des Produits had no restrictions based on the nationality of a horse's sire or dam.\n\nThe event was renamed in memory of Auguste Lupin (1807–1895), a successful owner-breeder, in 1896.\n\nThe Prix Lupin was abandoned throughout World War I, with no running from 1915 to 1918. It was cancelled once during World War II, in 1940. It was run at Le Tremblay over 2,150 metres in 1943, and at Maisons-Laffitte in 1944.\n\nThe present system of race grading was introduced in 1971, and the Prix Lupin was classed at Group 1 level.\n\nThe race was last run in 2004. It was discontinued after France Galop restructured its Group 1 programme for three-year-olds in 2005.\n\nInstruction:\n\nWhy did the Prix Lupin not take place from 1915 to 1918?Answer:\n\nDue to the first World War\n\n",
    "Context:\n\nSuccession is an American satirical black comedy-drama television series created by Jesse Armstrong. It premiered on June 3, 2018, on HBO. The series centers on the Roy family, the owners of Waystar RoyCo, a global media and entertainment conglomerate, who are fighting for control of the company amid uncertainty about the health of the family's patriarch, Logan Roy (Brian Cox). The series has been renewed for a fourth and final season, which premiered on March 26, 2023.\n\nInstruction:\n\nWhat is the name of the family at the centre of the TV show Succession?Answer:\n\nSuccession centres on the Roy family, the owners of Waystar RoyCo\n\n",
    "Context:\n\nKyoto is one of the oldest municipalities in Japan, having been chosen in 794 as the new seat of Japan's imperial court by Emperor Kanmu. The original city, named Heian-kyō, was arranged in accordance with traditional Chinese feng shui following the model of the ancient Chinese capitals of Chang'an and Luoyang. The emperors of Japan ruled from Kyoto in the following eleven centuries until 1869. It was the scene of several key events of the Muromachi period, Sengoku period, and the Boshin War, such as the Ōnin War, the Honnō-ji Incident, the Kinmon incident and the Battle of Toba–Fushimi. The capital was relocated from Kyoto to Tokyo after the Meiji Restoration.\n\nInstruction:\n\nWhen was Kyoto the capital of Japan?Answer:\n\nThe emperors of Japan ruled from Kyoto from 794 as the new seat of Japan's imperial court for eleven centuries until 1869.\n\n",
    "Context:\n\nTelangana (/ˌtɛlənˈɡɑːnə/ (listen); Telugu: [ˈtelaŋɡaːɳa], Urdu: [ˈtɪləŋɡɑːna] (listen)) is a state in India situated on the south-central stretch of the Indian peninsula on the high Deccan Plateau. It is the eleventh-largest state and the twelfth-most populated state in India with a geographical area of 112,077 km2 (43,273 sq mi) and 35,193,978 residents as per 2011 census. On 2 June 2014, the area was separated from the northwestern part of Andhra Pradesh as the newly formed state of Telangana, with Hyderabad as its capital. Its other major cities include Warangal, Nizamabad, Khammam, Karimnagar and Ramagundam. Telangana is bordered by the states of Maharashtra to the north, Chhattisgarh to the northeast, Karnataka to the west, and Andhra Pradesh to the east and south. The terrain of Telangana consists mostly of the Deccan Plateau with dense forests covering an area of 27,292 km2 (10,538 sq mi). As of 2019, the state of Telangana is divided into 33 districts.\n\nInstruction:\n\nWhat is the capital of Telangana?Answer:\n\nHyderabad\n\n",
    "Context:\n\nThe New Deal was a series of programs, public work projects, financial reforms, and regulations enacted by President Franklin D. Roosevelt in the United States between 1933 and 1939. Major federal programs and agencies included the Civilian Conservation Corps (CCC), the Works Progress Administration (WPA), the Civil Works Administration (CWA), the Farm Security Administration (FSA), the National Industrial Recovery Act of 1933 (NIRA) and the Social Security Administration (SSA). They provided support for farmers, the unemployed, youth, and the elderly. The New Deal included new constraints and safeguards on the banking industry and efforts to re-inflate the economy after prices had fallen sharply. New Deal programs included both laws passed by Congress as well as presidential executive orders during the first term of the presidency of Franklin D. Roosevelt.\n\nThe programs focused on what historians refer to as the \"3 R's\": relief for the unemployed and for the poor, recovery of the economy back to normal levels, and reform of the financial system to prevent a repeat depression. The New Deal produced a political realignment, making the Democratic Party the majority (as well as the party that held the White House for seven out of the nine presidential terms from 1933 to 1969) with its base in progressive ideas, the South, big city machines and the newly empowered labor unions, and various ethnic groups. The Republicans were split, with progressive Republicans in support but conservatives opposing the entire New Deal as hostile to business and economic growth. The realignment crystallized into the New Deal coalition that dominated presidential elections into the 1960s while the opposing conservative coalition largely controlled Congress in domestic affairs from 1937 to 1964.\n\nInstruction:\n\nGiven the reference text about \"The New Deal\", what are the \"3 R's\" historians refer to about the program.Answer:\n\nThe \"3 R's\" historians refer to are the following:\n- Relief for the unemployed and for the poor\n- Recovery of the economy back to normal levels\n- Reform of the financial system to prevent a repeat depression\n\n",
    "Context:\n\nTypically offered as part of occupational therapy, ASI that places a child in a room specifically designed to stimulate and challenge all of the senses to elicit functional adaptive responses. Occupational Therapy is defined by the American Occupational Therapy Association (AOTA) as \"Occupational therapy practitioners in pediatric settings work with children and their families, caregivers and teachers to promote participation in meaningful activities and occupations\". In childhood, these occupations may include play, school and learning self-care tasks. An entry level Occupational Therapist can provide treatment for sensory processing disorder however, more advanced clinical training exists to target the underlying neuro-biological processes involved. \nSensory integration therapy is driven by four main principles:\nJust right challenge (the child must be able to successfully meet the challenges that are presented through playful activities)\nAdaptive response (the child adapts their behavior with new and useful strategies in response to the challenges presented)\nActive engagement (the child will want to participate because the activities are fun)\nChild directed (the child's preferences are used to initiate therapeutic experiences within the session)\nSerious questions have been raised as to the effectiveness of this therapy particularly in medical journals where the requirements for a treatment to be effective is much higher and developed than it's occupational therapy counter parts which often advocate the effectiveness of the treatment.\n\n\nSensory processing therapy\nThis therapy retains all of the above-mentioned four principles and adds:\nIntensity (person attends therapy daily for a prolonged period of time)\nDevelopmental approach (therapist adapts to the developmental age of the person, against actual age)\nTest-retest systematic evaluation (all clients are evaluated before and after)\nProcess driven vs. activity driven (therapist focuses on the \"just right\" emotional connection and the process that reinforces the relationship)\nParent education (parent education sessions are scheduled into the therapy process)\n\"Joie de vivre\" (happiness of life is therapy's main goal, attained through social participation, self-regulation, and self-esteem)\nCombination of best practice interventions (is often accompanied by integrated listening system therapy, floor time, and electronic media such as Xbox Kinect, Nintendo Wii, Makoto II machine training and others)\nWhile occupational therapists using a sensory integration frame of reference work on increasing a child's ability to adequately process sensory input, other OTs may focus on environmental accommodations that parents and school staff can use to enhance the child's function at home, school, and in the community.These may include selecting soft, tag-free clothing, avoiding fluorescent lighting, and providing ear plugs for \"emergency\" use (such as for fire drills)\nEvaluation of treatment effectiveness\nA 2019 review found sensory integration therapy to be effective for autism spectrum disorder.Another study from 2018 backs up the intervention for children with special needs,Additionally, the American Occupational Therapy Association supports the intervention.\nIn its overall review of the treatment effectiveness literature, Aetna concluded that \"The effectiveness of these therapies is unproven\",while the American Academy of Pediatrics concluded that \"parents should be informed that the amount of research regarding the effectiveness of sensory integration therapy is limited and inconclusive.\"A 2015 review concluded that SIT techniques exist \"outside the bounds of established evidence-based practice\" and that SIT is \"quite possibly a misuse of limited resources.\"\n\nInstruction:\n\nWhat are the available treatments for Sensory processing disorder?Answer:\n\nThe two main treatments available for Sensory processing disorder are Sensory integration therapy and Sensory processing therapy\n\n",
    "Context:\n\nIn India and Pakistan, where it is commonly known as nimbu paani, and in Bangladesh, lemonades may also contain salt and/or ginger juice. Shikanjvi is a traditional lemonade from this region, and can also be flavored with saffron, cumin and other spices.\n\nInstruction:\n\nHow to make Indian Lemonade?Answer:\n\nLemonade is typically made with sugar, lemons and water. The Indian version, commonly known as nimbu paani, is made a bit differently.\n\nIngredients\n- 1 lime's juice\n- 2 teaspoons granulated sugar\n- 1 teaspoons black salt \n- 1 teaspoon cumin powder (optional) \n- Ice (optional and as needed)\n- 1 cup water or sparking water or soda water\n\nMix ingredient together and stir for 10-15 seconds in a glass\n\nSome tips\n- If you don't have granulated sugar, you can use simple syrup\n- You may add some crushed mint leaves\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, what popular neural network architecture architecture are they based on?Answer:\n\nThe Transformer architecture.\n\n",
    "Context:\n\nBlockchains are typically managed by a peer-to-peer (P2P) computer network for use as a public distributed ledger, where nodes collectively adhere to a consensus algorithm protocol to add and validate new transaction blocks. Although blockchain records are not unalterable, since blockchain forks are possible, blockchains may be considered secure by design and exemplify a distributed computing system with high Byzantine fault tolerance. A blockchain was created by a person (or group of people) using the name (or pseudonym) Satoshi Nakamoto in 2008 to serve as the public distributed ledger for bitcoin cryptocurrency transactions, based on previous work by Stuart Haber, W. Scott Stornetta, and Dave Bayer. The implementation of the blockchain within bitcoin made it the first digital currency to solve the double-spending problem without the need of a trusted authority or central server. The bitcoin design has inspired other applications and blockchains that are readable by the public and are widely used by cryptocurrencies. The blockchain may be considered a type of payment rail.\n\nInstruction:\n\nGiven this paragraph about blockchain, how did blockchain influence bitcoin cryptocurrency?Answer:\n\nBlockchain is the technology that enables the existence of cryptocurrency and bitcoin is the name of the best-known cryptocurrency. The implementation of bitcoin using blockchain made it the first digital currency to solve the double-spending problem without the need of a trusted authority or central server. Bitcoin has inspired other applications and blockchains that are highly available, public, and are widely used by cryptocurrencies.\n\n",
    "Context:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. The name may also refer to wines created predominantly from pinot noir grapes. The name is derived from the French words for pine and black. The word pine alludes to the grape variety having tightly clustered, pinecone–shaped bunches of fruit.\n\nInstruction:\n\nWhat does Pinot Noir mean?Answer:\n\nThe name Pinot Noir is derived from the French words for pine and black.\n\n",
    "Context:\n\nKostas Georgakis (Greek: Κώστας Γεωργάκης) (23 August 1948 – 19 September 1970) was a Greek student of geology, who in the early hours of 19 September 1970, set himself ablaze in Matteotti square in Genoa in a fatal protest against the dictatorial regime of Georgios Papadopoulos.\n\nEarly life\nGeorgakis grew up in Corfu in a family of five. His father was a self-employed tailor of modest means. Both his father and grandfather distinguished themselves in the major wars that Greece fought in the 20th century. He attended the second lyceum in Corfu where he excelled in his studies. In August 1967, a few months after the 21 April coup in Greece, Georgakis went to Italy to study as a geologist in Genoa. He received 5,000 drachmas per month from his father and this, according to friends' testimony, made him feel guilty for the financial burden his family endured so that he could attend a university. In Italy he met Rosanna, an Italian girl of the same age and they got engaged. In 1968 Georgakis became a member of the Center Union party of Georgios Papandreou.\n\nInstruction:\n\nGiven a reference text about Kostas Georgakis, when did he go to Italy and what did he do there?Answer:\n\nKostas Georgakis went to Genoa, Italy in 1967 to study geology.\n\n",
    "Context:\n\nConnie Passalacqua Hayman is an American journalist and educator. Passalacqua Hayman has written on a number of topics, but is noted for her reporting and critical analysis of daytime soap operas.\n\nCareer\nPassalacqua Hayman started her soap journalism career in 1980 as an assistant to newspaper columnist Jon-Michael Reed, \"the first soap journalist to review soaps as theater and edit soap magazines for intelligent readers.\" She has since written about the daytime industry for various publications and news organizations, including Newsday, United Features Syndicate, The New York Times, Variety, the New York Daily News, TV Guide and USA Today. She was the editor of Afternoon TV magazine from 1980 to 1983, an editor for Soap Opera World and a contributor for Soap Opera Digest, Soap Opera People and others.\n\nBetween 1995 and 2001, Passalacqua Hayman was an adjunct professor of journalism at New York University, and in 2001 she left writing full-time to earn a master's degree in education at NYU. She taught journalism at Marymount Manhattan College as an adjunct professor in the Communications Department from 2007 to 2014.\n\nInstruction:\n\nGiven a reference text about Connie Passalacqua Hayman, tell me when and where taught journalism.Answer:\n\nConnie Passalacqua Hayman taught journalism at New York University from 1995 to 2001 and at Marymount Manhattan College from 2007 to 2014.\n\n",
    "Context:\n\nThe exact cause of SPD is not known.However, it is known that the midbrain and brainstem regions of the central nervous system are early centers in the processing pathway for multisensory integration; these brain regions are involved in processes including coordination, attention, arousal, and autonomic function. After sensory information passes through these centers, it is then routed to brain regions responsible for emotions, memory, and higher level cognitive functions. Damage in any part of the brain involved in multisensory processing can cause difficulties in adequately processing stimuli in a functional way.\n\nInstruction:\n\nWhat are the causes for Sensory processing disorder?Answer:\n\nThe exact cause of Sensory processing disorder is not known. However, it is known that the midbrain and brainstem regions of the central nervous system are early centers in the processing pathway for multisensory integration; these brain regions are involved in processes including coordination, attention, arousal, and autonomic function. After sensory information passes through these centers, it is then routed to brain regions responsible for emotions, memory, and higher level cognitive functions. Damage in any part of the brain involved in multisensory processing can cause difficulties in adequately processing stimuli in a functional way.\n\n",
    "Context:\n\nReading railway station is a major transport hub in Reading, Berkshire, England. It is on the northern edge of the town centre, near the main retail and commercial areas and the River Thames, 36 miles (58 km) from London Paddington. The first Reading station was opened on 30 March 1840 as the temporary western terminus of the original line of the Great Western Railway (GWR). Reading is the ninth-busiest station in the UK outside London and the second busiest interchange station outside London with over 3.8 million passengers changing trains at the station annually.\n\nInstruction:\n\nWhen was the first Reading railway station opened?Answer:\n\nThe first Reading railway station was opened on the 30th of March, 1840.\n\n",
    "Context:\n\nSouth Korea, officially the Republic of Korea (ROK), is a country in East Asia. It constitutes the southern part of the Korean Peninsula and borders North Korea. The country's western border is formed by the Yellow Sea, while its eastern border is defined by the Sea of Japan. South Korea claims to be the sole legitimate government of the entire peninsula and adjacent islands. It has a population of 51.75 million, of which roughly half live in the Seoul Capital Area, the fourth most populous metropolitan area in the world. Other major cities include Incheon, Busan, and Daegu.\n\nInstruction:\n\nGiven this paragraph about South Korea, which body of water forms the country's western border and which body of water borders it's eastern border?Answer:\n\nThe western border of South Korea is formed by the Yellow Sea, while the eastern border is formed by the Sea of Japan.\n\n",
    "Context:\n\nThe viola (/viˈoʊlə/ vee-OH-lə, also UK: /vaɪˈoʊlə/ vy-OH-lə, Italian: [ˈvjɔːla, viˈɔːla]) is a string instrument that is bowed, plucked, or played with varying techniques. Slightly larger than a violin, it has a lower and deeper sound. Since the 18th century, it has been the middle or alto voice of the violin family, between the violin (which is tuned a perfect fifth above) and the cello (which is tuned an octave below). The strings from low to high are typically tuned to C3, G3, D4, and A4.\n\nInstruction:\n\nWhat is an string instrument that is similar to a Violin, but larger in size and with a lower and deeper sound?Answer:\n\nThe instrument you are looking for is a Viola.\n\n",
    "Context:\n\nCyberpunk 2077 is a 2020 action role-playing video game developed by CD Projekt Red and published by CD Projekt. Set in Night City, an open world set in the Cyberpunk universe, players assume the role of a customisable mercenary known as V, who can acquire skills in hacking and machinery with options for melee and ranged combat. The main story follows V's struggle as they deal with a mysterious cybernetic implant that threatens to overwrite their body with the personality and memories of a deceased celebrity only perceived by V; the two must work together to be separated and save V's life.\n\nInstruction:\n\nWho is the protagonist in CyberPunk 2077?Answer:\n\nThe main story revolves around the protagonist V, as they deal with a mysterious cybernetic implant that threatens to overwrite their body with another person's memories.\n\n",
    "Context:\n\nLysergic acid diethylamide, commonly known as LSD (from German Lysergsäure-diethylamid), also known colloquially as acid, is a potent psychedelic drug. Effects typically include intensified thoughts, emotions, and sensory perception. At sufficiently high dosages LSD manifests primarily mental, visual, as well as auditory, hallucinations. Dilated pupils, increased blood pressure, and increased body temperature are typical. Effects typically begin within half an hour and can last for up to 20 hours. LSD is also capable of causing mystical experiences and ego dissolution. It is used mainly as a recreational drug or for spiritual reasons. LSD is both the prototypical psychedelic and one of the \"classical\" psychedelics, being the psychedelics with the greatest scientific and cultural significance. LSD is typically either swallowed or held under the tongue.\n\nInstruction:\n\nWhat is the colloquial term for LSD?Answer:\n\nLysergic acid diethylamide is commonly known as LSD or acid\n\n",
    "Context:\n\nThe Catholic University of America (CUA) is a private Roman Catholic research university in Washington, D.C. It is a pontifical university of the Catholic Church in the United States and the only institution of higher education founded by U.S. Catholic bishops. Established in 1887 as a graduate and research center following approval by Pope Leo XIII, the university began offering undergraduate education in 1904. It is classified among \"R2: Doctoral Universities – High research activity\".\n\nIts campus is adjacent to the Brookland neighborhood, known as \"Little Rome\", which contains 60 Catholic institutions, including Trinity Washington University, the Dominican House of Studies, and Archbishop Carroll High School, as well as the Basilica of the National Shrine of the Immaculate Conception.\n\nCUA's programs emphasize the liberal arts, professional education, and personal development. The school stays closely connected with the Catholic Church and Catholic organizations. The residential U.S. cardinals put on the American Cardinals Dinner each year to raise scholarship funds. The university also has a long history of working with the Knights of Columbus; its law school and basilica have dedications to the involvement and support of the Knights.\n\nInstruction:\n\nGiven this reference text about the Catholic University of America, tell me when it was established, where it is located, and who founded it.Answer:\n\nThe Catholic University was founded in 1887 by the US Catholic Bishops, and is located in Washington, DC.\n\n",
    "Context:\n\nMultiomics, multi-omics, integrative omics, \"panomics\" or \"pan-omics\" is a biological analysis approach in which the data sets are multiple \"omes\", such as the genome, proteome, transcriptome, epigenome, metabolome, and microbiome (i.e., a meta-genome and/or meta-transcriptome, depending upon how it is sequenced); in other words, the use of multiple omics technologies to study life in a concerted way. By combining these \"omes\", scientists can analyze complex biological big data to find novel associations between biological entities, pinpoint relevant biomarkers and build elaborate markers of disease and physiology. In doing so, multiomics integrates diverse omics data to find a coherently matching geno-pheno-envirotype relationship or association. The OmicTools service lists more than 99 softwares related to multiomic data analysis, as well as more than 99 databases on the topic.\n\nSystems biology approaches are often based upon the use of panomic analysis data. The American Society of Clinical Oncology (ASCO) defines panomics as referring to \"the interaction of all biological functions within a cell and with other body functions, combining data collected by targeted tests ... and global assays (such as genome sequencing) with other patient-specific information.\"\n\nSingle-cell multiomics\nA branch of the field of multiomics is the analysis of multilevel single-cell data, called single-cell multiomics. This approach gives us an unprecedent resolution to look at multilevel transitions in health and disease at the single cell level. An advantage in relation to bulk analysis is to mitigate confounding factors derived from cell to cell variation, allowing the uncovering of heterogeneous tissue architectures.\n\nMethods for parallel single-cell genomic and transcriptomic analysis can be based on simultaneous amplification or physical separation of RNA and genomic DNA. They allow insights that cannot be gathered solely from transcriptomic analysis, as RNA data do not contain non-coding genomic regions and information regarding copy-number variation, for example. An extension of this methodology is the integration of single-cell transcriptomes to single-cell methylomes, combining single-cell bisulfite sequencing to single cell RNA-Seq. Other techniques to query the epigenome, as single-cell ATAC-Seq and single-cell Hi-C also exist.\n\nA different, but related, challenge is the integration of proteomic and transcriptomic data. One approach to perform such measurement is to physically separate single-cell lysates in two, processing half for RNA, and half for proteins. The protein content of lysates can be measured by proximity extension assays (PEA), for example, which use DNA-barcoded antibodies. A different approach uses a combination of heavy-metal RNA probes and protein antibodies to adapt mass cytometry for multiomic analysis.\n\nMultiomics and machine learning\nIn parallel to the advances in highthroughput biology, machine learning applications to biomedical data analysis are flourishing. The integration of multi-omics data analysis and machine learning has led to the discovery of new biomarkers. For example, one of the methods of the mixOmics project implements a method based on sparse Partial Least Squares regression for selection of features (putative biomarkers).\n\n\nhttps://en.wikipedia.org/wiki/Multiomics\n\nInstruction:\n\nGiven these paragraphs about Multiomics, what is single-cell multiomics?Answer:\n\nThe analysis of multilevel single-cell data. This approach gives us an unprecedent resolution to look at multilevel transitions in health and disease at the single cell level.\n\n",
    "Context:\n\nThe Salt River is a formerly navigable hanging channel of the Eel River which flowed about 9 miles (14 km) from near Fortuna and Waddington, California, to the estuary at the Pacific Ocean, until siltation from logging and agricultural practices essentially closed the channel. It was historically an important navigation route until the early 20th century. It now intercepts and drains tributaries from the Wildcat Hills along the south side of the Eel River floodplain. Efforts to restore the river began in 1987, permits and construction began in 2012, and water first flowed in the restored channel in October 2013.\n\nInstruction:\n\nGiven a reference text about the Salt River, tell me how long the river is and where it starts and finishes.Answer:\n\nThe Salt River is about 9 miles long and starts near Fortuna and Waddington California and flows into the Pacific Ocean.\n\n",
    "Context:\n\nHawkeye Creek Bridge is a historic structure located in a rural area northeast of Mediapolis, Iowa, United States. The Des Moines County Board of Supervisors contracted with Clinton Bridge and Iron Works on September 23, 1909, to design and build this bridge. It is an 80-foot (24 m) span that carries traffic of a gravel road over Hawkeye Creek. The structure is a single rigid-connected Pratt through truss that is supported by concrete abutments. It basically remains in an unaltered condition. The bridge was listed on the National Register of Historic Places in 1998.\n\nInstruction:\n\nWhere is the Hawkeye Creek Bridge locatedAnswer:\n\nThe Hawkeye Creek Bridge is a historic structure located in a rural area northeast of Mediapolis, Iowa, United States. The Des Moines County Board of Supervisors contracted with Clinton Bridge and Iron Works on September 23, 1909, to design and build this bridge. \n\nIt is an 80-foot (24 m) span that carries traffic of a gravel road over Hawkeye Creek. The structure is a single rigid-connected Pratt through truss that is supported by concrete abutments. It basically remains in an unaltered condition. The bridge was listed on the National Register of Historic Places in 1998.\n\n",
    "Context:\n\nThomas Edward Patrick Brady Jr. (born August 3, 1977) is a former American football quarterback who played in the National Football League (NFL) for 23 seasons. He spent his first 20 seasons with the New England Patriots and was a central contributor to the franchise's dynasty from 2001 to 2019. In his final three seasons, he was a member of the Tampa Bay Buccaneers. Brady is widely regarded as the greatest quarterback of all time.\n\nInstruction:\n\nGiven a reference text about Tom Brady, tell me when they were born and what they are famous for.Answer:\n\nTom Brady was born on August 3rd, 1977. He is famous for being the greatest quarterback of all time.\n\n",
    "Context:\n\nFree climbing has been called \"rock climbing's most commonly mistaken term\", with problems including:\n\nIncorrectly assuming that \"free climbing\" always means solo climbing, i.e. that you must always be alone and without any partner. Free climbing in traditional climbing and sport climbing uses a supporting belayer.\nIncorrectly assuming that \"free climbing\" always means free soloing, i.e. that you must never use any climbing protection equipment. Free climbing in traditional climbing and sport climbing uses climbing protection (but not to aid progression).\nIncorrectly assuming that \"free climbing\" always means onsighting or flashing, i.e. that you must always climb the route first try. Free climbing in traditional climbing and sport climbing also uses the redpoint as a definition of a first free ascent.\n\nInstruction:\n\nIf it's called \"free\" climbing, why do climbers use gear to climb?Answer:\n\nFree climbing refers to a form of rock climbing in which the climber ascends without the use of gear to aid progression. It is a common misunderstanding that free climbing means climbing with no protective gear. Both sport and traditional climbing make use of protective gear to prevent injury and death, and are both considered free climbing. This is in contrast to free solo climbing, another form of free climbing in which the climber uses no protective gear.\n\n",
    "Context:\n\nHigh-functioning autism (HFA) is an autism classification where a person exhibits no intellectual disability but may show deficits in communication, emotion recognition and expression, and social interaction.HFA is not included in the American Psychological Association's DSM-5 or the World Health Organization's ICD-10, subdividing autism based on intellectual capabilities. High-functioning autism is characterised by features similar to those of Asperger syndrome. The defining characteristic psychologists recognise there is a significant delay in developing early speech and language skills before three years. The diagnostic criteria of Asperger syndrome exclude a general language delay.\n\nOther differences in features of people with high-functioning autism from those with Asperger syndrome include the following:\n\nLower verbal reasoning ability\nBetter visual/spatial skills (Being uniquely artistically talented)\nLess deviating locomotion (e.g. clumsiness)\nProblems functioning independently\nCuriosity and interest in many different things\nNot as good at empathising with other people\nMale to female ratio (4:1) is much smaller\n\nAs of 2013, Asperger syndrome and high-functioning autism are no longer terms the American Psychological Association uses and have been merged into autism spectrum disorder (ASD). As of 2021, the World Health Organization also retired the terms and merged them into autism spectrum disorder.\n\nInstruction:\n\nWhat is High-functioning autism?Answer:\n\nHigh-functioning autism (HFA) is an autism classification where a person exhibits no intellectual disability but may show deficits in communication, emotion recognition and expression, and social interaction. High-functioning autism is characterised by features similar to those of Asperger syndrome. The defining characteristic psychologists recognise there is a significant delay in developing early speech and language skills before three years. The diagnostic criteria of Asperger syndrome exclude a general language delay.\n\n",
    "Context:\n\nIn the first video, Jiang lashed out at Hong Kong journalist Sharon Cheung in Zhongnanhai when he met with Chee-hwa Tung, Chief Executive of Hong Kong at that time. Ms. Cheung asked if Jiang supported Tung's campaign for Chief Executive, which Jiang affirmed. Cheung then asked if it meant the Chinese government had already decided internally to re-appoint Tung. This made Jiang very upset, and criticized her for twisting his words to \"make big news.\" Jiang then continued to criticize the Hong Kong media on the whole, claiming that they need to learn to ask more meaningful questions, even stating that \"Mike Wallace of the US is at a much higher level than you are\", referring to a 2000 interview Jiang gave with 60 Minutes.\nThe second is the famous interview by American journalist Mike Wallace that Jiang referred to in the previous video. In this interview, Wallace and Jiang talked about many touchy subjects, such as democracy and dictatorship in China, freedom of the press, Falun Gong, and the 1989 Tiananmen Square protests.\nThe third video is recorded when Jiang came back to China United Engineering Corporation (Jiang worked there for some years), and Jiang recalled his experience in the video. He also talks about Deng Xiaoping's decision to appoint him as leader of China, and what he considered his achievements during his years of leadership.\n\nInstruction:\n\nWhat is the biggest strength of Hong Kong journalistsAnswer:\n\nMaking big news\n\n",
    "Context:\n\n\"West Side Story is a musical conceived by Jerome Robbins with music by Leonard Bernstein, lyrics by Stephen Sondheim, and a book by Arthur Laurents.\n\nInspired by William Shakespeare's play Romeo and Juliet, the story is set in the mid-1950s in the Upper West Side of Manhattan in New York City, then a multiracial, blue-collar neighborhood. The musical explores the rivalry between the Jets and the Sharks, two teenage street gangs of different ethnic backgrounds. The Sharks, who are recent migrants from Puerto Rico, and the Jets, who are white, vie for dominance of the neighborhood, and the police try to keep order. The young protagonist, Tony, a former member of the Jets and best friend of the gang's leader, Riff, falls in love with Maria, the sister of Bernardo, the leader of the Sharks. The dark theme, sophisticated music, extended dance scenes, tragic love story, and focus on social problems marked a turning point in musical theatre.\"\n\nInstruction:\n\nWhich Shakespeare play inspired West Side Story?Answer:\n\nWest Side Story was inspired by William Shakespeare's play Romeo and Juliet.\n\n",
    "Context:\n\nAntestor (Norwegian: [ˈɑ̀ntəstuːɽ]) is a Norwegian Christian extreme metal band formed in 1990 in Jessheim. Credited for starting the northern European Christian black metal scene, Antestor is the only Christian band to have an album released by Cacophonous Records, which has also released records by bands such as Dimmu Borgir, Sigh, and Cradle of Filth. The band's only release on Cacophonous, The Return of the Black Death, proved influential for the Christian black metal movement, and has sold over 10,000 copies.\n\nIn the late 1990s they dubbed their musical style as \"sorrow metal\" rather than black metal because the black metal movement was publicly affiliated with Satanism in Norway. According to HM magazine, the progressive elements on the debut album, Martyrium, were possibly ahead of their time in the Norwegian extreme metal scene.\n\nThe group has gone through several line-up changes over the years, and currently Antestor consists of the founding guitarist Lars Stokstad (Vemod), vocalist Ronny Hansen (Vrede), bassist Erik Normann Aanonsen, guitarist Robert Bordevick, and drummer Henning Børven. The original vocalist Kjetil Molnes (Martyr) and drummer Svein Sander (Armoth) left the band around 2000, and the members of a fellow Norwegian black metal group, Vaakevandring, joined Antestor. The reputable Norwegian extreme metal drummer Jan Axel Blomberg (Hellhammer) played session drums for their 2005 album The Forsaken and Det tapte liv EP. A fourth studio album, Omen, was released in 2012.\n\nInstruction:\n\nWhy was Antestor known as sorrow metal?Answer:\n\nBecause black metal was associated with Satanism in Antestor's home country Norway, and they are a Christian extreme metal band.\n\n",
    "Context:\n\nMagnesium is a chemical element with the symbol Mg and atomic number 12. It is a shiny gray metal having a low density, low melting point and high chemical reactivity. Like the other alkaline earth metals (group 2 of the periodic table) it occurs naturally only in combination with other elements and it almost always has an oxidation state of +2. It reacts readily with air to form a thin passivation coating of magnesium oxide that inhibits further corrosion of the metal. The free metal burns with a brilliant-white light. The metal is obtained mainly by electrolysis of magnesium salts obtained from brine. It is less dense than aluminium and is used primarily as a component in strong and lightweight alloys that contain aluminium.\n\nInstruction:\n\nGiven this paragraph about magnesium, how is magnesium obtained?Answer:\n\nMagnesium is mainly obtained by electrolysis of magnesium salts obtained from brine.\n\n",
    "Context:\n\nThe first known reference for a peanut butter and jelly sandwich appeared in the Boston Cooking School Magazine in 1901; it called for \"three very thin layers of bread and two of filling, one of peanut paste, whatever brand you prefer, and currant or crabapple jelly for the other\", and called it as \"so far as I know original\".\n\nInstruction:\n\nWhere did peanut butter and jelly sandwiches originate?Answer:\n\nIn 1901, the Boston Cooking School Magazine published the first known reference for a peanut butter and jelly sandwich. This magazine article called for \"three very thin layers of bread and two of filling, one of peanut paste, whatever brand you prefer, and currant or crabapple jelly for the other.\"\n\n",
    "Context:\n\nKennedy was born on February 22, 1932, at St. Margaret's Hospital in the Dorchester section of Boston, Massachusetts. He was the youngest of the nine children of Joseph Patrick Kennedy and Rose Fitzgerald, members of prominent Irish American families in Boston. They constituted one of the wealthiest families in the nation after their marriage. His eight siblings were Joseph Jr., John, Rosemary, Kathleen, Eunice, Patricia, Robert, and Jean. His older brother John asked to be the newborn's godfather, a request his parents honored, though they did not agree to his request to name the baby George Washington Kennedy (Ted was born on President George Washington's 200th birthday). They named the boy after their father's assistant.\n\nInstruction:\n\nBased on this paragraph, how many younger siblings did Kennedy have?Answer:\n\nBased on this paragraph, Kennedy had no younger siblings, as he was the youngest of nine children.\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, what is Instruction tuning?Answer:\n\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions.\n\n",
    "Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nInstruction:\n\nGiven this paragraph about Hydrogen Storage, what is the hydrogen boiling point?Answer:\n\nIt boils around 20.268 K (−252.882 °C or −423.188 °F).\n\n",
    "Context:\n\nHong Kong, officially the Hong Kong Special Administrative Region of the People's Republic of China (abbr. Hong Kong SAR or HKSAR), is a city and special administrative region of China on the eastern Pearl River Delta in South China. With 7.5 million residents of various nationalities in a 1,104-square-kilometre (426 sq mi) territory, Hong Kong is one of the most densely populated places in the world. Hong Kong is also a major global financial centre and one of the most developed cities in the world.\n\nHong Kong was established as a colony of the British Empire after the Qing Empire ceded Hong Kong Island from Xin'an County at the end of the First Opium War in 1841 then again in 1842. The colony expanded to the Kowloon Peninsula in 1860 after the Second Opium War and was further extended when Britain obtained a 99-year lease of the New Territories in 1898. British Hong Kong was occupied by Imperial Japan from 1941 to 1945 during World War II; British administration resumed after the surrender of Japan. The whole territory was transferred to China in 1997. As one of China's two special administrative regions (the other being Macau), Hong Kong maintains separate governing and economic systems from that of mainland China under the principle of \"one country, two systems\".\n\nOriginally a sparsely populated area of farming and fishing villages, the territory has become one of the world's most significant financial centres and commercial ports. As of 2021, it is the world's ninth-largest exporter and eight-largest importer. Hong Kong has a market economy characterised by a focus on services, low taxation and free trade; its currency, the Hong Kong dollar, is the eighth most traded currency in the world. Hong Kong is home to the third-highest number of billionaires of any city in the world, the second-highest number of billionaires of any city in Asia, and the largest concentration of ultra high-net-worth individuals of any city in the world. Although the city has one of the highest per capita incomes in the world, severe income inequality exists among the population. Most notably, housing in Hong Kong has been well-documented to experience a chronic persistent shortage; the extremely compact house sizes and the extremely high housing density are the effects of Hong Kong's housing market being the most expensive housing in the world.\n\nHong Kong is a highly developed territory and has a Human Development Index (HDI) of 0.952, ranking fourth in the world. The city has the largest number of skyscrapers of any city in the world, and its residents have some of the highest life expectancies in the world. The dense space has led to a highly developed transportation network with public transport rates exceeding 90%. Hong Kong is ranked 3rd in the Global Financial Centres Index.\n\nInstruction:\n\nTell me about Hong KongAnswer:\n\nHong Kong, officially the Hong Kong Special Administrative Region of the People's Republic of China (abbr. Hong Kong SAR or HKSAR), is a city and special administrative region of China on the eastern Pearl River Delta in South China. With 7.5 million residents of various nationalities in a 1,104-square-kilometre (426 sq mi) territory, Hong Kong is one of the most densely populated places in the world. Hong Kong is also a major global financial centre and one of the most developed cities in the world.\n\nHong Kong was established as a colony of the British Empire after the Qing Empire ceded Hong Kong Island from Xin'an County at the end of the First Opium War in 1841 then again in 1842. The colony expanded to the Kowloon Peninsula in 1860 after the Second Opium War and was further extended when Britain obtained a 99-year lease of the New Territories in 1898. British Hong Kong was occupied by Imperial Japan from 1941 to 1945 during World War II; British administration resumed after the surrender of Japan. The whole territory was transferred to China in 1997. As one of China's two special administrative regions (the other being Macau), Hong Kong maintains separate governing and economic systems from that of mainland China under the principle of \"one country, two systems\".\n\nOriginally a sparsely populated area of farming and fishing villages, the territory has become one of the world's most significant financial centres and commercial ports. As of 2021, it is the world's ninth-largest exporter and eight-largest importer. Hong Kong has a market economy characterised by a focus on services, low taxation and free trade; its currency, the Hong Kong dollar, is the eighth most traded currency in the world. Hong Kong is home to the third-highest number of billionaires of any city in the world, the second-highest number of billionaires of any city in Asia, and the largest concentration of ultra high-net-worth individuals of any city in the world. Although the city has one of the highest per capita incomes in the world, severe income inequality exists among the population. Most notably, housing in Hong Kong has been well-documented to experience a chronic persistent shortage; the extremely compact house sizes and the extremely high housing density are the effects of Hong Kong's housing market being the most expensive housing in the world.\n\nHong Kong is a highly developed territory and has a Human Development Index (HDI) of 0.952, ranking fourth in the world. The city has the largest number of skyscrapers of any city in the world, and its residents have some of the highest life expectancies in the world. The dense space has led to a highly developed transportation network with public transport rates exceeding 90%. Hong Kong is ranked 3rd in the Global Financial Centres Index.\n\n",
    "Context:\n\nThe population of Puerto Rico according to the 2020 census was 3,285,874, an 11.8% decrease since the 2010 United States Census. The commonwealth's population peaked in 2000, when it was 3,808,610, before declining (for the first time in census history) to 3,725,789 in 2010. Emigration due to economic difficulties and natural disasters, coupled with a low birth rate, have caused the population decline to continue in recent years.\n\nInstruction:\n\nHow much has the population of Puerto Rico been growing?Answer:\n\nThe population of Puerto Rico decreased 11.8% between 2010 and 2020, from 3,725,789 in 2010 to 3,285,874 in 2020, according to the United States Census. Emigration due to economic difficulties and natural disasters, coupled with a low birth rate, have caused the population decline to continue in recent years.\n\n",
    "Context:\n\nGaya Island (Malay: Pulau Gaya) is a sizeable Malaysian island of 1,465 ha, just 10 minutes off Kota Kinabalu, Sabah and forms part of the Tunku Abdul Rahman National Park. Gaya Island derived its name from the Bajau word \"Gayo\" which means big and occupies an area of 15 km2 (3,700 acres) with an elevation of up to 300 metres. Several ridges rise more than 600 feet (180 m), peaking at 1,000 feet (300 m), along the backbone of Gaya Island.\n\nGaya is the largest island in the Tunku Abdul Rahman National Park, closest to downtown Kota Kinabalu (KK) and is covered with dense virgin, tropical forest. It has been a forest reserve since 1923. The island has 20 km of hiking trails and three 5 star resorts named Gayana Marine Resort, home to the Marine Ecology Research Centre, the neighboring Gaya Island Resort (by YTL Hotel Group), the Bunga Raya Island Resort on the north-east part of the island. Historically, Gaya Island was also the site of the English colonialist's British North Borneo Company's harbour, razed by the folk hero Mat Salleh on 9 July 1897.\n\nIn recent years, there has been a plan to turn Gaya Island into a city island and tourism hub. A cable car line has also been proposed before to connect with the city centre.\n\nInstruction:\n\nGiven a reference text about Gaya Island, how many hiking trails and 5 star resorts are on the island?Answer:\n\nGaya Island has 20km of hiking trails and three 5 star resorts.\n\n",
    "Context:\n\nIn photography, exposure value (EV) is a number that represents a combination of a camera's shutter speed and f-number, such that all combinations that yield the same exposure have the same EV (for any fixed scene luminance). Exposure value is also used to indicate an interval on the photographic exposure scale, with a difference of 1 EV corresponding to a standard power-of-2 exposure step, commonly referred to as a stop.\n\nThe EV concept was developed by the German shutter manufacturer Friedrich Deckel in the 1950s (Gebele 1958; Ray 2000, 318). Its intent was to simplify choosing among equivalent camera exposure settings by replacing combinations of shutter speed and f-number (e.g., 1/125 s at f/16) with a single number (e.g., 15). On some lenses with leaf shutters, the process was further simplified by allowing the shutter and aperture controls to be linked such that, when one was changed, the other was automatically adjusted to maintain the same exposure. This was especially helpful to beginners with limited understanding of the effects of shutter speed and aperture and the relationship between them. But it was also useful for experienced photographers who might choose a shutter speed to stop motion or an f-number for depth of field, because it allowed for faster adjustment—without the need for mental calculations—and reduced the chance of error when making the adjustment.\n\nInstruction:\n\nWhat are the main functions on a DSLR camera that affect the correct the exposure of an image?Answer:\n\nIf a DSLR camera is not set to 'Automatic' mode, there are 3 primary functions that need to be considered when deciding on the correct exposure for your image.\n1) the Aperture - how wide the aperture on the lens is set determines how much light can pass through the aperture. A small aperture (e.g. f/16) allows less light to reach the sensor as opposed to a wide aperture (e.g f/2.4).\n2) the Shutter Speed - how long the shutter is allowed to remain open after you depress the release on the camera. A short exposure time (e.g. 1/1000 sec) will allow less light to hit the cameras sensor whilst a long exposure (e.g. 1/4 sec) will let more light hit the sensor\n3) the ISO setting - this setting is used to control how sensitive the sensor is to light hitting it. A low ISO setting (e.g. ISO 200) is much less sensitive than a high ISO setting (e.g. ISO 1600) which means less light is required to capture the for the image on the sensor.\nAll 3 of these functions work in tandem to ensure the correct exposure value is created based on the image and effect you are trying to create.\n\n",
    "Context:\n\nThe franchise was founded in Philadelphia in 1883, replacing the team from Worcester, Massachusetts, in the National League. The team has played at several stadiums in the city, beginning with Recreation Park (1883–1886) and continuing at Baker Bowl (1887–1938); Shibe Park (which was renamed Connie Mack Stadium in 1953 in honor of the longtime Philadelphia Athletics manager Connie Mack) (1938–1970); Veterans Stadium (1971–2003), and now Citizens Bank Park (2004-present).\n\nInstruction:\n\nGiven this reference text about the Philadelphia Phillies, how many stadiums have they had and where do they play currently?Answer:\n\nThe Phillies have played in five different stadium throughout their history in Philadelphia. They currently play at Citizens Bank Park.\n\n",
    "Context:\n\nThe White Mandingos are a rock supergroup from Woodstock, New York consisting of rapper Murs, former Rolling Stone journalist and MTV / VH1 producer Sacha Jenkins and Bad Brains' bassist Darryl Jenifer.\n\nBiography\nThe band was formed in late 2012 when Jenkins met up at Jenifer's house in Woodstock to discover if there was anything in common between their respective favourite music genres. They considered their initial collaborations unimpressive, so Jenkins suggested collaborating with Murs, who provided lyrics.\n\nTheir first album, The Ghetto Is Tryna Kill Me was released in June 2013, and followed with a short tour of the eastern United States, including gigs in New York's New Museum, Boston and Washington DC. The album is a concept album around Tyrone White, a young black man from a New York City housing project, who subsequently obtains a recording contract and gets a white girlfriend. Jenifer and Jenkins have described the album Tommy by The Who as an important influence. Reviewing the album, Baltimore City Paper 's Baynard Woods thought the group \"actually manage to do service to punk and hip hop\" and praised the band's sense of humour, particularly the music video for their first single, \"My First White Girl\". Washington City Paper's Marcus J Moore described the video for the group's \"Warn A Brotha\" as \"a cool ode to skateboarding\".\n\nInstruction:\n\nWhen was The White Mandigos band formed?Answer:\n\nThe White Mandingos was formed in late 2012, and their first album 'The Guetto is Tryna Kill Me' was released in June 2013.\n\n",
    "Context:\n\nEndless Nights in Aurora (Chinese: 極光之愛) is a 2014 Taiwanese romantic drama film directed by Lee Szu-yuan. It stars Rainie Yang and Chris Wang. It was released on December 19, 2014.\n\nRevolving around the romantic relationship of two generations, Alisha and her mother Xiao-feng, two parallel love stories are re-enacted across two and a half decades. With equally heated passion, the star-crossed lovers in different generations are faithfully attached to their experiences in love through promises, anticipation, losses, and forgiveness.\n\nInstruction:\n\nIn what year did Endless Nights come out?Answer:\n\n2014\n\n",
    "Context:\n\nAlthough \"sauerkraut\" is from a German word (Sauerkraut), the dish did not originate in Germany. Some claim fermenting cabbage suan cai was already practised in the days of the building of the Great Wall of China and that the practice was likely transmitted from China to Europe by the Tartars. However, the Romans, as previously noted, pickled forms of cabbage, and were the more likely source of modern-day sauerkraut  It then took root in Central and Eastern European cuisines, but also in other countries including the Netherlands, where it is known as zuurkool, and France, where the name became choucroute. The English name is borrowed from German where it means \"sour cabbage\". The names in Slavic and other Central and Eastern European languages have similar meanings with the German word: \"fermented cabbage\" (Albanian: lakër turshi, Azerbaijani: kələm turşusu, Belarusian: квашаная капуста, Czech: kysané zelí, Lithuanian: rauginti kopūstai, Russian: квашеная капуста, tr. kvašenaja kapusta, Turkısh: lahana turşusu, Romanian: varză murată, Persian: kalam torş, Ukrainian: квашена капуста) or \"sour cabbage\" (Bulgarian: кисело зеле, Estonian: hapukapsas, Finnish: hapankaali, Hungarian: savanyúkáposzta, Latvian: skābēti kāposti, Macedonian: расол / кисела зелка, Polish: kapusta kiszona, Russian: кислая капуста, tr. kislaya kapusta, Serbo-Croatian: кисели купус / кисело зелје, kiseli kupus / kiselo zelje, Slovak: kyslá kapusta, Slovene: kislo zelje, Ukrainian: кисла капуста, kysla kapusta).\n\nInstruction:\n\nGiven this paragraph, where did the German dish sauerkraut originate from?Answer:\n\nThe Romans are believed to be the most likely origin of the German dish called sauerkraut.\n\n",
    "Context:\n\nJames grew up playing basketball for St. Vincent–St. Mary High School in his hometown of Akron, Ohio. He was heavily touted by the national media as a future NBA superstar. A prep-to-pro, he was selected by the Cleveland Cavaliers with the first overall pick of the 2003 NBA draft. Named the 2004 NBA Rookie of the Year, he soon established himself as one of the league's premier players, leading the Cavaliers to their first NBA Finals appearance in 2007 and winning the NBA MVP award in 2009 and 2010. After failing to win a championship with Cleveland, James left in 2010 as a free agent to join the Miami Heat; this was announced in a nationally televised special titled The Decision and is among the most controversial free agency moves in sports history.\n\nInstruction:\n\nAccording to the following paragraph on LeBron James, how did he announce joining the Miami Heat?Answer:\n\nLeBron James announced his move from the Cleveland Cavaliers to the Miami Heat in a television special called \"The Decision\" that was televised nationally.\n\n",
    "Context:\n\nThe company was incorporated as Tesla Motors, Inc. on July 1, 2003, by Martin Eberhard and Marc Tarpenning. Eberhard and Tarpenning served as CEO and CFO, respectively. Eberhard said he wanted to build \"a car manufacturer that is also a technology company\", with its core technologies as \"the battery, the computer software, and the proprietary motor\".\n\nIan Wright was Tesla's third employee, joining a few months later. In February 2004, the company raised $7.5 million in series A funding, including $6.5 million from Elon Musk, who had received $100 million from the sale of his interest in PayPal two years earlier. Musk became the chairman of the board of directors and the largest shareholder of Tesla. J. B. Straubel joined Tesla in May 2004 as chief technical officer.\n\nA lawsuit settlement agreed to by Eberhard and Tesla in September 2009 allows all five – Eberhard, Tarpenning, Wright, Musk, and Straubel – to call themselves co-founders.\n\nInstruction:\n\nGiven these paragraphs about the founding of Tesla, who else part from Elon Musk and J. B. Straubel are co-founders of Tesla?Answer:\n\nEberhard, Tarpenning and Wright\n\n",
    "Context:\n\nScrub Daddy is a cleaning product company best known for an eponymous sponge it manufactures in the shape of a smiley face. The product is made of a polymer which changes texture – firm in cold water and soft in warm water. As of 2019, Scrub Daddy had the highest revenue of any product successfully pitched on the ABC reality show Shark Tank.\n\nHistory\nAfter damaging the exterior of a vehicle when cleaning the outside, detailer Aaron Krause invented a line of buffing and polishing pads. The company was acquired by 3M in August 2008. 3M did not purchase a line of sponges Krause had invented, leaving them to sit in his factory. Five years later, Krause used the remaining sponges to clean his dishes and lawn furniture. According to Krause, this is when he \"realized his multi-million dollar idea.\"\n\nAccording to the company's website, Scrub Daddy, Inc. was founded in 2012 with grassroots marketing. On the Shark Tank episode originally airing in October 2012, Lori Greiner made a 20% equity stake deal with Krause for $200,000. The following day, Greiner and Krause sold out of 42,000 sponges in under seven minutes on QVC. Greiner then helped Scrub Daddy to be sold in retail stores such as Bed, Bath & Beyond. In January 2017, Scrub Daddy's total revenues surpassed $100 million – the highest of any Shark Tank product. As of October 2019, the company's lifetime sales were $209 million. In Season 14 Episode 13, it was reported that Scrub Daddy in 10 years has 273 employees, 160 products, sold in 257,000 retail locations, top 5 grossing company in shark tank history, doing over $670m in retail sales since launch.\n\nInstruction:\n\nGiven a reference text about Scrub Daddy, tell me the details on the deal the founder made on Shark Tank.Answer:\n\nAaron Krause, the founder of Scrub Daddy, made a deal with Lori Greiner on Shark Tank, giving her 20% equity in the company for $200,000.\n\n",
    "Context:\n\nThe C40 went on to win 5 editions of Paris-Roubaix in 6 years. Surpringly, the victory of Tadej Pogačar in the 2020 edition of the Tour de France marked the first time a Colnago-branded bicycle was ridden by the overall classification winner, since Merckx's victories were aboard re-branded bikes.\n\nInstruction:\n\nGiven the paragraph about the Colnago C40, in which year was a Colnago-branded bicycle first ridden by the overall classification winner in the Tour de France?Answer:\n\n2020 was the first year a Colnago-branded bicycle was first ridden by the overall classification winner in the Tour de France.\n\n",
    "Context:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. The name may also refer to wines created predominantly from pinot noir grapes. The name is derived from the French words for pine and black. The word pine alludes to the grape variety having tightly clustered, pinecone–shaped bunches of fruit.\n\nPinot noir is grown around the world, mostly in cooler climates, and the variety is chiefly associated with the Burgundy region of France. Pinot noir is now used to make red wines around the world, as well as champagne, sparkling white wines such as the Italian Franciacorta, and English sparkling wines. Regions that have gained a reputation for red pinot noir wines include the Willamette Valley of Oregon; the Carneros, Central Coast, Sonoma Coast, and Russian River AVAs of California; the Elgin and Walker Bay wine regions of South Africa; the Mornington Peninsula, Adelaide Hills, Great Southern, Tasmania, and Yarra Valley in Australia; and the Central Otago, Martinborough, and Marlborough wine regions of New Zealand. Pinot noir is the most planted varietal (38%) used in sparkling wine production in Champagne and other wine regions.\n\nInstruction:\n\nWhat is Pinot Noir?Answer:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. Pinot noir is grown around the world, mostly in cooler climates, and the variety is chiefly associated with the Burgundy region of France. Pinot noir is now used to make red wines around the world, as well as champagne, sparkling white wines such as the Italian Franciacorta, and English sparkling wines.\n\n",
    "Context:\n\nSwift has won 12 Grammy Awards (including three for Album of the Year—tying for the most by an artist), an Emmy Award, 40 American Music Awards (the most won by an artist),29 Billboard Music Awards (the most won by a woman), 92 Guinness World Records, 14 MTV Video Music Awards (including three Video of the Year wins—the most by an act), 12 Country Music Association Awards (including the Pinnacle Award), eight Academy of Country Music Awards, and two Brit Awards. As a songwriter, she has been honored by the Nashville Songwriters Association, the Songwriters Hall of Fame, and the National Music Publishers' Association and was the youngest person on Rolling Stone's list of the 100 Greatest Songwriters of All Time in 2015. At the 64th BMI Awards in 2016, Swift was the first woman to be honored with an award named after its recipient. In 2023, Swift became the first act to be named the global best-selling artist of the year by the International Federation of the Phonographic Industry (IFPI) thrice.\n\nFrom available data, Swift has amassed over 50 million album sales, 150 million single sales, and 114 million units globally, including 78 billion streams. The International Federation of the Phonographic Industry (IFPI) ranked her as the Global Recording Artist of the Year for a record three times (2014, 2019 and 2022). Swift has the most number-one albums in the United Kingdom and Ireland for a female artist this millennium and earned the highest income for an artist on Chinese digital music platforms—RMB 159,000,000. Swift is the most streamed female act on Spotify, and the only artist to have received more than 200 million streams in one day (228 million streams on October 21, 2022).The most entries and the most simultaneous entries for an artist on the Billboard Global 200, with 94 and 31 songs, respectively, are among her feats. Her Reputation Stadium Tour (2018) is the highest-grossing North American tour ever, and she was the world's highest-grossing female touring act of the 2010s. Beginning with Fearless, all of her studio albums opened with over a million global units.\n\nInstruction:\n\nGiven the passage below, tell me how many Grammy Awards, Emmy Awards, and Billboard Music Awards Taylor Swift has won and how many simultaneous entries she had on the Billboard Global 200 when she had the most simultaneous entries for an artist.Answer:\n\nTaylor Swift won 12 Grammy Awards, one Emmy Awards, 29 Billboard Music Awards, and had 31 songs on the Billboard Global 200 simultaneously, breaking the record for the most simultaneous entries for an artist on the Billboard Global 200.\n\n",
    "Context:\n\nIhor Lapin (born 28 May 1969 in Ivanychi) is a Ukrainian lawyer and politician who is a former (2014-2019) Member of the Parliament of Ukraine.\n\nDuring the War in Donbass (eastern Ukraine) he was commander of the 2nd assault squadron \"West\" of the 24th Battalion of Territorial Defense \"Aidar\" of the Armed Forces of Ukraine, formed mainly from volunteers from Volyn Region.\n\nIn the Russian-Ukrainian war, he was the commander of the Special Forces Battalion of the First Separate Special Forces Brigade, named after Ivan Bohun.\n\nBefore the war, he worked as a lawyer, and was a member of the Bar Qualification-Disciplinary Commission of Volyn Region.\n\nInstruction:\n\nGiven a reference text about Ihor Lapin, tell me what he did before the war.Answer:\n\nBefore the war, Ihor Lapin was a lawyer and a member of the Bar Qualification-Disciplinary Commission.\n\n",
    "Context:\n\nSly and the Family Stone was an American funk rock band originated from San Francisco, California. Active from 1966 to 1983, they were pivotal in the development of funk, soul, rock, and psychedelic music. Their core line-up was led by singer-songwriter, record producer, and multi-instrumentalist Sly Stone, and included Stone's brother and singer/guitarist Freddie Stone, sister and singer/keyboardist Rose Stone, trumpeter Cynthia Robinson, drummer Greg Errico, saxophonist Jerry Martini, and bassist Larry Graham. The band was the first major American rock group to have a racially integrated, male and female lineup.\n\nInstruction:\n\nWhere did Sly and the Family Stone come from?Answer:\n\nSly and the Family Stone originated from San Francisco, California.\n\n",
    "Context:\n\nLamb Air Ltd. was a Canadian airline that began operations in 1934 in The Pas, Manitoba, and went out of business in 1981.\n\nHistory\nTom Lamb was the son of Thomas Henry Peacock (THP) Lamb, who had emigrated from England in the late 19th century. THP Lamb turned from school teacher to fur trader and in 1900, started Lamb's Store in Moose Lake, Manitoba. Tom and his brothers and sisters grew up in northern Manitoba and worked for their father.\n\nTom Lamb left school before finishing grade 3. Later in life, he would make the comment, while giving his acceptance speech when receiving his honorary Doctorate of law from the University of Manitoba, \"If I had only gotten to grade 4\". At the age of 10, Tom, who had his own team of horses and sleigh, was competing with grown men in the fish hauling business. He would have to use fish boxes to step up on to be able to load his sleigh.\n\nOne of the Lamb family's businesses was \"logistics and transportation\". Fish, lumber, trees, fur and supplies needed to be hauled by any and all means. Dog teams, horses, boats, trucks and tractors were used. In the 1930s there was a transportation revolution happening. The aircraft was making its way into northern Canada. The first time Tom Lamb saw an aircraft he realized its potential. In 1930, Tom bought his first aircraft - a Stinson SR8. In 1930, Tom Lamb travelled to Winnipeg to learn to fly. To keep costs to a minimum, he lived in a tent behind the Winnipeg Flying Club. When he returned to The Pas and checked himself out on the Stinson.\n\nIn 1935, Tom incorporated Lamb Airways Limited. The airline had some name changes throughout the years and Tom became one of the best known Manitobans, if not Canadians, in the world. His adventures have been documented in books, a television documentary and even a song.\n\nInstruction:\n\nWhen was Lamb Air operatingAnswer:\n\nLamb Air Ltd. was a Canadian airline that began operations in 1934 in The Pas, Manitoba, and went out of business in 1981.\n\nHistory\nTom Lamb was the son of Thomas Henry Peacock (THP) Lamb, who had emigrated from England in the late 19th century. THP Lamb turned from school teacher to fur trader and in 1900, started Lamb's Store in Moose Lake, Manitoba. Tom and his brothers and sisters grew up in northern Manitoba and worked for their father.\n\nTom Lamb left school before finishing grade 3. Later in life, he would make the comment, while giving his acceptance speech when receiving his honorary Doctorate of law from the University of Manitoba, \"If I had only gotten to grade 4\". At the age of 10, Tom, who had his own team of horses and sleigh, was competing with grown men in the fish hauling business. He would have to use fish boxes to step up on to be able to load his sleigh.\n\nOne of the Lamb family's businesses was \"logistics and transportation\". Fish, lumber, trees, fur and supplies needed to be hauled by any and all means. Dog teams, horses, boats, trucks and tractors were used. In the 1930s there was a transportation revolution happening. The aircraft was making its way into northern Canada. The first time Tom Lamb saw an aircraft he realized its potential. In 1930, Tom bought his first aircraft - a Stinson SR8. In 1930, Tom Lamb travelled to Winnipeg to learn to fly. To keep costs to a minimum, he lived in a tent behind the Winnipeg Flying Club. When he returned to The Pas and checked himself out on the Stinson.\n\nIn 1935, Tom incorporated Lamb Airways Limited. The airline had some name changes throughout the years and Tom became one of the best known Manitobans, if not Canadians, in the world. His adventures have been documented in books, a television documentary and even a song.\n\n",
    "Context:\n\nListeriosis is an infectious but not contagious disease caused by the bacterium Listeria monocytogenes, far more common in domestics animals (domestic mammals and poultry), especially ruminants, than in human beings. It can also occur in feral animals—among others, game animals—as well as in poultry and other birds.\n\nThe causative bacterium lives in the soil and in poorly made silage, and is acquired by ingestion. It is not contagious; over the course of a 30-year observation period of sheep disease in Morocco, the disease only appeared in the late 2000s (decade) when feeding bag-ensiled corn became common.[better source needed] In Iceland, the disease is called \"silage sickness\".\n\nInstruction:\n\nGiven a reference text about Listeriosis, tell me how how the bacterium is transfered into animals, and people.Answer:\n\nListeriosis is most often associated with animals but can also infect people and is primarily transferred by ingestion.\n\n",
    "Context:\n\nHoli ( /ˈhoʊliː/) is a popular and significant Hindu festival celebrated as the Festival of Colours, Love and Spring. It celebrates the eternal and divine love of the god Radha and Krishna. Additionally, the day also signifies the triumph of good over evil,as it commemorates the victory of Vishnu as Narasimha Narayana over Hiranyakashipu. Holi is originated and is predominantly celebrated in the Indian subcontinent but has also spread to other regions of Asia and parts of the Western world through the Indian diaspora.\n\nInstruction:\n\nTell me about Holi and why so many people in the world celebrate it?Answer:\n\nHoli is an festival celebrated by Hindus in India.  Even though it was originated by Hindu religion, it is celebrated across India irrespective of religion.  It has become a notable Indian cultural representation.  The reason so many people in the world celebrate it is because India has one of the largest population in the world.\n\n",
    "Context:\n\nGull Harbour (former names States Harbour, Great Harbour) is the 1.3 km wide bay indenting for 2.8 km the east coast of Weddell Island in the Falkland Islands. It is entered north of Gull Point and south of Mark Point, and is centred at 51°53′56″S 60°53′20″WCoordinates: 51°53′56″S 60°53′20″W. The principal settlement of the island, Weddell Settlement, is situated at the head of the bay. Until the mid-nineteenth century Gull Harbour was known as Great Harbour.\n\nInstruction:\n\nHow large is the Gull Harbour and where exactly is it locatedAnswer:\n\nGull Harbour, that has been formerly named as States Harbour or Great Harbour is the 1.3 km wide bay indenting for 2.8 km the east coast of Weddell Island in the Falkland Islands.\n\nIt is entered north of Gull Point and south of Mark Point, and is centred at 51°53′56″S 60°53′20″W. The principal settlement of the island, Weddell Settlement, is situated at the head of the bay. Until the mid-nineteenth century Gull Harbour was known as Great Harbour.\n\n",
    "Context:\n\nMargot Elise Robbie (/ˈmɑːrɡoʊ ˈrɒbi/; born 2 July 1990) is an Australian actress and producer. Known for her work in both blockbuster and independent films, she has received various awards and nominations, including nominations for two Academy Awards, four Golden Globe Awards, and five British Academy Film Awards. Time magazine named her one of the 100 most influential people in the world in 2017 and she was ranked as one of the world's highest-paid actresses by Forbes in 2019.\n\nInstruction:\n\nGiven a reference text about Margot Robbie, tell me when they were born and what they are famous for.Answer:\n\nMargot Robbie was born on July 2nd, 1990. She is famous for being an Australian actress and one of Time Magazine's 100 most influential people in the world in 2017.\n\n",
    "Context:\n\nWallis and Futuna is located about two-thirds of the way from Hawaii to New Zealand. It is 13°18′S 176°12′W Coordinates: 13°18′S 176°12′W, 360 km (220 mi) west of Samoa and 480 km (300 mi) northeast of Fiji.\n\nThe territory includes the island of Uvéa (also called Wallis), which is the most populous; the island of Futuna; the virtually uninhabited island of Alofi; and 20 uninhabited islets. The total area of the territory is 274 square kilometres (106 sq mi), with 129 kilometres (80 mi) of coastline. The highest point in the territory is Mont Puke, on the island of Futuna, at 524 metres (1,719 ft).\n\nThe islands have a hot, rainy season from November to April, when tropical cyclones passing over them cause storms. Then they have a cool, dry season from May to October, caused by the southeast trade winds that predominate during those months. The average annual rainfall is between 2,500 and 3,000 millimetres (98–118  in), and rain is likely on at least 260 days per year. The average humidity is 80%. The average annual temperature is 26.6 °C (79.9 °F), rarely falling below 24.0 °C (75.2 °F); during the rainy season, it ranges between 28.0 °C (82.4 °F) and 32.0 °C (89.6 °F).\n\nOnly 5% of the islands' land area consists of arable land; permanent crops cover another 20%. Deforestation is a serious problem: Only small portions of the original forests remain, largely because the inhabitants use wood as their main fuel source, and, as a result, the mountainous terrain of Futuna is particularly susceptible to erosion. The island of Alofi lacks natural freshwater resources, so it has no permanent settlements.\n\nVolcanic activity during the mid-Pleistocene created numerous volcanic crater lakes on Uvea (Wallis Island). The names of some of them are: Lalolalo, Lano, Lanutavake, Lanutuli, Lanumaha, Kikila, and Alofivai.\n\nWallis and Futuna is part of the Fiji tropical moist forests terrestrial ecoregion.\n\nInstruction:\n\nWhen is the best time to go to Wallis and FutunaAnswer:\n\nIt is best to go from May to October in the dry season. The temperature are lower but at least it is not raining so often.\n\n",
    "Context:\n\nAvīci or Avici (Sanskrit and Pali for \"without waves\"; Chinese: 無間地獄 or 阿鼻地獄; Japanese: 無間地獄 or 阿鼻地獄; Burmese: အဝီစိငရဲ) is one of the hells (naraka) in Hinduism and Buddhism. In Hinduism, it is one of the twenty-eight hells located in the kingdom of Yama, where individuals are reborn for bearing false witness and outright lying while transacting business or giving charity. In Buddhism, it is the lowest level of the Naraka or \"hell\" realm, with the most suffering, into which the dead who have committed grave misdeeds may be reborn. It is said to be a cube 20,000 yojanas (240,000 to 300,000 kilometers) on each side, buried deep underneath the divine (nonvisible) earth. Avīci is often translated into English as \"interminable\" or \"incessant\", referring to suffering without periods of respite, although it is believed to be ultimately impermanent.\n\nInstruction:\n\nWhat does Avici stand forAnswer:\n\nThere was a famous Swedish DJ called Avicii and there is Avici that is one of the hells (naraka) in Hinduism and Buddhism. In Hinduism, it is one of the twenty-eight hells located in the kingdom of Yama, where individuals are reborn for bearing false witness and outright lying while transacting business or giving charity.\n\nIn Buddhism, it is the lowest level of the Naraka or \"hell\" realm, with the most suffering, into which the dead who have committed grave misdeeds may be reborn. It is said to be a cube 20,000 yojanas (240,000 to 300,000 kilometers) on each side, buried deep underneath the divine (nonvisible) earth. Avici is often translated into English as \"interminable\" or \"incessant\", referring to suffering without periods of respite, although it is believed to be ultimately impermanent.\n\n",
    "Context:\n\nSir Thomas Staples, 9th Baronet (31 July 1775 – 14 May 1865) was an Anglo-Irish politician and lawyer. He was the last surviving person to have been a member of the Irish House of Commons, albeit only having been in the House for a short time.\n\nInstruction:\n\nGiven the following paragraph about politicians, who was the last surviving person to have been a member of the Irish House of Commons?Answer:\n\nSir Thomas Staples, 9th Baronet\n\n",
    "Context:\n\nGalaga is a 1981 fixed shooter arcade video game developed and published by Namco. In North America, it was released by Midway Manufacturing. It is the sequel to Galaxian (1979), Namco's first major video game hit in arcades. Controlling a starship, the player is tasked with destroying the Galaga forces in each stage while avoiding enemies and projectiles. Some enemies can capture a player's ship via a tractor beam, which can be rescued to transform the player into a \"dual fighter\" with additional firepower.\n\nInstruction:\n\nWhen was Galaga released?Answer:\n\nGalaga was released in 1981 as a fixed shooter arcade video game developed and published by Namco.\n\n",
    "Context:\n\nMulti-spectral camouflage is the use of counter-surveillance techniques to conceal objects from detection across several parts of the electromagnetic spectrum at the same time. While traditional military camouflage attempts to hide an object in the visible spectrum, multi-spectral camouflage also tries to simultaneously hide objects from detection methods such as infrared, radar, and millimetre-wave radar imaging.\n\nInstruction:\n\nBased on this article, what is a potential weakness of traditional military camouflage?Answer:\n\nTraditional military camouflage only protects against tools which use the visual spectrum to detect objects, and so if a tool is based on infrared or radar the traditional camouflage doesn't offer any protection.\n\n",
    "Context:\n\nWhile Madrid possesses modern infrastructure, it has preserved the look and feel of many of its historic neighbourhoods and streets. Its landmarks include the Plaza Mayor, the Royal Palace of Madrid; the Royal Theatre with its restored 1850 Opera House; the Buen Retiro Park, founded in 1631; the 19th-century National Library building (founded in 1712) containing some of Spain's historical archives; many national museums, and the Golden Triangle of Art, located along the Paseo del Prado and comprising three art museums: Prado Museum, the Reina Sofía Museum, a museum of modern art, and the Thyssen-Bornemisza Museum, which complements the holdings of the other two museums. Cibeles Palace and Fountain has become one of the monument symbols of the city.\n\nInstruction:\n\nGiven this paragraph about the city of Madrid, what are the main landmarks of the city?Answer:\n\nThe main landmarks of Madrid include the Plaza Mayor, the Royal Palace, the Royal Theatre or the Retiro Park. Madrid also has many national museums, such as the Prado Museum, the Reina Sofia Museum or the Thyssen-Bornemisza Museum.\n\n",
    "Context:\n\nMar-a-Lago was built for businesswoman and socialite Marjorie Merriweather Post, former owner of General Foods Corporation, between the years 1924 to 1927. At the time of her death in 1973, Post bequeathed the property to the National Park Service, hoping it could be used for state visits or as a Winter White House, but because the costs of maintaining the property exceeded the funds provided by Post, and because it was difficult to secure the facility (as it is located in the flight path of Palm Beach Airport), the property was returned to the Post Foundation by an act of Congress in 1981.\n\nInstruction:\n\nWhen was Mar-a-Lago built?Answer:\n\nMar-a-Lago was built between the years 1924 to 1927.\n\n",
    "Context:\n\nA glass ceiling is a metaphor usually applied to women, used to represent an invisible barrier that prevents a given demographic from rising beyond a certain level in a hierarchy. No matter how invisible the glass ceiling is expressed, it is actually a difficult obstacle to overcome. The metaphor was first used by feminists in reference to barriers in the careers of high-achieving women. It was coined by Marilyn Loden during a speech in 1978. In the United States, the concept is sometimes extended to refer to racial inequality in the United States. Minority women in white-majority countries often find the most difficulty in \"breaking the glass ceiling\" because they lie at the intersection of two historically marginalized groups: women and people of color. East Asian and East Asian American news outlets have coined the term \"bamboo ceiling\" to refer to the obstacles that all East Asian Americans face in advancing their careers. Similarly, a multitude of barriers that refugees and asylum seekers face in their search for meaningful employment is referred to as canvas ceiling.\n\nInstruction:\n\nIs the glass ceiling real?Answer:\n\nWhile it is not real as a physical object, it is considered real metaphorically, as it represents an invisible barrier that hinder women from rising beyond a certain organizational or societal hierarchy.\n\n",
    "Context:\n\nThe Battle of Kuningtou or Battle of Guningtou, also known as the Battle of Kinmen, was a battle fought over Kinmen in the Taiwan Strait during the Chinese Civil War in 1949. The failure of the Communists to take the island left it in the hands of the Kuomintang (Nationalists) and crushed their chances of taking Taiwan to destroy the Nationalists completely in the war.\n\nInstruction:\n\nWho were fighting each other in this battle and what's the consequence of itAnswer:\n\nChinese Nationalist and Chinese Communists fought this battle during Chinese Civil War in 1949. Chinese Nationalist won the battle which deterred Chinese Communists from taking over Taiwan, the last stronghold of Chinese Nationalist government fled from mainland in 1949 until today.\n\n",
    "Context:\n\nIn a 100 gram amount, smooth peanut butter supplies 597 Calories and is composed of 51% fat, 22% protein, 22% carbohydrates (including 5% dietary fiber), and 1% water (table). Both crunchy and smooth peanut butter are sources of saturated and monounsaturated fats (mainly oleic acid) as 25% of total serving amount, and polyunsaturated fat (12% of total), primarily as linoleic acid).\n\nPeanut butter is a rich source (20% or more of the Daily Value, DV) of dietary fiber, vitamin E, pantothenic acid, folate, niacin, and vitamin B6 (table, USDA FoodData Central). Also high in content are the dietary minerals manganese, magnesium, phosphorus, zinc, copper, and sodium (added as salt during manufacturing). Peanut butter is a moderate source (10–19% DV) of thiamin, riboflavin, iron, and potassium (table).\n\nInstruction:\n\nGiven this text about the nutrition profile of peanut butter, what vitamins is peanut butter rich in?Answer:\n\nVitamins that peanut butter is rich in include vitamin E, pantothenic acid, folate, niacin, and vitamin B6.\n\n",
    "Context:\n\nGosberton Clough is a village in the civil parish of Gosberton and the South Holland district of Lincolnshire, England. It is 30 miles (50 km) south-east from the city and county town of Lincoln, 5 miles (8 km) north from the nearest large town of Spalding, and 3 miles (5 km) west-southwest from parish village of Gosberton.\n\nGosberton Clough and the village Risegate to the east are conjoined as a 2 miles (3 km) linear settlement on the east to west B1397 road which runs along the south side of Risegate Eau (drain). Within Gosberton Clough the B1397 is named 'Clough Road', and in Risegate, 'Risegate Road', the villages separated at a bridge over the Risegate Eau at the junction with Chesboule Lane, running north, and Beach Lane, running south. The B1397 and the village is mirrored at the north of Risegate Eau by the parallel 'Siltside' (road). The Risegate Eau starts 2 miles (3 km) west at the South Forty-Foot Drain, then flows through the village, and reaches the River Welland at the Risegate Outfall sluice in Algarkirk Marsh, 7 miles (11 km) to the east. The north to south Hammond Beck intersects Risegate Eau at the west of the village, alongside of which is Beck Bank (road).\n\nInstruction:\n\nfrom this blob of text about gosberton clough, to which city does the river flow to?Answer:\n\nTowards Lincoln, England\n\n",
    "Context:\n\nAround 4000 BCE, the Saharan climate started to become drier at an exceedingly fast pace. This climate change caused lakes and rivers to shrink significantly and caused increasing desertification. This, in turn, decreased the amount of land conducive to settlements and encouraged migrations of farming communities to the more tropical climate of West Africa. During the first millennium BCE, a reduction in wild grain populations related to changing climate conditions facilitated the expansion of farming communities and the rapid adoption of rice cultivation around the Niger River.\n\nInstruction:\n\nThe reduction in wild grain populations lead to what type of crop being cultivated?Answer:\n\nThe reduction in wild grain populations lead to the rapid adoption of rice cultivation around the Niger River.\n\n",
    "Context:\n\nA minimum spanning tree (MST) or minimum weight spanning tree is a subset of the edges of a connected, edge-weighted undirected graph that connects all the vertices together, without any cycles and with the minimum possible total edge weight. That is, it is a spanning tree whose sum of edge weights is as small as possible. More generally, any edge-weighted undirected graph (not necessarily connected) has a minimum spanning forest, which is a union of the minimum spanning trees for its connected components.\n\nThere are many use cases for minimum spanning trees. One example is a telecommunications company trying to lay cable in a new neighborhood. If it is constrained to bury the cable only along certain paths (e.g. roads), then there would be a graph containing the points (e.g. houses) connected by those paths. Some of the paths might be more expensive, because they are longer, or require the cable to be buried deeper; these paths would be represented by edges with larger weights. Currency is an acceptable unit for edge weight – there is no requirement for edge lengths to obey normal rules of geometry such as the triangle inequality. A spanning tree for that graph would be a subset of those paths that has no cycles but still connects every house; there might be several spanning trees possible. A minimum spanning tree would be one with the lowest total cost, representing the least expensive path for laying the cable.\n\nInstruction:\n\nBased on the text provided, what does a minimum spanning tree optimize?Answer:\n\nA minimum spanning tree optimizes the a graph in a way that minimizes the sum of all the weights of the edges\n\n",
    "Context:\n\nThe 2010 Tennessee Titans season was the team's 41st season in the National Football League, their 51st overall and their 14th season in Tennessee. The Titans hoped to improve on their 8–8 record from the 2009 season, but they failed to do so and ended up finishing 6-10. They started the season 5-2, but lost the next 8 of 9. This was the Titans’ final season under head coach Jeff Fisher, who resigned on January 27, 2011 after 17 seasons with the team.\n\nOffseason\nPersonnel changes\nOn January 25, Kennedy Pola, who previously served as the Jacksonville Jaguars' running backs coach for the past five seasons, was hired to the same position with the Titans, replacing Earnest Byner, who was fired the same day. (Ironically, Byner was later named the new Jaguars' running backs coach ten days later.) On May 14, Ruston Webster, who served as the Seattle Seahawks' vice president of player personnel for the past four seasons, was hired to the same position with the Titans.\n\nOn July 27, Kennedy Pola left the Titans and accepted the offensive coordinator position at USC. On July 28, the following changes were made to the Titans' coaching staff: Craig Johnson was moved from quarterbacks coach to the running backs coach vacated by Kennedy Pola, and will also serve as assistant head coach. Dowell Loggains, who previously served as quality control of offense, was named the new quarterbacks coach, while offensive assistant Richie Hessman will serve as quality control of offense.\n\nInstruction:\n\nHow many seasons was Jeff Fisher the head coach of the Titans while they were not in Tennessee?Answer:\n\n3 seasons\n\n",
    "Context:\n\n\"In metaphysics, ontology is the philosophical study of being, as well as related concepts such as existence, becoming, and reality.\n\nOntology addresses questions like how entities are grouped into categories and which of these entities exist on the most fundamental level. Ontologists often try to determine what the categories or highest kinds are and how they form a system of categories that encompasses the classification of all entities. Commonly proposed categories include substances, properties, relations, states of affairs, and events. These categories are characterized by fundamental ontological concepts, including particularity and universality, abstractness and concreteness, or possibility and necessity. Of special interest is the concept of ontological dependence, which determines whether the entities of a category exist on the most fundamental level. Disagreements within ontology are often about whether entities belonging to a certain category exist and, if so, how they are related to other entities.\"\n\nInstruction:\n\nWhat is Ontology?Answer:\n\nIn metaphysics, ontology is the philosophical study of being\n\n",
    "Context:\n\nMaskavas Forštate (German: Moskauer Vorstadt) also known as Maskavas priekšpilsēta and colloquially as Maskačka, is a suburb of Riga situated on the right bank of the Daugava. The neighborhood is located to the south of Old Riga along the road historically connecting Riga to Moscow, from which its name is derived.\n\nHistory\nSee also: Riga Ghetto\nThe history of Maskavas Forštate, whose name in English literally means Moscow Suburb goes back to at least the 14th century, in some parts the medieval street network has been preserved. However, the area is first mentioned in 1348 by the name of Lastādija (German: Lastadie).\n\nArchitecturally, the neighborhood reflects its history as an area of Russian, Belarusian and Jewish migration, especially characteristic wooden homes.\n\nDuring the Nazi occupation of Riga, the neighborhood was turned into a ghetto for Jews. Today, there are memorials on the site of the Great Choral Synagogue and the Old Jewish cemetery. Most of the prewar buildings remain standing.\n\nInstruction:\n\nWhat's the architecture in Maskavas Forstate look like?Answer:\n\nThe architecture of Maskavas Forštate reflects the history of Russian, Belarusian, and Jewish migration.\n\n",
    "Context:\n\nCallixena versicolora is a moth of the family Noctuidae first described by Max Saalmüller in 1891. The species can be found in Africa, where it is known from Ghana, Nigeria, the Democratic Republic of the Congo, Malawi, Kenya, South Africa, Comoros, Madagascar and Réunion.\n\nThis species has a wingspan from 29 to 40 mm.\n\nReferences\nSaalmüller & von Heyden (1891). Lepidopteren von Madagascar. Zweite Abtheilung. Heterocera: Noctuae, Geometrae, Microlepidoptera. :247–531, pls. 7–14 (in German)\n De Prins, J. & De Prins, W. (2019). \"Magusa versicolora (Saalmüller, 1891)\". Afromoths. Retrieved December 22, 2020.\n\nInstruction:\n\nWhich continent can Callixena versicolora be found?Answer:\n\nAfrica\n\n",
    "Context:\n\nA 2013 report by the City of London Corporation said that London is the \"greenest city\" in Europe with 14,164 hectares (35,000 acres) of public parks, woodlands and gardens. The largest parks in the central area of London are three of the eight Royal Parks, namely Hyde Park and its neighbour Kensington Gardens in the west, and Regent's Park to the north. Hyde Park in particular is popular for sports and sometimes hosts open-air concerts. Regent's Park contains London Zoo, the world's oldest scientific zoo, and is near Madame Tussauds Wax Museum. Primrose Hill, immediately to the north of Regent's Park, at 256 feet (78 m) is a popular spot from which to view the city skyline.\n\nInstruction:\n\nWhich parks are popular in London?Answer:\n\nPopular parks in London includes Hyde Park, Regent's Park and Kensington Gardens.\n\n",
    "Context:\n\nAdvocates of autonomous building describe advantages that include reduced environmental impacts, increased security, and lower costs of ownership. Some cited advantages satisfy tenets of green building, not independence per se (see below). Off-grid buildings often rely very little on civil services and are therefore safer and more comfortable during civil disaster or military attacks. For example, Off-grid buildings would not lose power or water if public supplies were compromised.\n\nInstruction:\n\nGiven this paragraph about autonomous buildings, why would they be safer during a military attack?Answer:\n\nAutonomous buildings often rely on less civil services and are therefore safer and more comfortable during civil disasters or military attacks.\n\n",
    "Context:\n\nSuntory Holdings Limited (サントリーホールディングス株式会社, Santorī Hōrudingusu Kabushiki-gaisha) (commonly referred to as simply Suntory) is a Japanese multinational brewing and distilling company group. Established in 1899, it is one of the oldest companies in the distribution of alcoholic beverages in Japan, and makes Japanese whisky. Its business has expanded to other fields, and the company now also makes soft drinks and operates sandwich chains. With its 2014 acquisition of Beam, Inc., it has diversified internationally and become the third largest maker of distilled beverages in the world. Suntory is headquartered in Dojimahama 2-chome, Kita-ku, Osaka, Osaka Prefecture. Suntory Beverage & Food Limited (サントリー食品インターナショナル株式会社, Santorī shokuhin\n\nInstruction:\n\nWhen was Suntory established?Answer:\n\nSuntory was established in 1899\n\n",
    "Context:\n\nAraber Rahaman (died 28 April 2013) was an Indian politician. He was the Tripura MLA for Boxanagar from 1978–1988.\n\nInstruction:\n\nWhat was the profession of Araber Rahaman?Answer:\n\nHe was a politician.\n\n",
    "Context:\n\nTelangana (/ˌtɛlənˈɡɑːnə/ (listen); Telugu: [ˈtelaŋɡaːɳa], Urdu: [ˈtɪləŋɡɑːna] (listen)) is a state in India situated on the south-central stretch of the Indian peninsula on the high Deccan Plateau. It is the eleventh-largest state and the twelfth-most populated state in India with a geographical area of 112,077 km2 (43,273 sq mi) and 35,193,978 residents as per 2011 census. On 2 June 2014, the area was separated from the northwestern part of Andhra Pradesh as the newly formed state of Telangana, with Hyderabad as its capital. Its other major cities include Warangal, Nizamabad, Khammam, Karimnagar and Ramagundam. Telangana is bordered by the states of Maharashtra to the north, Chhattisgarh to the northeast, Karnataka to the west, and Andhra Pradesh to the east and south. The terrain of Telangana consists mostly of the Deccan Plateau with dense forests covering an area of 27,292 km2 (10,538 sq mi). As of 2019, the state of Telangana is divided into 33 districts.\n\nInstruction:\n\nWhen was Telangana created?Answer:\n\n2014\n\n",
    "Context:\n\nDerby Museum and Art Gallery is a museum and art gallery in Derby, England. It was established in 1879, along with Derby Central Library, in a new building designed by Richard Knill Freeman and given to Derby by Michael Thomas Bass. The collection includes a gallery displaying many paintings by Joseph Wright of Derby; there is also a large display of Royal Crown Derby and other porcelain from Derby and the surrounding area. Further displays include archaeology, natural history, geology, military collections and world cultures. The Art Gallery was opened in 1882.\n\nInstruction:\n\nGiven a reference text about Derby Museum and Art Gallery, tell me when the it was established and what the gallery contains.Answer:\n\nThe Derby Museum and Art Gallery was established in 1879 and includes a gallery with many paintings by Joseph Wright of Derby and other displays with archaeology, natural history, geology, military collections, and world cultures.\n\n",
    "Context:\n\nTardigrades are the first known animal to survive after exposure to outer space. In September 2007, dehydrated tardigrades were taken into low Earth orbit on the FOTON-M3 mission carrying the BIOPAN astrobiology payload. For 10 days, groups of tardigrades, some of them previously dehydrated, some of them not, were exposed to the hard vacuum of outer space, or vacuum and solar UV radiation. Back on Earth, more than 68% of the subjects protected from solar UV radiation were reanimated within 30 minutes following rehydration, although subsequent mortality was high; many of these produced viable embryos. In contrast, hydrated samples exposed to the combined effect of vacuum and full solar UV radiation had significantly reduced survival, with only three subjects of Milnesium tardigradum surviving. Also, it was found that the space vacuum did not have a significant effect on egg-laying in either R. coronifer or M. tardigradum. However, M. tardigradum exposed to UV radiation had a lower egg laying rate. In May 2011, Italian scientists sent tardigrades on board the International Space Station along with extremophiles on STS-134, the final flight of Space Shuttle Endeavour. Their conclusion was that microgravity and cosmic radiation \"did not significantly affect survival of tardigrades in flight, and stated that tardigrades represent a useful animal for space research.\" In November 2011, they were among the organisms to be sent by the U.S.-based Planetary Society on the Russian Fobos-Grunt mission's Living Interplanetary Flight Experiment to Phobos; however, the launch failed. In August 2019, scientists reported that a capsule containing tardigrades in a cryptobiotic state may have survived for a while on the Moon after the April 2019 crash landing of Beresheet, a failed Israeli lunar lander, but in May 2021 it was reported that they were unlikely to have survived the impact.\n\nInstruction:\n\nBased on this paragraph on Tardigrades when did we first send them to space?Answer:\n\nThe FOTON-M3 mission in September of 2007 is where Tardigrades were exposed to the hard vacuum of outer space for the first time.\n\n",
    "Context:\n\n\"I'm Just a Singer (In a Rock and Roll Band)\" is a 1973 hit single by the English progressive rock band the Moody Blues, written by the band's bassist, John Lodge. It was first released in 1972 as the final track on the album Seventh Sojourn and was later released as a single in 1973, with \"For My Lady\" as its B-side. It was the second single released from Seventh Sojourn, with the first being \"Isn't Life Strange\", which was also written by Lodge.\n\nThe song reached number 12 on the Billboard Hot 100 in the US, becoming one of their highest-charting hits in that country, but fared less well in their native UK, where it managed number 36. It was also the final single released by the Moody Blues prior to their five-year hiatus, which was agreed upon so each of the band members could pursue their own solo careers. Their next single would not be until 1978, with \"Steppin' in a Slide Zone\".\n\nInstruction:\n\nWhen was \"I'm Just a Singer (In a Rock and Roll Band)\" released?Answer:\n\n\"I'm Just a Singer (In a Rock and Roll Band)\" was originally released in 1972 as the final track on the album Seventh Sojourn and was later released as a single in 1973.\n\n",
    "Context:\n\nThe formula defines the energy E of a particle in its rest frame as the product of mass (m) with the speed of light squared (c2). Because the speed of light is a large number in everyday units (approximately 300000 km/s or 186000 mi/s), the formula implies that a small amount of \"rest mass\", measured when the system is at rest, corresponds to an enormous amount of energy, which is independent of the composition of the matter.\n\nInstruction:\n\nGiven this paragraph about Mass–energy equivalence, tell me what each part of the equation E=mc² stands for.Answer:\n\nE is for energy, m is for mass, and c² is for the speed of light squared\n\n",
    "Context:\n\nThe Flex Computer System was developed by Michael Foster and Ian Currie of Royal Signals and Radar Establishment in Malvern, England, during the late 1970s and 1980s. It used a tagged storage scheme to implement a capability architecture, and was designed for the safe and efficient implementation of strongly typed procedures.\n\nInstruction:\n\nGiven this reference text about the Flex Computer System, why was it created?Answer:\n\nIt was designed for the safe and efficient implementation of strongly typed procedures.\n\n",
    "Context:\n\nThe Any Day Now EP is Elbow's third release. This EP was released through Elbow's first record label Ugly Man Records, as well as their second record label V2 Records. Both EPs each have a different track listing.\n\nThe song \"George Lassoes the Moon\" on the Ugly Man Records version of the EP differs from the version on The Noisebox EP. Not only is it a minute shorter, but it also is musically more produced than the rough first version. \"Wurzel\" is an instrumental song.\n\nInstruction:\n\nTell me about the album The Any Day NowAnswer:\n\nThe Any Day Now EP is Elbow's third release. This EP was released through Elbow's first record label Ugly Man Records, as well as their second record label V2 Records. Both EPs each have a different track listing.\n\nThe song \"George Lassoes the Moon\" on the Ugly Man Records version of the EP differs from the version on The Noisebox EP. Not only is it a minute shorter, but it also is musically more produced than the rough first version. \"Wurzel\" is an instrumental song.\n\n",
    "Context:\n\nSM U-30[Note 1] was one of 329 U-boat submarines serving in the Imperial German Navy in World War I. She engaged in commerce warfare as part of the First Battle of the Atlantic. U-30 is significant for the torpedoing of the US tanker Gulflight on 1 May 1915 20 nautical miles (37 km; 23 mi) west of Scilly.\n\nInstruction:\n\nWhat kind of u-boat was the SM U-30Answer:\n\nSM U-30 was one of 329 U-boat submarines serving in the Imperial German Navy in World War I. She engaged in commerce warfare as part of the First Battle of the Atlantic. U-30 is significant for the torpedoing of the US tanker Gulflight on 1 May 1915 20 nautical miles (37 km; 23 mi) west of Scilly.\n\n",
    "Context:\n\nPinot Gris, Pinot Grigio (US: /ˈpiːnoʊ ˈɡriːdʒioʊ, -dʒoʊ/, UK: /ˈɡrɪdʒioʊ/) or Grauburgunder is a white wine grape variety of the species Vitis vinifera. Thought to be a mutant clone of the Pinot Noir variety, it normally has a grayish-blue fruit, accounting for its name, but the grapes can have a brownish pink to black and even white appearance. The word pinot could have been given to it because the grapes grow in small pinecone-shaped clusters. The wines produced from this grape also vary in color from a deep golden yellow to copper and even a light shade of pink, and it is one of the more popular grapes for skin-contact wine.\n\nPinot Gris is grown around the globe, with the \"spicy\" full-bodied Alsatian and lighter-bodied, more acidic Italian styles being most widely recognized. The Alsatian style, often duplicated in New World wine regions such as Marlborough, Tasmania, South Australia, Washington, Oregon, and South Africa tend to have moderate to low acidity, higher alcohol levels and an almost \"oily\" texture that contributes to the full-bodied nature of the wine. The flavors can range from ripe tropical fruit notes of melon and mango to some botrytis-influenced flavors. In Italy, Pinot grigio grapes are often harvested early to retain the refreshing acidity and minimize some of the overt-fruitiness of the variety, creating a more neutral flavor profile. This style is often imitated in other Old World wine regions, such as Germany, where the grape is known as Ruländer, or more commonly, Grauburgunder.\n\nInstruction:\n\nWhat is Pinot Grigio?Answer:\n\nPinot Gris, Pinot Grigio (US: /ˈpiːnoʊ ˈɡriːdʒioʊ, -dʒoʊ/, UK: /ˈɡrɪdʒioʊ/) or Grauburgunder is a white wine grape variety of the species Vitis vinifera. Pinot Gris is grown around the globe, with the \"spicy\" full-bodied Alsatian and lighter-bodied, more acidic Italian styles being most widely recognized.\n\n",
    "Context:\n\nJiang Zemin (17 August 1926 – 30 November 2022) was a Chinese politician who served as general secretary of the Chinese Communist Party (CCP) from 1989 to 2002, as chairman of the Central Military Commission from 1989 to 2004, and as president of China from 1993 to 2003. Jiang was paramount leader of China from 1989 to 2002. He was the core leader of the third generation of Chinese leadership, one of four core leaders alongside Mao Zedong, Deng Xiaoping and Xi Jinping.\n\nBorn in Yangzhou, Jiangsu, Jiang joined the CCP while he was in college. After the establishment of the People's Republic of China in 1949, he received training at the Stalin Automobile Works in Moscow in the 1950s, later returning to Shanghai in 1962 to serve in various institutes, later being sent between 1970-1972 to Romania as part of an expert team to establish machinery manufacturing plants in the country. After 1979, he was appointed as the vice chair of two commissions by vice premier Gu Mu to oversee the newly-established special economic zones (SEZs). He became the vice minister of the newly-established Ministry of Electronics Industry and a member of the CCP Central Committee in 1982.\n\nJiang was appointed as the mayor of Shanghai in 1985, later being promoted to its Communist Party secretary, as well as a member of the CCP Politburo, in 1987. Jiang came to power unexpectedly as a compromise candidate following the 1989 Tiananmen Square protests and massacre, when he replaced Zhao Ziyang as CCP general secretary after Zhao was ousted for his support for the student movement. As the involvement of the \"Eight Elders\" in Chinese politics steadily declined, Jiang consolidated his hold on power to become the \"paramount leader\" in the country during the 1990s. Urged by Deng Xiaoping's southern tour in 1992, Jiang officially introduced the term \"socialist market economy\" in his speech during the 14th CCP National Congress held later that year, which accelerated \"opening up and reform\".\n\nUnder Jiang's leadership, China experienced substantial economic growth with the continuation of market reforms. The returning of Hong Kong from the United Kingdom in 1997 and of Macau from Portugal in 1999, and entry into the World Trade Organisation in 2001, were landmark moments of his era. China also witnessed improved relations with the outside world, while the Communist Party maintained its tight control over the state. Jiang faced criticism over human rights abuses, including the crackdown on the Falun Gong movement. His contributions to party doctrine, known as the \"Three Represents\", were written into the CCP constitution in 2002. Jiang gradually vacated his official leadership titles from 2002 to 2005, being succeeded in these roles by Hu Jintao, although he and his political faction continued to influence affairs until much later. On 30 November 2022, Jiang died from leukemia and multiple organ failure in Shanghai.\n\nInstruction:\n\nWhat was Jiang's previous position before becoming the president of China?Answer:\n\nHe was the mayor of Shanghai and then became Communist Party secretary\n\n",
    "Context:\n\nA hot dog (commonly spelled hotdog) is a food consisting of a grilled or steamed sausage served in the slit of a partially sliced bun. The term hot dog can refer to the sausage itself. The sausage used is a wiener (Vienna sausage) or a frankfurter (Frankfurter Würstchen, also just called frank). The names of these sausages commonly refer to their assembled dish. Some consider a hot dog to technically be a sandwich. Hot dog preparation and condiments vary worldwide. Typical condiments include mustard, ketchup, relish, onions in tomato sauce, and cheese sauce. Common garnishes include sauerkraut, diced onions, jalapeños, chili, grated cheese, coleslaw, bacon, and olives. Hot dog variants include the corn dog and pigs in a blanket. The hot dog's cultural traditions include the Nathan's Hot Dog Eating Contest and the Oscar Mayer Wienermobile.\n\nThese types of sausages were culturally imported from Germany and became popular in the United States. It became a working-class street food in the U.S., sold at stands and carts. The hot dog became closely associated with baseball and American culture. Although particularly connected with New York City and its cuisine, the hot dog eventually became ubiquitous throughout the US during the 20th century. Its preparation varies regionally in the country, emerging as an important part of other regional cuisines, including Chicago street cuisine.\n\nInstruction:\n\nWhat are the common toppings that can go on a hotdog?Answer:\n\nCommon toppings or garnishes include sauerkraut, diced onions, jalapeños, chili, grated cheese, coleslaw, bacon, and olives\n\n",
    "Context:\n\nThe Seven Wonders of the Ancient World, also known as the Seven Wonders of the World or simply the Seven Wonders, is a list of seven notable structures present during classical antiquity. The first known list of seven wonders dates back to the 2nd–1st century BC.\n\nWhile the entries have varied over the centuries, the seven traditional wonders are the Great Pyramid of Giza, the Colossus of Rhodes, the Lighthouse of Alexandria, the Mausoleum at Halicarnassus, the Temple of Artemis, the Statue of Zeus at Olympia, and the Hanging Gardens of Babylon. Using modern-day countries, two of the wonders were located in Greece, two in Turkey, two in Egypt, and one in Iraq. Of the seven wonders, only the Pyramid of Giza, which is also by far the oldest of the wonders, still remains standing, with the others being destroyed over the centuries. There is scholarly debate over the exact nature of the Hanging Gardens, and there is doubt as to whether they existed at all.\n\nInstruction:\n\nWhat are the seven wonders of the world?Answer:\n\nThe seven wonders of the world consist of; the Great Pyramid of Giza, The Colossus of Rhodes, the Lighthouse of Alexandria, the Mausoleum at Halicarnassus, the Temple of Artemis, the Statue of Zeus at Olympia, and the Hanging Gardens of Babylon.\n\n",
    "Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nInstruction:\n\nHow are racial categories used historically?Answer:\n\nHistorically, oppressive groups use racial categories to discriminate against other groups that are different from them.\n\n",
    "Context:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nWrestling career\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. He had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\nInstruction:\n\nWas Wilbur Snyder a good wrestlerAnswer:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. \n\nHe had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\n",
    "Context:\n\nFairmont has a humid continental climate (Köppen Dfa) with very warm summers and freezing winters. However, it is not uncommon during winter for warm air from the Gulf of Mexico to raise temperatures above 50 °F or 10 °C, which occurs on average six times each January and over eight in December and February. In contrast, when very cold air from Canada moves into West Virginia temperatures can go below 0 °F or −17.8 °C, which can be expected during 3.2 mornings each winter, but which occurred on twelve mornings during the extremely cold January 1977, whose average temperature of 16.0 °F or −8.9 °C was the coldest month on record by 4.0 °F or 2.2 °C. Despite the abundant precipitation throughout the year, the relative dryness of cold air means that most precipitation is rain even during the winter: the most snowfall in a month being 46.5 inches (1.18 m) is November 1950, and the most in a season 77.4 inches (1.97 m) between July 1950 and June 1951. The least snow in a season has been 12.0 inches (0.30 m) between July 1918 and June 1919, whilst the wettest calendar year has been 1956 with 58.12 inches (1,476.2 mm) and the driest – as with all of West Virginia – 1930 with 26.25 inches (666.8 mm). The hottest temperature has been 108 °F (42.2 °C) on August 8, 1918, and the coldest −21 °F (−29.4 °C) on January 21, 1994.\n\nInstruction:\n\nGiven this paragraph about the climate in Fairmont, West Virginia, what was the coldest month in the city's history, and what was the average temperature during that month?Answer:\n\nJanuary of 1977 was the coldest month in the history of Fairmont, West Virginia with an average of 16.0 degrees Farenheit.\n\n",
    "Context:\n\nThe Malibamat'so River is a river in northern Lesotho. Its origin is near to the South African border, where it drains the eastern slopes of the Maloti Range. It flows southwards past the village of Lejone, and eventually joins the Senqu River 5 kilometres (3.1 mi) northeast of Mohlanapeng.\n\nThe Malibamat'so forms the northern arm of the Katse Dam reservoir, a part of the Lesotho Highlands Water Project. Katse is Africa's highest elevation dam at 1,993 metres (6,539 ft) above sea level. Here the river is joined by the Bokong/Bokung River. Downstream the Malibamat'so's left bank tributaries are the Matsoku and Semenanyane Rivers, before it forms a right bank tributary of the Senqu/Orange River.\n\nInstruction:\n\nHave you heard of Malibamat'so River and where does it flow?Answer:\n\nYes, the Malibamat'so River is a river in northern Lesotho. Its origin is near the South African border, where it drains the eastern slopes of the Maloti Range.\n\n",
    "Context:\n\nBNP Paribas is a French international banking group, founded in 2000 from the merger between Banque Nationale de Paris (BNP, \"National Bank of Paris\") and Paribas, formerly known as the Banque de Paris et des Pays-Bas. The full name of the group's parent entity is BNP Paribas S.A.\n\nWith 190,000 employees as of February 2021, the bank is organized into three major business areas: Commercial, Personal Banking & Services (CPBS), Investment & Protection Services (IPS) and Corporate & Institutional Banking (CIB). The group is listed on the first market of Euronext Paris and a component of the Euro Stoxx 50 stock market index, while it also included in the French CAC 40 index.\n\nBNP Paribas is the second largest banking group in Europe, after HSBC, and ninth largest banking group in the world (by assets, December 2021). It became one of the five largest banks in the world following the 2008 financial crisis. Despite some legal difficulties in 2014, including being fined the largest ever sum as reparation for violating U.S. sanctions, it remains one of the ten largest banks worldwide. It is considered a systemically important bank by the Financial Stability Board.\n\nInstruction:\n\nCould you describe who is BNP Paribas (BNPP)?Answer:\n\nBNP Paribas alias BNPP is a French Banking group. In 2022 they made 50.4 billion euros of revenue and 10.2 billion euros of net income.\n\n",
    "Context:\n\nIndermaur works as a marketing specialist for her husband's technical trading company and is the chief executive officer of Comate, a marketing agency.\n\nInstruction:\n\nDoes Indermaur work as CTO, CEO, or CFO?Answer:\n\nCEO\n\n",
    "Context:\n\nShōrin-ryū is generally characterized by natural breathing, natural (narrow, high) stances, and circular, rather than direct movements. Shōrin-ryū practitioners assert that correct motion, moving quickly to evade violence with fluid movements and flexible positions are important, and that a solid structure is vital for powerful blocks and strikes. Stances that are too deep generally make body movement difficult. Another feature in this system is how the student is taught to punch. Generally, there is neither a horizontal nor vertical punch in Shōrin-ryū. Punches are slightly canted to the inside (Isshin-ryū), with the largest knuckle of the forefinger (third from the tip) in vertical alignment with the second knuckle of the pinky finger. It is believed that this position is key in lining up the bones of the arm and creates a faster, more stable and powerful strike.\n\nInstruction:\n\nGiven the following note about training in a specific style of karate, tell me why its practitioners consider its fist alignment to offer advantages for their striking.Answer:\n\nPractitioners of Shōrin-ryū believe lining up the second and third knuckle, along with the bones of the arm, enables them to deliver faster and more powerful punches.\n\n",
    "Context:\n\nPlatylesches robustus, the robust hopper or large hopper, is a butterfly of the family Hesperiidae. It is found in Zululand, Eswatini, Transvaal, Mozambique and Zimbabwe. The habitat consists of moist, frost-free savanna and the transitional zone between forest and Guinea savanna.\n\nInstruction:\n\nGiven this paragraph about Platylesches Robustus, what type of insect is it and how many countries can it be found?Answer:\n\nThe Platylesches robustus is a butterfly and it can be found in five different countries.\n\n",
    "Context:\n\nThe Walt Disney Company, commonly known as Disney (/ˈdɪzni/), is an American multinational, mass media and entertainment conglomerate that is headquartered at the Walt Disney Studios complex in Burbank, California. Disney was founded on October 16, 1923, by brothers Walt and Roy O. Disney as Disney Brothers Studio; it also operated under the names Walt Disney Studio and Walt Disney Productions before changing its name to The Walt Disney Company in 1986. Early in its existence, the company established itself as a leader in the animation industry, with the creation of the widely popular character Mickey Mouse, who first appeared in Steamboat Willie, which used synchronized sound, to become the first post-produced sound cartoon. The character would go on to become the company's mascot.\n\nInstruction:\n\nGiven this paragraph, where is The Walt Disney Company headquarters?Answer:\n\nAccording to this text, The Walt Disney Company is headquartered in Burbank, California.\n\n",
    "Context:\n\nSushi (すし, 寿司, 鮨, 鮓, pronounced [sɯɕiꜜ] or [sɯꜜɕi]) is a Japanese dish of prepared vinegared rice (鮨飯, sushi-meshi), usually with some sugar and salt, accompanied by a variety of ingredients (ねた, neta), such as seafood, often raw, and vegetables. Styles of sushi and its presentation vary widely, but the one key ingredient is \"sushi rice\", also referred to as shari (しゃり), or sumeshi (酢飯).\n\nThe inventor of modern sushi is believed to be Hanaya Yohei, who invented nigiri-zushi, a type of sushi most known today, in which seafood is placed on hand-pressed vinegared rice, around 1824 in the Edo period (1603–1867). It was the fast food of the chōnin class in the Edo period.\n\nSushi is traditionally made with medium-grain white rice, though it can be prepared with brown rice or short-grain rice. It is very often prepared with seafood, such as squid, eel, yellowtail, salmon, tuna or imitation crab meat. Many types of sushi are vegetarian. It is often served with pickled ginger (gari), wasabi, and soy sauce. Daikon radish or pickled daikon (takuan) are popular garnishes for the dish.\n\nSushi is sometimes confused with sashimi, a similar dish in Japanese cuisine that consists of thinly sliced raw fish or occasionally meat.\n\nInstruction:\n\nWhat is a Japanese dish of prepared rice, usually with some sugar and salt, accompanied by a variety of ingredients, such as seafood, often raw, and vegetables?Answer:\n\nSushi is the answer to the question.\n\n",
    "Context:\n\nThe Call to Adventure\nThe hero begins in a situation of normality from which some information is received that acts as a call to head off into the unknown. According to Campbell, this region is represented by\n\na distant land, a forest, a kingdom underground, beneath the waves, or above the sky, a secret island, lofty mountaintop, or profound dream state; but it is always a place of strangely fluid and polymorphous beings, unimaginable torments, superhuman deeds, and impossible delight. The hero can go forth of their own volition to accomplish the adventure, as did Theseus when he arrived in his father's city, Athens, and heard the horrible history of the Minotaur; or they may be carried or sent abroad by some benign or malignant agent as was Odysseus, driven about the Mediterranean by the winds of the angered god, Poseidon. The adventure may begin as a mere blunder... or still, again, one may be only casually strolling when some passing phenomenon catches the wandering eye and lures one away from the frequented paths of man. Examples might be multiplied, ad infinitum, from every corner of the world.\n\nInstruction:\n\nWhat is one of Poseidon's many powers?Answer:\n\nPoseidon has power to control the winds that guide ships on the seas of the Mediterranean.\n\n",
    "Context:\n\nSanta Barbara is a coastal city in Santa Barbara County, California, of which it is also the county seat. Situated on a south-facing section of coastline, the longest such section on the West Coast of the United States, the city lies between the steeply rising Santa Ynez Mountains and the Pacific Ocean. Santa Barbara's climate is often described as Mediterranean, and the city has been dubbed \"The American Riviera\".\n\nInstruction:\n\nGiven this paragraph, can you tell me why Santa Barbara is referred to as The American Riviera?Answer:\n\nSanta Barbara is referred to as The American Riviera because of it's temperate climate and south-facing orientation to the coastline.\n\n",
    "Context:\n\nNatural hydrogen (known as white hydrogen), is naturally occurring molecular hydrogen on or in Earth (as opposed to hydrogen produced in the laboratory or in industry). The name white hydrogen distinguishes it from green hydrogen, which is produced from renewable energy sources, and from grey, brown or black hydrogen, which is obtained from fossil sources or from the electrolysis of water. Natural hydrogen may be renewable, non-polluting and allows for lower cost operation compared to industrial hydrogen. Natural hydrogen has been identified in many source rocks in areas beyond the sedimentary basins where oil companies typically operate.\n\nOrigin of natural hydrogen\nThere are several sources of natural hydrogen:\n\n- degassing of deep hydrogen from the Earth's crust and mantle;\n- reaction of water with ultrabasic rocks (serpentinisation);\n- contact of water with reducing agents in the Earth's mantle;\n- interaction of water with freshly exposed rock surfaces (weathering);\n- decomposition of hydroxyl ions in the structure of minerals;\n- Natural radiolysis of water;\n- decomposition of organic matter;\n- biological activity\n- Extraction\n- Natural hydrogen is extracted from wells, mixed with other gases such as nitrogen or helium.\n\nSeveral sources have been identified in France. Geologists Alain Prinzhofer and Eric Derville have demonstrated the existence of large reservoirs in a dozen countries, including Mali and the United States. However, their potential remains difficult to assess.\n\nNumerous emanations on the ocean floor have been identified but are difficult to exploit. The discovery of a significant emergence in Russia in 2008 suggests the possibility of extracting native hydrogen in geological environments.\n\nGeology\nNatural hydrogen is generated continuously from a variety of natural sources. There are many known hydrogen emergences on mid-ocean ridges. Another of the known reactions, serpentinisation, occurs under the sea floor (in the oceanic crust).\n\nDiagenetic origin (iron oxidation) in the sedimentary basins of cratons, notably in Russia. Other sources are being explored, such as mantle hydrogen, or hydrogen from radiolysis (natural electrolysis) or from bacterial activity. In France, the Alps and Pyrenees are suitable for exploitation. New Caledonia has hyperalkaline sources that show dihydrogen emissions. A large accumulation of natural hydrogen was discovered in Bourakebougou (Mali).\n\nCharacteristics\nDihydrogen is very soluble in fresh water, especially at depth (solubility increases with pressure).\n\nhttps://en.wikipedia.org/wiki/Natural_hydrogen\n\nInstruction:\n\nGiven these paragraphs about Natural hydrogen, what are other forms of hydrogen obtained using different processes?Answer:\n\nGreen hydrogen, which is produced from renewable energy sources, and from grey, brown or black hydrogen, which is obtained from fossil sources or from the electrolysis of water.\n\n",
    "Context:\n\nSwarcliffe Hall is a large hall that was constructed in 1800 in Birstwith, near Harrogate, England. The current house was built by John Greenwood in 1850, who engaged Major Rohde Hawkins as his architect, and is a Grade II listed building.\n\nThe original Swarcliffe Hall was built on the site c1800 by the Blessard family, however the current hall which was built by the Greenwood family was completed in 1850. Charlotte Brontë was employed as a governess at the hall in 1839 and it is said her time spent there helped inspire her novel Jane Eyre.\n\nPrince Albert Victor, Duke of Clarence and Avondale visited the hall in 1888 and again during the following year whilst opening the New Bath Hospital in nearby Harrogate.\n\nInstruction:\n\nWhich duke visited Swarcliffe Hall in 1888?Answer:\n\nPrince Albert Victor\n\n",
    "Context:\n\nEndpoints are important aspects of interacting with server-side web APIs, as they specify where resources lie that can be accessed by third party software. Usually the access is via a URI to which HTTP requests are posted, and from which the response is thus expected. Web APIs may be public or private, the latter of which requires an access token.\n\nEndpoints need to be static, otherwise the correct functioning of software that interacts with it cannot be guaranteed. If the location of a resource changes (and with it the endpoint) then previously written software will break, as the required resource can no longer be found at the same place. As API providers still want to update their web APIs, many have introduced a versioning system in the URI that points to an endpoint.\n\nInstruction:\n\nWhat is an API endpoint?Answer:\n\nEndpoints specify where resources lie that can be accessed by third party software. Clients use endpoints to interact with server-side web APIs.\n\n",
    "Context:\n\nBityla sericea is a species of moth in the family Noctuidae. This species is endemic to New Zealand. It is classified as \"At Risk, Naturally Uncommon\" by the New Zealand Department of Conservation. This species was first described by Arthur Gardiner Butler in 1877 using a specimen obtained from John Enys and collected in the South Island. George Hudson discussed and illustrated this species both in his 1898 book, New Zealand moths and butterflies (Macro-lepidoptera) and his 1928 publication The Butterflies and Moths of New Zealand. In 1905 Hudson, thinking he was describing a new species, also gave the species the name Orthosia pallida. George Francis Hampson, also mistakenly believing this was a separate species placed O. pallida in the genus Bityla. Hudson discussed B. pallida in his 1928 publication. John S. Dugdale synonymised B. pallida with B. sericea in 1988. The holotype specimen of B. sericea is held at the Natural History Museum, London.\n\nInstruction:\n\nGiven the reference text about moths, what family does Bityla sericea belong to?Answer:\n\nNoctuidae\n\n",
    "Context:\n\nWashington's death came more swiftly than expected. On his deathbed, out of fear of being entombed alive, he instructed his private secretary Tobias Lear to wait three days before his burial. According to Lear, Washington died between 10 p.m. and 11 p.m. on December 14, 1799, with Martha seated at the foot of his bed. His last words were \"'Tis well\", from his conversation with Lear about his burial. He was 67.\n\nInstruction:\n\nIn what year did George Washington die and how old was he?Answer:\n\nGeorge Washington died in the year 1799 at the age of 67.\n\n",
    "Context:\n\nSwift is known for her love of cats. Her pet cats have been featured in her visual works, and one of them is the third richest pet animal in the world with an estimated $97 million net worth.\n\nInstruction:\n\nWhat is the net worth of one of Taylor Swift's cats?Answer:\n\nOne of Taylor Swift's cats is the third richest pet animal in the world, and it's estimated net worth is $97 million.\n\n",
    "Context:\n\nHawaii (/həˈwaɪi/ (listen) hə-WY-ee; Hawaiian: Hawaiʻi [həˈvɐjʔi] or [həˈwɐjʔi]) is a state in the Western United States, about 2,000 miles (3,200 km) from the U.S. mainland in the Pacific Ocean. It is the only U.S. state outside North America, the only state that is an archipelago, and the only state in the tropics.\n\nHawaii comprises nearly the entire Hawaiian archipelago, 137 volcanic islands spanning 1,500 miles (2,400 km) that are physiographically and ethnologically part of the Polynesian subregion of Oceania. The state's ocean coastline is consequently the fourth-longest in the U.S., at about 750 miles (1,210 km). The eight main islands, from northwest to southeast, are Niʻihau, Kauaʻi, Oʻahu, Molokaʻi, Lānaʻi, Kahoʻolawe, Maui, and Hawaiʻi—the last of these, after which the state is named, is often called the \"Big Island\" or \"Hawaii Island\" to avoid confusion with the state or archipelago. The uninhabited Northwestern Hawaiian Islands make up most of the Papahānaumokuākea Marine National Monument, the United States' largest protected area and the fourth-largest in the world.\n\nInstruction:\n\nAccording to this paragraph, what is the only state in North America that is an archpelago?Answer:\n\nHawaii is the only state in North America that is an archipelago, according to this text.\n\n",
    "Context:\n\nThe Boston Marathon began on 19 April 1897, and was inspired by the success of the first marathon competition in the 1896 Summer Olympics. It is the world's oldest run annual marathon, and ranks as one of the world's most prestigious road racing events. Its course runs from Hopkinton in southern Middlesex County, to Copley Square in Boston. Johnny Hayes' victory at the 1908 Summer Olympics also contributed to the early growth of long-distance running and marathoning in the United States. Later that year, races around the holiday season including the Empire City Marathon held on New Year's Day 1909 in Yonkers, New York, marked the early running craze referred to as \"marathon mania\". Following the 1908 Olympics, the first five amateur marathons in New York City were held on days that held special meanings: Thanksgiving Day, the day after Christmas, New Year's Day, Washington's Birthday, and Lincoln's Birthday.\n\nFrank Shorter's victory in the marathon at the 1972 Summer Olympics would spur national enthusiasm for the sport more intense than that which followed Hayes' win 64 years earlier. In 2014, an estimated 550,600 runners completed a marathon within the United States. This can be compared to 143,000 in 1980. Today marathons are held all around the world on a nearly weekly basis.\n\nInstruction:\n\nWhat is the world's oldest annual marathon based on the reference text below?Answer:\n\nThe Boston Marathon is the world's oldest annual marathon, beginning on April 19th 1897.\n\n",
    "Context:\n\nElizabeth II (Elizabeth Alexandra Mary; 21 April 1926 – 8 September 2022) was Queen of the United Kingdom and other Commonwealth realms from 6 February 1952 until her death in 2022. She was queen regnant of 32 sovereign states during her lifetime and was head of state of 15 realms at the time of her death. Her reign of 70 years and 214 days was the longest of any British monarch and the longest verified reign of any female monarch in history.\n\nInstruction:\n\nWho was Elizabeth II?Answer:\n\nElizabeth II was the queen of the United Kingdom and the longest-reigning monarch.\n\n",
    "Context:\n\nIstván Szalay (22 March 1944 – 1 September 2022) was a Hungarian mathematician and politician. A member of the Hungarian Socialist Party, he served in the National Assembly from 1998 to 2002. Prior to that, he was mayor of Szeged from 1994 to 1998.\n\nSzalay died on 1 September 2022, at the age of 78.\n\nInstruction:\n\nWho is István Szalay?Answer:\n\nIstván Szalay was a Hungarian mathematician and politician.\n\n",
    "Context:\n\nIn 1950s Japan, university professor Tatsuo Kusakabe and his daughters Satsuki and Mei (approximately ten and four years old, respectively) move into an old house close to the hospital where the girls' mother Yasuko is recovering from a long-term illness. The house is inhabited by small, dark, dust-like house spirits called susuwatari, which can be seen when moving from bright places to dark ones.[note 1] When the girls become comfortable in their new house, the susuwatari leave to find another empty house. Mei later discovers two small spirits who lead her into the hollow of a large camphor tree. She befriends a larger spirit, which identifies itself using a series of roars she interprets as \"Totoro\". Mei thinks Totoro is the troll from her illustrated book Three Billy Goats Gruff, with her mispronouncing troll. Mei falls asleep atop Totoro but when Satsuki finds her, she is on the ground. Despite many attempts, Mei cannot show her family Totoro's tree. Tatsuo comforts her by telling her Totoro will reveal himself when he wants to.\n\nInstruction:\n\nWho are the little Japanese girls who find Totoro?Answer:\n\nMei and Satsuki are the two Japanese girls who discover Totoro in the famous Japanese anime My Neighbour Totoro.\n\n",
    "Context:\n\nThe Wagner Group (Russian: Группа Вагнера, tr. Gruppa Vagnera), also known as PMC Wagner (Russian: ЧВК «Вагнер», tr. ChVK «Vagner»; lit. 'Wagner Private Military Company'), is a Russian paramilitary organization. It is variously described as a private military company (PMC), a network of mercenaries, or a de facto private army of Russian President Vladimir Putin. The group operates beyond the law in Russia, where private military contractors are officially forbidden\n\nInstruction:\n\nWho are the Wagner groupAnswer:\n\nThey are a private military organization that is endorsed by Russian President Vladimir Putin and is being used in the ongoing war against Ukraine.\n\n",
    "Context:\n\nThe Himalayas, or Himalaya (/ˌhɪməˈleɪ.ə, hɪˈmɑːləjə/; Sanskrit: [ɦɪmaːlɐjɐ]; from Sanskrit himá 'snow, frost', and ā-laya 'dwelling, abode'), is a mountain range in Asia, separating the plains of the Indian subcontinent from the Tibetan Plateau. The range has some of the planet's highest peaks, including the very highest, Mount Everest. Over 100 peaks exceeding 7,200 m (23,600 ft) in elevation lie in the Himalayas.\n\nInstruction:\n\nWhere are Himayalas located?Answer:\n\nThe Himalayan mountain range is located in South East Asia. It spans India, Pakistan and Nepal.\n\n",
    "Context:\n\nBubble tea (also known as pearl milk tea, bubble milk tea, tapioca milk tea, boba tea, or boba; Chinese: 珍珠奶茶; pinyin: zhēnzhū nǎichá, 波霸奶茶; bōbà nǎichá) is a tea-based drink that originated in Taiwan in the early 1980s. Taiwanese immigrants brought it to the United States in the 1990s, initially in California through regions like Los Angeles County, but the drink has also spread to other countries where there is a large East Asian diaspora population.\n\nBubble tea most commonly consists of tea accompanied by chewy tapioca balls (\"boba\" or \"pearls\"), but it can be made with other toppings as well, such as grass jelly, aloe vera, red bean, or popping boba. It has many varieties and flavors, but the two most popular varieties are pearl black milk tea and pearl green milk tea (\"pearl\" signifies the tapioca balls at the bottom).\n\nInstruction:\n\nWhat is Bubble tea?Answer:\n\nBoba tea is a very delicious drink originally from Taiwan. It started with cold milk tea with tapioca balls in the early 1990s. When the demand gets so popular, the boba tea store owner tries to be fancier by adding different toppings such as grass jelly, pudding cluster, aloe vera, red beans, gummy, mochi and fruit bites. In addition, many store owners become more creative by using different flavors of tea (black, green, oolong, jasmine and other fragrance tea)  as a drink base to outstand other competitors.\n\n",
    "Context:\n\nManchester City F.C. 3–2 Queens Park Rangers F.C was the final match of the 2011–12 Premier League season, contested at the Etihad Stadium between Manchester City and Queens Park Rangers on 13 May 2012. This match is considered the greatest Premier League moment in history.\n\nCity entered the match in first place on goal difference, being level on points with local rivals Manchester United, and needed to match United's result to win the league. Meanwhile, QPR entered the match one spot above the relegation zone, knowing that a draw would secure safety at the expense of Bolton Wanderers. City won the match in dramatic fashion, reversing a 2–1 deficit by scoring two goals in stoppage time, with the winner being scored by Sergio Agüero, to clinch their first league title since the 1967–68 season. The win began a period of dominance in English football for City, with the club winning five more Premier League titles over the subsequent 10 years.\n\nThe match, and more specifically the final goal of the match, has repeatedly been described as the greatest moment in Premier League history. The terms \"93:20\" and \"Agueroooooo\" have entered Manchester City folklore as a result, the former describing the exact second of the match at which point the final goal was scored, while the latter was commentator Martin Tyler's live response to the goal.\n\nInstruction:\n\nWhich player scored the Premier League winning goal for Manchester City vs. QPR in 2012?Answer:\n\nSergio Aguero, in his first season for the club following a £30+ million move from Athletico Madrid ended the season as the club's leading goal scorer. Ten plus years later, he ended as the club's all-time leading goal scorer and holds the record for number of Premier League Hat-tricks. \n\nIn 2012, Manchester City and local rivals, Manchester United were leading a two horse race to win the Premier League. Manchester United had previously won the league title 19 times where as this would be Manchester City's first title in over 40 years. \n\nIt was Manchester City's to lose as they hosted relegation-bounded QPR at the Etihad Stadium and all was going to plan going into the first half following Zabaleta's goal to make it 1-0 (an unlikely goal scorer to say the least). \n\nHowever, following a mistake from centre back, Joleon Lescott, a dramatic red card for former Manchester City player, Joey Barton and a surprise second goal from QPR to make it 2-1, Manchester City looked as though they'd let the title slip through their hands. \n\nManchester United had won their away game at Sunderland 1-0 so it was all down the blue half of Manchester's result. \n\nJust after the 90th minute, they were in stoppage time which was extended due to the commotions with Joey Barton lashing out at Carlos Tevez and Sergio Aguero. \n\nStriker, Edin Dzeko, scored a header from a David Silva cross to make it 2-2, but to many, this felt as too little, too late. \n\nLate drama unfolded as Mario Balotelli registered his one and only assist in almost 4 years at the club as he laid it off to Aguero who scored the winning goal with the last kick of the game to make it 3-2. \n\nManchester City went on to win the league and QPR avoided relegation despite the loss due to results elsewhere.\n\n",
    "Context:\n\nGreater London's population declined in the decades after the Second World War, from an estimated peak of 8.6 million in 1939 to around 6.8 million in the 1980s. The principal ports for London moved downstream to Felixstowe and Tilbury, with the London Docklands area becoming a focus for regeneration, including the Canary Wharf development. This was born out of London's increasing role as an international financial centre in the 1980s. The Thames Barrier was completed in the 1980s to protect London against tidal surges from the North Sea.\n\nInstruction:\n\nGiven this paragraph about London, give me a reason why the London Docklands became a focus for regeneration in the 1980s.Answer:\n\nOne reason why the London Docklands became a focus for regeneration in the 1980s is that London had an increasing role as an international financial centre.\n\n",
    "Context:\n\nIn the season-opener against the Philadelphia Eagles, Goff threw for 215 yards and two touchdowns, but threw an interception returned for a touchdown as the Lions narrowly lost by a score of 38–35. In the next game against the Washington Commanders, he threw for 256 yards and four touchdowns in a 36–27 victory. In the Week 2 game against Washington, Goff produced his sixth straight home game with two or more passing touchdowns, establishing a Lions franchise record. On October 2, Goff again threw four touchdowns passes, and this time added a tenure-high 378 passing yards during a 48–45 loss to the Seattle Seahawks. Goff finished his second season with the Lions with 4,438 yards, 29 touchdowns, and seven interceptions, starting in all 17 games. Goff was named to his third Pro Bowl as an alternative, replacing Super Bowl bound Jalen Hurts.\n\nInstruction:\n\nWhat was Goff's best game mentioned in the text?Answer:\n\nGoff's best game mentioned in the text was on October 2 when he threw four touchdowns passes, and added a tenure-high 378 passing yards during a 48–45 loss to the Seattle Seahawks.\n\nGoff played another good game against the Washington Commanders, when he threw for 256 yards and four touchdowns in a 36–27 victory, but this performance wasn't as good as the game against the Seahawks because he threw for fewer yards even though he threw for the same amount of touchdowns.\n\nNote that the text is also missing information that would be useful in judging Goff's performance such as QBR, completion percentage, etc.\n\n",
    "Context:\n\nMustard seeds are the small round seeds of various mustard plants. The seeds are usually about 1 to 2 millimetres (0.039 to 0.079 in) in diameter and may be colored from yellowish white to black. They are an important spice in many regional foods and may come from one of three different plants: black mustard (Brassica nigra), brown mustard (B. juncea), or white mustard (Sinapis alba).\n\nGrinding and mixing the seeds with water, vinegar or other liquids creates the yellow condiment known as prepared mustard.\n\nMustard seeds generally take eight to ten days to germinate if placed under the proper conditions, which include a cold atmosphere and relatively moist soil.\n\nInstruction:\n\nHow long does it take for a mustard seed to germinate?Answer:\n\nMustard seeds generally take eight to ten days to germinate if placed under the proper conditions, which include a cold atmosphere and relatively moist soil.\n\n",
    "Context:\n\nThe student life building is called Newcomb Hall. It is home to the Student Activities Center (SAC) and the Media Activities Center (MAC), where student groups can get leadership consulting and use computing and copying resources, as well as several meeting rooms for student groups. Student Council, the student self-governing body, holds meetings Tuesdays at 6:30 p.m. in the Newcomb South Meeting Room. Student Council, or \"StudCo\", also holds office hours and regular committee meetings in the newly renovated Newcomb Programs and Council (PAC) Room. The PAC also houses the University Programs Council and Class Councils. Newcomb basement is home to both the office of the independent student newspaper The Declaration, The Cavalier Daily, and the Consortium of University Publications.\n\nInstruction:\n\nAccording to this paragraph about UVA, what is the PAC room?Answer:\n\nThe PAC room is the Newcomb Programs and Council Room, that also houses the University Programs Council and Class Councils.\n\n",
    "Context:\n\nAs of 2017, Mexico was the 6th most visited country in the world and had the 15th highest income from tourism in the world which is also the highest in Latin America. The vast majority of tourists come to Mexico from the United States and Canada followed by Europe and Asia. A smaller number also come from other Latin American countries. In the 2017 Travel and Tourism Competitiveness Report, Mexico was ranked 22nd in the world, which was 3rd in the Americas.\n\nInstruction:\n\nGiven this question about tourism, what country is the 6th most visited country?Answer:\n\nMexico\n\n",
    "Context:\n\nMontessori classrooms for children from 2+1⁄2 or 3 to 6 years old are often called Children's Houses, after Montessori's first school, the Casa dei Bambini in Rome in 1906. A typical classroom serves 20 to 30 children in mixed-age groups, staffed by a fully trained lead teacher and assistants. Classrooms are usually outfitted with child-sized tables and chairs arranged singly or in small clusters, with classroom materials on child-height shelves throughout the room. Activities are for the most part initially presented by the teacher, after which they may be chosen more or less freely by the children as interest dictates. A teacher's role within a Montessori classroom is to guide and consult students individually by letting each child create their own learning pathway. Classroom materials usually include activities for engaging in practical skills such as pouring and spooning, washing up, scrubbing tables and sweeping. Also materials for the development of the senses, mathematical materials, language materials, music, art and cultural materials, including more science-based activities like 'sink and float', Magnetic and Non magnetic and candle and air.\n\nActivities in Children's Houses are typically hands-on, tactile materials to teach concepts. For example, to teach writing, students use sandpaper letters. These are letters created by cutting letters out of sandpaper and placing them on wooden blocks. The children then trace these letters with their fingers to learn the shape and sound of each letter. Another example is the use of bead chains to teach math concepts, specifically multiplication. Specifically for multiples of 10, there is one bead that represents one unit, a bar of ten beads put together that represents 1×10, then a flat shape created by fitting 10 of the bars together to represent 10×10, and a cube created by fitting 10 of the flats together to represent 10×10×10. These materials help build a concrete understanding of basic concepts upon which much is built in the later years.\n\nInstruction:\n\nExplain the Montessori Method of education in pre-school and kindergartenAnswer:\n\nThe Montessori Method for Education in pre-school and kindergarten is a unique approach to teaching children to build self-confidence and independence. Learning takes place in Children's Houses and are fully staffed with a mixture of qualified teachers and teaching assistants who guide and consult the individual child by letting each child create their own learning pathway. Activities are introduced by the teacher, but there is no requirement for a child to complete the activity until they are ready, as what the child learns is fully guided by an individual child's interest. Classrooms are equipped with child-sized tables and chairs with learning materials on child height shelves. \nEducation covers a variety of areas, for example completing practical tasks including pouring water, washing up, cleaning tables and sweeping floors. They will have access to materials relating to mathematics, languages, music, art and culture. They are taught to learn basic concepts of mathematics and writing through a hands-on approach using tactile materials.\n\n",
    "Context:\n\nRomain Iannetta (born 27 November 1979 in Villecresnes) is a French racing driver who last competed in the GT4 European Series, driving the No. 77 Audi R8 LMS GT4 Evo for Full Motorsport. He also competes part-time in the NASCAR Whelen Euro Series as the driver of the No. 46 Chevrolet Camaro for Marko Stipp Motorsport in the EuroNASCAR PRO class.\n\nHe is the nephew of driver Alain Iannetta who participated in 24 Hours of Le Mans three times (1988, 1989 and 1990).\n\nIn parallel to his passion, Romain is an instructor at the flight school PRO'PULSION (Dreux and Issoire) and driving Ferrari 360 Modena for JMB Racing. He also worked for many auto manufacturers at the launch of new vehicles on the market (Volkswagen, Audi, Citroën, Renault, Alfa Romeo...).\n\nIt began in 2000 in the trade of automotive stunt team CINE CASCADE directed by Jean-Claude Lagnes. It revolves mainly around feature films such as: Le Boulet, Ripoux 3, San Antonio, Hush!, Taxi, 36 Quai des Orfèvres, The Bourne Identity and The Mental Love your father.\n\nHe was awarded the World Stunt Awards in the United States for the best sequence on a vehicle for the year 2003 for the film \"The Bourne Identity\".\n\nInstruction:\n\nWho is Romain IannettaAnswer:\n\nRomain Iannetta (born 27 November 1979 in Villecresnes) is a French racing driver who last competed in the GT4 European Series, driving the No. 77 Audi R8 LMS GT4 Evo for Full Motorsport. He also competes part-time in the NASCAR Whelen Euro Series as the driver of the No. 46 Chevrolet Camaro for Marko Stipp Motorsport in the EuroNASCAR PRO class.\n\nHe is the nephew of driver Alain Iannetta who participated in 24 Hours of Le Mans three times (1988, 1989 and 1990).\n\nIn parallel to his passion, Romain is an instructor at the flight school PRO'PULSION (Dreux and Issoire) and driving Ferrari 360 Modena for JMB Racing. He also worked for many auto manufacturers at the launch of new vehicles on the market (Volkswagen, Audi, Citroen, Renault, Alfa Romeo...).\n\nIt began in 2000 in the trade of automotive stunt team CINE CASCADE directed by Jean-Claude Lagnes. It revolves mainly around feature films such as: Le Boulet, Ripoux 3, San Antonio, Hush!, Taxi, 36 Quai des Orfèvres, The Bourne Identity and The Mental Love your father.\n\nHe was awarded the World Stunt Awards in the United States for the best sequence on a vehicle for the year 2003 for the film The Bourne Identity.\n\n",
    "Context:\n\nA prime number (or a prime) is a natural number greater than 1 that is not a product of two smaller natural numbers. A natural number greater than 1 that is not prime is called a composite number. For example, 5 is prime because the only ways of writing it as a product, 1 × 5 or 5 × 1, involve 5 itself. However, 4 is composite because it is a product (2 × 2) in which both numbers are smaller than 4. Primes are central in number theory because of the fundamental theorem of arithmetic: every natural number greater than 1 is either a prime itself or can be factorized as a product of primes that is unique up to their order.\n\nThe property of being prime is called primality. A simple but slow method of checking the primality of a given number \n�\nn, called trial division, tests whether \n�\nn is a multiple of any integer between 2 and \n�\n{\\sqrt {n}}. Faster algorithms include the Miller–Rabin primality test, which is fast but has a small chance of error, and the AKS primality test, which always produces the correct answer in polynomial time but is too slow to be practical. Particularly fast methods are available for numbers of special forms, such as Mersenne numbers. As of December 2018 the largest known prime number is a Mersenne prime with 24,862,048 decimal digits.\n\nThere are infinitely many primes, as demonstrated by Euclid around 300 BC. No known simple formula separates prime numbers from composite numbers. However, the distribution of primes within the natural numbers in the large can be statistically modelled. The first result in that direction is the prime number theorem, proven at the end of the 19th century, which says that the probability of a randomly chosen large number being prime is inversely proportional to its number of digits, that is, to its logarithm.\n\nSeveral historical questions regarding prime numbers are still unsolved. These include Goldbach's conjecture, that every even integer greater than 2 can be expressed as the sum of two primes, and the twin prime conjecture, that there are infinitely many pairs of primes having just one even number between them. Such questions spurred the development of various branches of number theory, focusing on analytic or algebraic aspects of numbers. Primes are used in several routines in information technology, such as public-key cryptography, which relies on the difficulty of factoring large numbers into their prime factors. In abstract algebra, objects that behave in a generalized way like prime numbers include prime elements and prime ideals.\n\nInstruction:\n\nGiven the following text, what is special about Prime Numbers?Answer:\n\nA prime number is a natural number great than one that is only divisible by itself and one. e.g. 5 is a prime number as it is only divisible by 5 and 1, but 4 is not as 4 is divisible by 4,2 and 1\n\n",
    "Context:\n\nRobert Toru Kiyosaki (born April 8, 1947) is an American entrepreneur, businessman and author. Kiyosaki is the founder of Rich Global LLC and the Rich Dad Company, a private financial education company that provides personal finance and business education to people through books and videos. The company's main revenues come from franchisees of the Rich Dad seminars that are conducted by independent individuals using Kiyosaki's brand name. He is also the creator of the Cashflow board and software games to educate adults and children about business and financial concepts.\n\nKiyosaki is the author of more than 26 books, including the international self-published personal finance Rich Dad Poor Dad series of books which has been translated into 51 languages and sold over 41 million copies worldwide. Kiyosaki is the subject of a class action suit filed by people who attended his seminars and has been the subject of two investigative documentaries by CBC Canada and WTAE USA. Kiyosaki's company, Rich Global LLC, filed for bankruptcy in 2012.\n\nInstruction:\n\nGiven this paragraph, explain who Robert Kiyosaki is?Answer:\n\nRobert Kiyosaki is an American entrepreneur and author who became famous primarily due to his book Rich Dad Poor Dad which has sold over 41 million copies. He is also the founder of Rich Global LLC and the Rich Dad Company, which provide financial education through books and videos. He is undergoing lawsuits related to these companies which in turn are gaining him more press due to documentaries produced on the subject of these lawsuits.\n\n",
    "Context:\n\nNašiměřice (German: Aschmeritz) is a municipality and village in Znojmo District in the South Moravian Region of the Czech Republic. It has about 200 inhabitants.\n\nNašiměřice lies approximately 28 kilometres (17 mi) north-east of Znojmo, 32 km (20 mi) south-west of Brno, and 189 km (117 mi) south-east of Prague.\n\nInstruction:\n\nWhere is the city of NasimericeAnswer:\n\nNasimerice (German: Aschmeritz) is a municipality and village in Znojmo District in the South Moravian Region of the Czech Republic. It has about 200 inhabitants.\n\nNasimerice lies approximately 28 kilometres (17 mi) north-east of Znojmo, 32 km (20 mi) south-west of Brno, and 189 km (117 mi) south-east of Prague.\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, what are some examples of emergent abilities?Answer:\n\nExamples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\n",
    "Context:\n\nIn June 1955, Gorbachev graduated with a distinction; his final paper had been on the advantages of \"socialist democracy\" (the Soviet political system) over \"bourgeois democracy\" (liberal democracy). He was subsequently assigned to the Soviet Procurator's office, which was then focusing on the rehabilitation of the innocent victims of Stalin's purges, but found that they had no work for him. He was then offered a place on an MSU graduate course specializing in kolkhoz law, but declined. He had wanted to remain in Moscow, where Raisa was enrolled in a PhD program, but instead gained employment in Stavropol; Raisa abandoned her studies to join him there.\n\nInstruction:\n\nBased on this passage, in what field did Raisa earn her PhD?Answer:\n\nBased on this passage, Raisa did not earn a PhD. She abandoned her graduate studies in Moscow in order to join Gorbachev in Stavropol.\n\n",
    "Context:\n\nPablo Emilio Escobar Gaviria (/ˈɛskəbɑːr/; Spanish: [ˈpaβlo es.koˈβ̞aɾ]; 1 December 1949 – 2 December 1993) was a Colombian drug lord and narcoterrorist who was the founder and sole leader of the Medellín Cartel. Dubbed \"the king of cocaine\", Escobar was the wealthiest criminal in history, having amassed an estimated net worth of US$30 billion by the time of his death—equivalent to $70 billion as of 2022—while his drug cartel monopolized the cocaine trade into the United States in the 1980s and early 1990s.\n\nInstruction:\n\nGiven this paragraph about Pablo Escobar, how much money did he have when he died?Answer:\n\nPablo Escobar had an estimated net worth of $30B when he died in 1993.\n\n",
    "Context:\n\nLean manufacturing is a production method aimed primarily at reducing times within the production system as well as response times from suppliers and to customers. It is closely related to another concept called just-in-time manufacturing (JIT manufacturing in short). Just-in-time manufacturing tries to match production to demand by only supplying goods which have been ordered and focuses on efficiency, productivity (with a commitment to continuous improvement) and reduction of \"wastes\" for the producer and supplier of goods. Lean manufacturing adopts the just-in-time approach and additionally focuses on reducing cycle, flow and throughput times by further eliminating activities which do not add any value for the customer. Lean manufacturing also involves people who work outside of the manufacturing process, such as in marketing and customer service.\n\nInstruction:\n\nWhat is Lean manufacturingAnswer:\n\nLean is a production method.\n\n",
    "Context:\n\nA chemical structure determination includes a chemist's specifying the molecular geometry and, when feasible and necessary, the electronic structure of the target molecule or other solid. Molecular geometry refers to the spatial arrangement of atoms in a molecule and the chemical bonds that hold the atoms together and can be represented using structural formulae and by molecular models; complete electronic structure descriptions include specifying the occupation of a molecule's molecular orbitals. Structure determination can be applied to a range of targets from very simple molecules (e.g., diatomic oxygen or nitrogen) to very complex ones (e.g., such as protein or DNA).\n\nInstruction:\n\nWhat is a chemical structure?Answer:\n\nA chemical structure determination includes a chemist's specifying the molecular geometry and, when feasible and necessary, the electronic structure of the target molecule or other solid.\n\n",
    "Context:\n\nHorsfieldia nervosa is a species of plant in the family Myristicaceae. It is a tree endemic to Borneo where it is confined to Sarawak.\n\nInstruction:\n\nIs Horsfieldia nervos a plant or animal?Answer:\n\nplant\n\n",
    "Context:\n\nHeat shock proteins (HSP) are a family of proteins produced by cells in response to exposure to stressful conditions. They were first described in relation to heat shock, but are now known to also be expressed during other stresses including exposure to cold, UV light and during wound healing or tissue remodeling. Many members of this group perform chaperone functions by stabilizing new proteins to ensure correct folding or by helping to refold proteins that were damaged by the cell stress. This increase in expression is transcriptionally regulated. The dramatic upregulation of the heat shock proteins is a key part of the heat shock response and is induced primarily by heat shock factor (HSF). HSPs are found in virtually all living organisms, from bacteria to humans.\n\nInstruction:\n\nWhat are Heat Shock proteins?Answer:\n\nHeat shock proteins (HSP) are a family of proteins produced by cells in response to exposure to stressful conditions.\n\n",
    "Context:\n\nThe commercial and geopolitical importance of rivers is not ranked here. As a transportation artery, a river may unite a region commercially and economically, but major rivers, as barriers to travel, may also form political boundaries between states. The Danube, the second longest river in Europe, is notable for flowing through or past ten countries; the Rhine through or past six. The Volga, the longest river in Europe, unites a huge region of European Russia; eleven of the twenty largest cities in Russia lie on its banks. The Loire and the Po unite important regions within France and Italy respectively. The most important rivers in Europe include Rhone, Elbe, Oder, Tagus, Thames, Don and Dnieper, among others.\n\nInstruction:\n\nGiven this paragraph about rivers in Europe, tell me what are the two longest rivers in Europe.Answer:\n\nThe two longest rivers in Europe are the Volga and the Danube.\n\n",
    "Context:\n\nAs told in The Hobbit, Bilbo found the Ring while lost in the tunnels near Gollum's lair. In the first edition, Gollum offers to surrender the Ring to Bilbo as a reward for winning the Riddle Game. When Tolkien was writing The Lord of the Rings, he realized that the Ring's grip on Gollum would never permit him to give it up willingly. He therefore revised The Hobbit: in the second edition, after losing the Riddle Game to Bilbo, Gollum went to get his \"Precious\" to help him kill and eat Bilbo, but found the Ring missing. Deducing from Bilbo's last question—\"What have I got in my pocket?\"—that Bilbo had found the Ring, Gollum chased him through the caves, not realizing that Bilbo had discovered the Ring's power of invisibility and was following him to the cave's mouth. Bilbo escaped Gollum and the goblins by remaining invisible, but he chose not to tell Gandalf and the dwarves that the Ring had made him invisible. Instead he told them a story that followed the first edition: that Gollum had given him the Ring and shown him the way out. Gandalf was immediately suspicious of the Ring, and later forced the real story from Bilbo.\n\nInstruction:\n\nFrom this summary of how Bilbo found the Ring in The Hobbit, how did Bilbo beat Gollum at the Riddle game?Answer:\n\nGollum was unable to answer Bilbo's last question, \"What have I got in my pocket?\".\n\n",
    "Context:\n\nJonathan Young (born September 29, 1944) is a psychologist who became the founding curator of the Joseph Campbell Archives.\n\nBackground\nYoung developed an interest in the teaching functions of stories through early exposure to folklore. He was one of six children in a much-traveled family. His parents read and discussed the lore of each place they visited, such as the Little Mermaid in Copenhagen, the Pied Piper in Hamelin, the Arabian Nights in Baghdad, and the Buddha in India and Japan.\n\nHis graduate studies focused on the psychology of stories, and included work with Viktor Frankl, Rollo May, Abraham Maslow, and Carl Rogers. He earned his PhD in Clinical Psychology from Alliant International University.\n\nCareer\n\nJoseph Campbell with Jonathan Young, 1985.\nYoung is best known for his series of books, Saga: Best New Writings on Mythology. He assisted mythologist Joseph Campbell for several years at seminars. In addition to the Campbell archives, he organized the collections of psychologist James Hillman, and archeologist Marija Gimbutas. As a professor, Young created and chaired the Mythological Studies Department at the Pacifica Graduate Institute, working with Jungian theorists such as Robert Bly, Marion Woodman, Robert A. Johnson, Jean Houston, and Thomas Moore.\n\nIn 1995, Dr. Young launched the Center for Story and Symbol in Santa Barbara, California to continue the work of Joseph Campbell. Through the center's programs, he presents seminars internationally on the uses of mythic stories for therapists, writers, clergy, and teachers. He also teaches the hero's journey in screenwriting programs. He lectures occasionally at universities, such as UCLA, Notre Dame, and Oxford, as well as ongoing courses in Mythopoetics at Pacifica Graduate Institute. He is featured in the History Channel documentary Star Wars: The Legacy Revealed. He also frequently appears on the History Channel and H2 television series Ancient Aliens.\n\nWorks\nSaga: Best New Writings on Mythology\nArticle on Joseph Campbell, The Dictionary of Modern American Philosophers\n\nInstruction:\n\nWho is the psychologist Jonathan YoungAnswer:\n\nJonathan Young (born September 29, 1944) is a psychologist who became the founding curator of the Joseph Campbell Archives.\n\nBackground\nYoung developed an interest in the teaching functions of stories through early exposure to folklore. He was one of six children in a much-traveled family. His parents read and discussed the lore of each place they visited, such as the Little Mermaid in Copenhagen, the Pied Piper in Hamelin, the Arabian Nights in Baghdad, and the Buddha in India and Japan.\n\nHis graduate studies focused on the psychology of stories, and included work with Viktor Frankl, Rollo May, Abraham Maslow, and Carl Rogers. He earned his PhD in Clinical Psychology from Alliant International University.\n\nCareer\nYoung is best known for his series of books, Saga: Best New Writings on Mythology. He assisted mythologist Joseph Campbell for several years at seminars. In addition to the Campbell archives, he organized the collections of psychologist James Hillman, and archeologist Marija Gimbutas. As a professor, Young created and chaired the Mythological Studies Department at the Pacifica Graduate Institute, working with Jungian theorists such as Robert Bly, Marion Woodman, Robert A. Johnson, Jean Houston, and Thomas Moore.\n\nIn 1995, Dr. Young launched the Center for Story and Symbol in Santa Barbara, California to continue the work of Joseph Campbell. Through the center's programs, he presents seminars internationally on the uses of mythic stories for therapists, writers, clergy, and teachers. He also teaches the hero's journey in screenwriting programs. He lectures occasionally at universities, such as UCLA, Notre Dame, and Oxford, as well as ongoing courses in Mythopoetics at Pacifica Graduate Institute. He is featured in the History Channel documentary Star Wars: The Legacy Revealed. He also frequently appears on the History Channel and H2 television series Ancient Aliens.\n\nWorks\nSaga: Best New Writings on Mythology\nArticle on Joseph Campbell, The Dictionary of Modern American Philosophers\n\n",
    "Context:\n\nThe 1998–99 NBA season was the Hawks' 50th season in the National Basketball Association, and 31st season in Atlanta. On March 23, 1998, the owners of all 29 NBA teams voted 27–2 to reopen the league's collective bargaining agreement, seeking changes to the league's salary cap system, and a ceiling on individual player salaries. The National Basketball Players Association (NBPA) opposed to the owners' plan, and wanted raises for players who earned the league's minimum salary. After both sides failed to reach an agreement, the owners called for a lockout, which began on July 1, 1998, putting a hold on all team trades, free agent signings and training camp workouts, and cancelling many NBA regular season and preseason games. Due to the lockout, the NBA All-Star Game, which was scheduled to be played in Philadelphia on February 14, 1999, was also cancelled. However, on January 6, 1999, NBA commissioner David Stern, and NBPA director Billy Hunter finally reached an agreement to end the lockout. The deal was approved by both the players and owners, and was signed on January 20, ending the lockout after 204 days. The regular season began on February 5, and was cut short to just 50 games instead of the regular 82-game schedule\n\nInstruction:\n\nWhy was there a lockout during the 1998-1999 NBA season?Answer:\n\nThe players and owners failed to reach an agreement on salaries.\n\n",
    "Context:\n\nThe Cerro Arenal Natural Reserve was declared a protected area on November 4, 1991, it compromises one of 78 protected areas of Nicaragua and is managed by Ministry of the Environment and Natural Resources (MARENA).\n\nThe highest point in the reserve is located inside a tropical cloud forest 1,570 meters above sea level, rain occurs 8 months annually, between May and December. Cerro Arenal Natural Reserve is one of the smallest protected areas of Nicaragua and is abundant with flora and fauna.  Many animals are present throughout the reserve, animals such as monkeys, and armadillos. The reserve also contains the oldest oak trees in Central America.\n\nInstruction:\n\nWhere are the oldest oak trees in Central America?Answer:\n\nThe oldest oak trees reside in the Cerro Arenal Natural Reserve, which was officially declared a protected area on November 4, 1991.\n\n",
    "Context:\n\nThe Tesla Model 3 became the world's all-time best-selling electric car in early 2020, and in June 2021 became the first electric car to pass 1 million global sales. Together with other emerging automotive technologies such as autonomous driving, connected vehicles and shared mobility, electric cars form a future mobility vision called Autonomous, Connected, Electric and Shared (ACES) Mobility.\n\nInstruction:\n\nWhen was the Tesla Model 3 unit one million sold?Answer:\n\nJune 2021\n\n",
    "Context:\n\nGrove Park Sidings is a large stabling complex for suburban commuter trains in Lewisham, South East London. It is situated approximately halfway between Hither Green Station and Grove Park station.\n\nGrove Park Sidings were previously named Hither Green Sidings, until sidings closer to Hither Green were built and took that name, causing the site to be renamed Grove Park Sidings.\n\nIt consists of two sets of sidings, one on either side of the Main line which are linked by a pedestrian footbridge. On the Down side are Bramdean sidings and the large carriage shed, whilst on the Up side are St Mildreds sidings. There is also a carriage washing plant on the inlet road of Down sidings.\n\nInstruction:\n\nGiven this paragraph about a train stabling complex, what was the original name of the Grove Park Sidings?Answer:\n\nHither Green Sidings\n\n",
    "Context:\n\nThe Patriots hired head coach Bill Belichick, who had served as defensive coordinator under Parcells including during Super Bowl XXXI, in 2000. Their new home field, Gillette Stadium, opened in 2002 to replace the aging Foxboro Stadium. Long–time starting quarterback Drew Bledsoe, who was the franchise's star throughout the 1990s, went down with a sheared blood vessel in his chest in a week two match–up in 2001 against the rival New York Jets. Backup quarterback Tom Brady, drafted by the Patriots in sixth round of the 2000 NFL draft, became the starting quarterback. Brady's successful play led to Bledsoe never getting his job back as a starter, and would serve as the franchise's starting quarterback for the next 18 years. Under Belichick and Brady, the Patriots became one of the most consistently dominant teams in the NFL, with many describing the team as a \"dynasty\". Within the first few seasons of the 21st century, the team won three Super Bowls in four seasons (2001, 2003, and 2004), over the St. Louis Rams, Carolina Panthers, and Philadelphia Eagles, respectively. The Patriots finished the 2007 regular season with a perfect 16–0 record, becoming only the fourth team in league history to go undefeated in the regular season, and the only one since the league expanded its regular season schedule to 16 games. After advancing to Super Bowl XLII, the team's fourth Super Bowl in seven years, the Patriots were upset by the Giants to end their bid for a 19–0 season. With the loss, the Patriots ended the year at 18–1, becoming only one of three teams to go 18–1 along with the 1984 San Francisco 49ers and the 1985 Chicago Bears. However, both the Bears and 49ers lost their only game during the regular season, and both would win their respective Super Bowl.\n\nThe Patriots returned to the Super Bowl in 2011 but lost again to the Giants, 21–17. In 2014, the Patriots reached a record-tying eighth Super Bowl, where they defeated the defending champion Seattle Seahawks by a score of 28–24 to win Super Bowl XLIX for their fourth title. After Seattle had driven the ball to New England's 1-yard line with under a minute to go, New England rookie cornerback Malcolm Butler made a critical interception on Seattle's final offensive play that helped to seal the victory. New England became the first team to reach nine Super Bowls in the 2016–17 playoffs and faced the Atlanta Falcons in Super Bowl LI. Losing 28–3 midway through the third quarter, the Patriots scored 25 unanswered points to tie the game in the final seconds of regulation. In the first overtime in Super Bowl history, the Patriots won the coin toss and scored a touchdown to claim their fifth Super Bowl victory. The Patriots extended their record to ten Super Bowl appearances in the 2017–18 playoffs but lost to the Philadelphia Eagles in Super Bowl LII. The Patriots returned to the championship game for a third consecutive season in Super Bowl LIII, where they defeated the Los Angeles Rams 13–3 to win their sixth Super Bowl, tying them with the Pittsburgh Steelers for most Super Bowl victories in NFL history.\n\nInstruction:\n\nBased on this passage, which years did the Patriots win the Super Bowl?Answer:\n\nThe Patriots won the Super Bowl in 2001, 2003, 2004, 2014, 2017, and 2019.\n\n",
    "Context:\n\nThe children of Bill 101 (les enfants de la loi 101) is the name given to the generation of children whose parents immigrated to Quebec, Canada after the adoption of the 1977 Charter of the French Language (Bill 101).\n\nOne of the Charter's articles stipulates that all children under 16 must receive their primary and secondary education in French schools, unless one of the child's parents has received most of their education in English, in Canada, or the child or the child's sibling has already received a substantial part of their education in English, in Canada. If a child qualifies for a certificate of eligibility for instruction in English under one of those criteria, then the certificate is permanent and can be passed on to future generations even if the child ends up attending French instead of English school. The permanent certificate can only be granted if one of the child's parents is a Canadian citizen. In addition, children of foreign temporary residents living in Quebec on study or work permits, as well as children of diplomats, can also obtain a temporary certificate of eligibility that is only valid for the duration of their permit.\n\nInstruction:\n\nWho were the children of Bill 101Answer:\n\nThe children of Bill 101 (les enfants de la loi 101) is the name given to the generation of children whose parents immigrated to Quebec, Canada after the adoption of the 1977 Charter of the French Language (Bill 101).\n\nOne of the Charter's articles stipulates that all children under 16 must receive their primary and secondary education in French schools, unless one of the child's parents has received most of their education in English, in Canada, or the child or the child's sibling has already received a substantial part of their education in English, in Canada.\n\n",
    "Context:\n\nIn the 21st century alone, UVA teams have won seventeen NCAA championships. The men's teams have won recent NCAA titles in basketball (2019); lacrosse (2003, 2006, 2011, 2019, and 2021); baseball (2015); soccer (2009 and 2014); and tennis (2013, 2015, 2016, 2017, and 2022). UVA women have won recent NCAA titles in rowing (2010 and 2012) and swimming & diving (2021 and 2022). The Cavaliers rank first in the ACC (a power conference) with 22 men's NCAA Championships, and rank second in the conference with nine women's NCAA Championships.\n\nInstruction:\n\nAccording to this paragraph, how many NCAA championships has UVA won?Answer:\n\nUVA has won 17 NCAA championships.\n\n",
    "Context:\n\n1981 Iraqi embassy bombing in Beirut\n\nArticle\nTalk\nRead\nEdit\nView history\n\nTools\nFrom Wikipedia, the free encyclopedia\n(Redirected from 1981 Iraqi embassy bombing)\nIraqi embassy bombing in Beirut\nPart of Lebanese Civil War and spillover of the Iran–Iraq War\nLocation\tBeirut, Lebanon\nCoordinates\t33°52′31″N 35°29′03″ECoordinates: 33°52′31″N 35°29′03″E\nDate\tDecember 15, 1981; 41 years ago\nAttack type\tSuicide car bomb\nDeaths\t61\nInjured\t100+\nPerpetrator\tAl-Dawa\nvte\nLebanese Civil War\nvte\nIran–Iraq War\nOn December 15, 1981, the Iraqi Shi'a Islamist group al-Dawa carried out a suicide car bombing targeting the Iraqi embassy in Beirut, Lebanon. The explosion leveled the embassy and killed 61 people, including Iraq's ambassador to Lebanon, and injured at least 100 others.\n\nThe attack is considered by some to be the second modern suicide bombing, preceded by the 1927 Bath School bombings and presaged the 1983 United States embassy bombing and the 1983 Beirut barracks bombings.\n\nBackground\nEmboldened by the success of the 1979 Iranian Revolution, the anti-Baathist Shi'a Islamist group al-Dawa, with financial and military assistance from the Islamic Republic of Iran, began to employ violence in its struggle against the Iraqi government. In 1979 and 1980, al-Dawa assassinated a number of \"senior but low-profile\" Baathist officials in Iraq. In response to a failed assassination attempt on Iraqi Deputy Prime Minister Tariq Aziz in April 1980 by al-Dawa, the Iraqi government launched a severe crackdown on the group, which included the execution of al-Dawa spiritual leader Mohammad Baqir al-Sadr.\n\nThe remaining al-Dawa leadership fled to Iran and the group became an \"effective proxy\" for the Iranian government against Iraq during the Iran–Iraq War, which broke out in September 1980.\n\nBombing\nOn December 15, 1981, a car filled with approximately 100 kilograms of explosives was driven into Iraq's embassy building in Beirut by a suicide bomber. The ensuing explosion devastated the embassy, killed 61 people, including the Iraq ambassador, Abdul Razzak Lafta, and injured more than 100 others. Balqis al-Rawi, the Iraqi wife of Syrian poet Nizar Qabbani, who worked for the embassy's cultural section, was also killed in the attack.\n\nImpact\nThe attack, which presaged the 1983 United States embassy bombing and the 1983 Beirut barracks bombing, is considered by some to be the first modern suicide bombing, though others nominate earlier attacks.\n\nInstruction:\n\nHow was the Iraqi embassy in Beirut destroyed?Answer:\n\nOn December 15, 1981, a car filled with approximately 100 kilograms of explosives was driven into Iraq's embassy building in Beirut by a suicide bomber. The ensuing explosion devastated the embassy, killed 61 people, including the Iraq ambassador, Abdul Razzak Lafta, and injured more than 100 others.\n\n",
    "Context:\n\nThe incudomalleolar joint (more correctly called incudomallear joint) or articulatio incudomallearis is a small synovial joint between the malleus (hammer) and the incus (anvil). The joint's function is to transfer vibrations between the ossicles in the middle ear, which is perceived as sound. Contrary to other synovial joints the movement is very limited. All of the ossicles move more or less as a unit, at least at low frequencies.\n\nWhen the eardrum is moved inward due to sound vibrations, transferred through the outer ear, it transmits to the handle or manubrium of the malleus which is connected to the ear drum. The head of the malleus (caput mallei) moves with it and transfers energy/movement to the corpus of the incus (corpus incudis), which is located directly behind. The sound vibrations are then transferred to the stapes (stirrup) through the incudostapedial joint.\n\nInstruction:\n\nGiven a reference text about the incudomalleolar joint, tell me its main function.Answer:\n\nThe function of the incudomalleolar joint is to transfer vibrations between the ossicles in the middle ear.\n\n",
    "Context:\n\nJohn William Ferrell (/ˈfɛrəl/; born July 16, 1967) is an American actor, comedian, writer, and producer. Ferrell first established himself in the mid-1990s as a cast member on the NBC sketch comedy series Saturday Night Live, where he performed from 1995 to 2002, and has subsequently starred in comedy films such as Elf (2003), Anchorman: The Legend of Ron Burgundy (2004), Kicking & Screaming (2005), Talladega Nights: The Ballad of Ricky Bobby (2006), Semi-Pro (2008), Step Brothers (2008), and Land of the Lost (2009). He founded the comedy website Funny or Die in 2007 with his writing partner Adam McKay. Other notable film roles include Stranger than Fiction (2006), The Other Guys (2010), The Campaign (2012), Get Hard (2015), Holmes & Watson (2018), and the animated films Curious George (2006), Megamind (2010) and The Lego Movie film franchise (2014–2019).\n\nFerrell is considered a member of the \"Frat Pack\", a generation of leading Hollywood comic actors who emerged in the late 1990s and the 2000s, including Jack Black, Ben Stiller, Steve Carell, Vince Vaughn, Paul Rudd, and brothers Owen and Luke Wilson. He received an Emmy Award nomination for his work on Saturday Night Live, and three Golden Globe Award nominations for acting in The Producers (2005) and Stranger than Fiction (2006) and for producing Vice (2018). He was also named the best comedian of 2015 in the British GQ Men of the Year awards. Ferrell received a star on the Hollywood Walk of Fame on March 24, 2015.\n\nInstruction:\n\nGiven a reference text about Will Ferrell, tell me where he kickstarted his career, what group of comic actors he is considered part of, and how many Golden Globe Award nominations he has.Answer:\n\nWill Ferrell kickstarted his career on the NBC sketch comedy series \"Saturday Night Live\". He is considered part of the \"Frat Pack\", and has received three Golden Globe Award nominations.\n\n",
    "Context:\n\nYahalom is the author of numerous books and articles on Hebrew poetry, from Byzantine Palestine (5th century CE) to the early modern period. Much of his work explores the connections between Hebrew poetry and the literature of the other groups living in the same time and place, for example, the link between piyyut and Syriac and Greek Christian hymns; between Hebrew poetry from Spain and the emerging romances in European languages; and between early modern mystical Hebrew poetry in the Ottoman Empire and Turkish songs. He also has written extensively about the bilingual (Hebrew and Arabic) culture of Judah Al-Harizi.\n\nInstruction:\n\nGiven this paragraph about Yahalom and his works, tell me when he was born?Answer:\n\nBased off of this paragraph, it is clear that Yahalom wrote books and articles \"from Byzantine Palestine (5th century CE) to the early modern period\". Therefore, it is likely that Yahalom was born in the early modern period or sometime after the early modern period.\n\nThe exact date of Yahalom's birth cannot be determined given the provided information.\n\n",
    "Context:\n\nThe giant panda is a bear species endemic to China. It is a Carnivora, the giant panda is a folivore, with bamboo shoots and leaves making up more than 99% of its diet.\n\nInstruction:\n\nWhat do giant Pandas eats?Answer:\n\nthe giant panda is a folivore, with bamboo shoots and leaves making up more than 99% of its diet.\n\n",
    "Context:\n\nWaterside Karori were relegated at the end of the 1990 season, to be replaced by the winner of a play-off series between teams from the northern, central, and southern leagues (Mount Albert-Ponsonby, Nelson United, and Burndale United respectively). Nelson United won the series to gain promotion, but there is some controversy about their participation in the play-offs as they had only finished second in the central regional league, which was won by Petone.  \n\nGisborne City were relegated at the end of the 1991 season\n\nInstruction:\n\nWhich team was relegated from the league at the conclusion of the 1991 Season?Answer:\n\nGisborne City were relegated at the end of the 1991 season.\n\n",
    "Context:\n\nLakshmi Puja is celebrated as a part of Tihar, a second national festival of Nepal after Dashain. In Nepal, it is celebrated for five days, which include Kag (crow) Tihar; Kukur (dog) Tihar; Gai (cow) Tihar in the morning and Lakshmi Puja at night; Maha puja (self puja); Goru (Ox and Bull) Tihar and Gobardhan puja; and finally, Bhai Tika (Bhai dhooj)—respectively the first, second, third, fourth and fifth days.\n\nInstruction:\n\nWhat is the last festival celebrated in Tihar and how long does the festival last?Answer:\n\nThe festival lasts for 5 days and Bhai Tika is the last festival.\n\n",
    "Context:\n\nMatong /məˈtɒŋ/ is a town in the central east part of the Riverina region of New South Wales, Australia. The town is 37 kilometres (23 mi) east of Narrandera and 26 kilometres (16 mi) west of Coolamon. At the 2016 census, Matong had a population of 164 people.\n\nSport\nThe most popular sport in Matong is Australian rules football, as it lies in the narrow 'canola belt', a geographical triangle stretching from the Grong Grong and Marrar at either end of the Canola Way, to Ungarie, in which Australian football retains a strong following, despite New South Wales being a largely rugby league supporting state.\n\nInstruction:\n\nWhat is MatongAnswer:\n\nMatong is a town in the central east part of the Riverina region of New South Wales, Australia. The town is 37 kilometres (23 mi) east of Narrandera and 26 kilometres (16 mi) west of Coolamon. At the 2016 census, Matong had a population of 164 people.\n\nSport\nThe most popular sport in Matong is Australian rules football, as it lies in the narrow 'canola belt', a geographical triangle stretching from the Grong Grong and Marrar at either end of the Canola Way, to Ungarie, in which Australian football retains a strong following, despite New South Wales being a largely rugby league supporting state.\n\n"
]