[
    "Context:\n\nAs of 2021, the power and capacity of the largest individual battery storage power plants is an order of magnitude less than that of the largest pumped storage power plants, the most common form of grid energy storage. For example, the Bath County Pumped Storage Station, the second largest in the world, can store 24GWh of electricity and dispatch 3GW while the first phase of Vistra Energy's Moss Landing Energy Storage Facility can store 1.2GWh and dispatch 300MW. Grid batteries do not however have to be large, and smaller ones can be deployed widely across a grid for greater redundancy.\n\nAs of 2019, battery power storage is cheaper than open cycle gas turbine power for use up to two hours, and there was around 365 GWh of battery storage deployed worldwide, growing extremely rapidly. Levelized cost of electricity from battery storage has fallen rapidly, halving in two years to US$150 per MWh as of 2020.\n\nInstruction:\n\nGiven these paragraphs about battery storage power stations, what was the levelized cost of electricity from battery storage as of 2020?\n\nAnswer:\n\nUS$150 per MWh.\n\n",
    "Instruction:\n\nGiven this paragraph about the Subaru Outback, in what year was the Wilderness trim introduced?Context:\n\nThe sixth-generation Subaru Outback for the North American market was unveiled at the New York Auto Show on April 17, 2019. Full production started from July 29, 2019. This redesigned Outback keeps the same body style (wagon/crossover SUV), while still receiving a few changes, such as new taillights (similar to the ones on the Forester and upcoming Legacy) and an updated, modern interior.\n\nInternally, the 2020 Outback moves to the Subaru Global Platform, which is stiffer and offers a common base to allow use of alternative powertrains, such as hybrid or all-electric. The base model sixth-generation Outback was offered with the 2.5-liter gasoline direct-injection FB25D; a turbocharged 2.4-liter FA24F that was first used on the Subaru Ascent was offered as the uplevel engine, providing improved power, torque, and consumption compared to the discontinued EZ36.\n\nIn addition to all-wheel drive coming standard on every trim, the 2021 model year also added LED adaptive steering-responsive headlights (SRH) on premium variants and a seat-belt reminder standard for all passengers.\n\nWorld markets outside of North America, including Japan, did not launch the sixth generation Outback until 2021.\n\nAustralia launched on the 20th February 2021 with a number of differences over the North American version including updated LED headlights with combined Day Running Light and turn/direction indicator with SRH (Steering Responsive Headlights) standard across all variants (the Touring model also gained Adaptive Driving Beam (ADB) until 2023 when ADB became standard across all model variants), as is pushbutton-start with tailgate PIN access. There is improved camera resolution for rear, side and front driver assistance cameras, EyeSight 4.0 with roadside speed sign reading, adjustable speed limiting, and intersection crash avoidance utilising new EyeSight cameras with a wider field of view and a lower profile inside the cabin. Subaru claim the sole engine fitted to Australian Outbacks, the revised 2.5-litre FB25D, is made of 90% new components compared to the Gen5 engine as well. The Japanese Outback was announced on October 7, 2021; in Japan the Outback is offered exclusively with the 1.8-litre CB18 gasoline direct-injection turbo engine instead.\n\nIn September 2021, the European variant received a five-star rating by the European New Car Assessment Programme (EuroNCAP) 2021.\n\nFor the 2022 model year, Subaru added a new trim level, the Wilderness. Outback Wilderness features 9.5 inches of ground clearance, turbocharged 2.4-liter FA24F engine, and re-tuned transmission gearing with revised front and rear gear ratios. Marketed for off-road use, the Outback Wilderness has 17\" wheels with standard all-terrain tires, enhanced body cladding, and synthetic upholstery.\n\nAnswer:\n\n2022\n\n",
    "Context:\n\nKing Charles II returned to Navarre in November 1361, leaving his wife and son behind in France. When in January 1363 it was her turn to move to Navarre, Queen Joan left Charles in the custody of his aunt Blanche, sister of his father and widow of his maternal great-grandfather King Philip VI of France. Charles was reunited with his mother when she returned to France in December 1365, and the following August Charles set foot in his father's kingdom for the first time.\n\nInstruction:\n\nWhen did King Charles II return to Navarre?\n\nAnswer:\n\nKing Charles II returned to Navarre in November 1361.\n\n",
    "Context:\n\nBreezy Point is a city in Crow Wing County, Minnesota, United States. It is part of the Brainerd Micropolitan Statistical Area. The population was 2,346 at the 2010 census.\n\nInstruction:\n\nWhat is the population of Breezy Point city in Minnesota?\n\nAnswer:\n\nBreezy Point's population was 2,346 at the 2010 census.\n\n",
    "Instruction:\n\nGiven this paragraph about the human brain, how does my brain know that I'm touching something hot?Context:\n\nThe human brain is the central organ of the human nervous system, and with the spinal cord makes up the central nervous system. The brain consists of the cerebrum, the brainstem and the cerebellum. It controls most of the activities of the body, processing, integrating, and coordinating the information it receives from the sense organs, and making decisions as to the instructions sent to the rest of the body. The brain is contained in, and protected by, the skull bones of the head.\n\nAnswer:\n\nHumans process information from the various sensory systems via the central nervous system. The nerves in your hand are integral to your sense of touch. When your fingers touch something hot, the nerves in your hand quickly transmit that information through the nervous system to the central nervous system. After processing an electrochemical signal up through the spine, the sensory signal is eventually received in the human brain. The brain takes action and, in this case, initiates an instinctual retraction of the hand.\n\n",
    "Instruction:\n\nBased on this passage, how many miles did Gorbachev walk each week for his round trip commute to school?Context:\n\nThe village school was closed during much of the war but re-opened in autumn 1944. Gorbachev did not want to return but when he did he excelled academically. He read voraciously, moving from the Western novels of Thomas Mayne Reid to the works of Vissarion Belinsky, Alexander Pushkin, Nikolai Gogol, and Mikhail Lermontov. In 1946, he joined the Komsomol, the Soviet political youth organization, becoming leader of his local group and then being elected to the Komsomol committee for the district. From primary school he moved to the high school in Molotovskoye; he stayed there during the week while walking the 19 km (12 mi) home during weekends. As well as being a member of the school's drama society, he organized sporting and social activities and led the school's morning exercise class. Over the course of five consecutive summers from 1946 onward he returned home to assist his father in operating a combine harvester, during which they sometimes worked 20-hour days. In 1948, they harvested over 8,000 centners of grain, a feat for which Sergey was awarded the Order of Lenin and his son the Order of the Red Banner of Labour.\n\nAnswer:\n\nAccording to this passage, Gorbachev's round trip walking commute to school was 24 miles per week. He walked 12 miles each way and travelled to and from school only once per week.\n\n",
    "Instruction:\n\nWhat is the last festival celebrated in Tihar and how long does the festival last?Context:\n\nLakshmi Puja is celebrated as a part of Tihar, a second national festival of Nepal after Dashain. In Nepal, it is celebrated for five days, which include Kag (crow) Tihar; Kukur (dog) Tihar; Gai (cow) Tihar in the morning and Lakshmi Puja at night; Maha puja (self puja); Goru (Ox and Bull) Tihar and Gobardhan puja; and finally, Bhai Tika (Bhai dhooj)—respectively the first, second, third, fourth and fifth days.\n\nAnswer:\n\nThe festival lasts for 5 days and Bhai Tika is the last festival.\n\n",
    "Context:\n\nWho is Luka Modric?\n\nInstruction:\n\nLuka Modrić (Croatian pronunciation: [lûːka mǒːdritɕ]; born 9 September 1985) is a Croatian professional footballer who plays as a midfielder for La Liga club Real Madrid and captains the Croatia national team. He plays mainly as a central midfielder, but can also play as an attacking midfielder or as a defensive midfielder. He is widely regarded as one of the greatest midfielders of all time, and as the greatest ever Croatian footballer.\n\nBorn in Zadar, Modrić's childhood coincided with the Croatian War of Independence which displaced his family. In 2002, he was signed by Dinamo Zagreb at age 16, after showing promise with his hometown club NK Zadar's youth team. He continued his development in Zagreb, before spells on loan to Zrinjski Mostar and Inter Zaprešić. He made his debut for Dinamo in 2005 and won three consecutive league titles and domestic cups, being named the Prva HNL Player of the Year in 2007. In 2008, he moved to Premier League club Tottenham Hotspur for a club-record transfer fee of £16.5 million, where he led Spurs to their first UEFA Champions League appearance in almost 50 years, reaching the quarter-finals of the 2010–11 tournament.\n\nIn the summer of 2012, Modrić joined Real Madrid for a £30 million transfer fee. There he became a key contributor and helped the team win La Décima and was selected for the 2013–14 Champions League squad of the season. After Zinedine Zidane took over Madrid, Modrić was critical to three consecutive Champions League titles from 2015–16 to 2017–18, each time being voted into the squad of the season. He has won twenty-two major trophies at Real Madrid, including five UEFA Champions League titles, three La Liga titles, one Copa del Rey, four Supercopa de España titles, four UEFA Super Cup titles and five FIFA Club World Cup titles. He won the La Liga Award for \"Best Midfielder\" in 2016 for the second time, and the UEFA Club Football Award for \"Best Midfielder\" in 2017 and 2018. In 2015, he became the first Croatian player to be included in the FIFA FIFPRO World 11, in which he was regularly included until 2019 and then again in 2022, as well in the UEFA Team of the Year between 2016 and 2018. In 2018, Modrić became the first Croatian player to win the UEFA Men's Player of the Year Award, and by winning The Best FIFA Men's Player and Ballon d'Or awards, he became the first player other than Lionel Messi or Cristiano Ronaldo to claim the awards in more than a decade. In 2019, he was awarded the Golden Foot award for career results and personality.\n\nModrić made his international debut for Croatia against Argentina in March 2006, and scored his first international goal in a friendly match against Italy. Modrić has anchored Croatia's \"second Golden Generation\", participating in every major tournament Croatia has qualified for, including the UEFA Euro 2008, 2012, 2016, and 2020, as well as the 2006, 2014, 2018, and 2022 FIFA World Cup. At the Euro 2008, he was selected for the Team of the Tournament, becoming only the second Croatian to ever achieve this honour. Following group stage eliminations in his first two World Cups, Modrić led Croatia to the 2018 World Cup Final, winning the Golden Ball in process. At the following tournament, he led the team to a third-place finish, winning the Bronze Ball in process. In March 2021, he went on to become the country's most capped player in history. Furthermore, he has been named Croatian Footballer of the Year a record eleven times between 2007 and 2022.\n\nAnswer:\n\nLuka Modric is a Croatian professional football (soccer) player. He is considered one of the best midfielders of all time and best Croatian player ever. He was born in Zadar, Croatia. In 2002, at the age of 16, he signed with the biggest Croatian soccer club, Dinamo Zagreb where is stayed till 2008 when he signed with Tottenham Hotspur in England. In 2012 he signed with Real Madrid in Spain where he currently plays.\n\n",
    "Context:\n\nThe human brain is the central organ of the human nervous system, and with the spinal cord makes up the central nervous system. The brain consists of the cerebrum, the brainstem and the cerebellum. It controls most of the activities of the body, processing, integrating, and coordinating the information it receives from the sense organs, and making decisions as to the instructions sent to the rest of the body. The brain is contained in, and protected by, the skull bones of the head.\n\nInstruction:\n\nGiven this paragraph about the human brain, how does my brain know that I'm touching something hot?\n\nAnswer:\n\nHumans process information from the various sensory systems via the central nervous system. The nerves in your hand are integral to your sense of touch. When your fingers touch something hot, the nerves in your hand quickly transmit that information through the nervous system to the central nervous system. After processing an electrochemical signal up through the spine, the sensory signal is eventually received in the human brain. The brain takes action and, in this case, initiates an instinctual retraction of the hand.\n\n",
    "Instruction:\n\nWhich era of counterculture were the Beatles pivotal to?Context:\n\nhe Beatles were an English rock band, formed in Liverpool in 1960, that comprised John Lennon, Paul McCartney, George Harrison and Ringo Starr. They are regarded as the most influential band of all time and were integral to the development of 1960s counterculture and popular music's recognition as an art form. Rooted in skiffle, beat and 1950s rock 'n' roll, their sound incorporated elements of classical music and traditional pop in innovative ways; the band also explored music styles ranging from folk and Indian music to psychedelia and hard rock. As pioneers in recording, songwriting and artistic presentation, the Beatles revolutionised many aspects of the music industry and were often publicised as leaders of the era's youth and sociocultural movements\n\nAnswer:\n\nThe Beatles were integral to the development of 1960s counterculture\n\n",
    "Instruction:\n\nTo which town in the UK did the Ford Motor Company relocate to in 1931?Context:\n\nIn 1931 the Ford Motor Company relocated from Trafford Park in Manchester, to a larger new plant in Dagenham, which was already the location of supplier Briggs Motorway Bodies. A 500-acre (200 ha) riverside site was developed to become Europe's largest car plant, a vast vertically integrated site with its own blast furnaces and power station, importing iron ore and exporting finished vehicles. By the 1950s Ford had taken over Briggs at Dagenham and its other sites at Doncaster, Southampton, Croydon and Romford. At its peak the Dagenham plant had 4,000,000 square feet (370,000 m2) of floor space and employed over 40,000 people, although this number gradually fell during the final three decades of the 20th century as production methods advanced and Ford invested in other European factories as well. Some of Britain's best selling cars, including the Fiesta, Escort, Cortina and Sierra, were produced at the plant over the next 71 years.\n\nAnswer:\n\nDagenham\n\n",
    "Instruction:\n\nGiven a reference text about Isabel Emily Jay, tell me where she studied and how old she was when she retired.Context:\n\nIsabel Emily Jay (17 October 1879 – 26 February 1927) was an English opera singer and actress, best known for her performances in soprano roles of the Savoy Operas with the D'Oyly Carte Opera Company and in Edwardian musical comedies. During Jay's career, picture postcards were immensely popular, and Jay was photographed for over 400 different postcards.\n\nAfter studying at the Royal Academy of Music, Jay joined the D'Oyly Carte Opera Company in 1897, with whom she began singing principal roles immediately, becoming the company's leading soprano in 1899, where she played leading roles in comic operas including The Rose of Persia, The Pirates of Penzance, Patience, The Emerald Isle and Iolanthe. She married and left the company in 1902. She returned to the West End stage in 1903 and starred in eleven musicals over the ensuing years, including A Country Girl, The Cingalee, Véronique, The White Chrysanthemum, The Girl Behind the Counter, Miss Hook of Holland, King of Cadonia and The Balkan Princess. She retired in 1911 at age 31.\n\nAnswer:\n\nIsabel Emily Jay studied at the Royal Academy of Music and retired at 31 years old.\n\n",
    "Context:\n\nThe Kubernetes master node handles the Kubernetes control plane of the cluster, managing its workload and directing communication across the system. The Kubernetes control plane consists of various components, each its own process, that can run both on a single master node or on multiple masters supporting high-availability clusters. The various components of the Kubernetes control plane are as follows:\n\netcd is a persistent, lightweight, distributed, key-value data store that CoreOS has developed. It reliably stores the configuration data of the cluster, representing the overall state of the cluster at any given point of time. etcd favors consistency over availability in the event of a network partition (see CAP theorem). The consistency is crucial for correctly scheduling and operating services.\nThe API server serves the Kubernetes API using JSON over HTTP, which provides both the internal and external interface to Kubernetes. The API server processes and validates REST requests and updates the state of the API objects in etcd, thereby allowing clients to configure workloads and containers across worker nodes. The API server uses etcd's watch API to monitor the cluster, roll out critical configuration changes, or restore any divergences of the state of the cluster back to what the deployer declared. As an example, the deployer may specify that three instances of a particular \"pod\" (see below) need to be running. etcd stores this fact. If the Deployment Controller finds that only two instances are running (conflicting with the etcd declaration), it schedules the creation of an additional instance of that pod.\nThe scheduler is the extensible component that selects on which node an unscheduled pod (the basic entity managed by the scheduler) runs, based on resource availability. The scheduler tracks resource use on each node to ensure that workload is not scheduled in excess of available resources. For this purpose, the scheduler must know the resource requirements, resource availability, and other user-provided constraints or policy directives such as quality-of-service, affinity vs. anti-affinity requirements, and data locality. The scheduler's role is to match resource \"supply\" to workload \"demand\".\nA controller is a reconciliation loop that drives the actual cluster state toward the desired state, communicating with the API server to create, update, and delete the resources it manages (e.g., pods or service endpoints). One kind of controller is a Replication Controller, which handles replication and scaling by running a specified number of copies of a pod across the cluster. It also handles creating replacement pods if the underlying node fails. Other controllers that are part of the core Kubernetes system include a DaemonSet Controller for running exactly one pod on every machine (or some subset of machines), and a Job Controller for running pods that run to completion (e.g., as part of a batch job). Labels selectors that are part of the controller's definition specify the set of pods that a controller manages.\nThe controller manager is a process that manages a set of core Kubernetes controllers.\n\nInstruction:\n\nGiven this paragraph about kubernetes, what is the storage layer of Kubernetes control plane?\n\nAnswer:\n\nETCD\n\n",
    "Context:\n\nThe heart is a muscular organ in most animals. This organ pumps blood through the blood vessels of the circulatory system. The pumped blood carries oxygen and nutrients to the body, while carrying metabolic waste such as carbon dioxide to the lungs. In humans, the heart is approximately the size of a closed fist and is located between the lungs, in the middle compartment of the chest, called mediastinum .\n\nIn humans, other mammals, and birds, the heart is divided into four chambers: upper left and right atria and lower left and right ventricles. Commonly the right atrium and ventricle are referred together as the right heart and their left counterparts as the left heart. Fish, in contrast, have two chambers, an atrium and a ventricle, while most reptiles have three chambers. In a healthy heart blood flows one way through the heart due to heart valves, which prevent backflow. The heart is enclosed in a protective sac, the pericardium, which also contains a small amount of fluid. The wall of the heart is made up of three layers: epicardium, myocardium, and endocardium.\n\nInstruction:\n\nGiven this passage about the human heart, tell me about the major structural features of the human heart as well as the primary purpose of the organ.\n\nAnswer:\n\nThe major structural features of the human heart are its four chambers for pumping blood. The heart is commonly viewed as having a left side and a right side, with each side comprising two chambers -- an atrium and a ventricle. The four total chambers make up the organ's primary structural features. Together, they are responsible for maintaining blood flow throughout the body via the circulatory system. The heart is also responsible for moving waste products through the bloodstream to the organs that process them.\n\n",
    "Context:\n\nThe potential uses of AI in government are wide and varied, with Deloitte considering that \"Cognitive technologies could eventually revolutionize every facet of government operations\". Mehr suggests that six types of government problems are appropriate for AI applications:\n- Resource allocation - such as where administrative support is required to complete tasks more quickly.\n- Large datasets - where these are too large for employees to work efficiently and multiple datasets could be combined to provide greater insights.\n- Experts shortage - including where basic questions could be answered and niche issues can be learned.\n- Predictable scenario - historical data makes the situation predictable.\n- Procedural - repetitive tasks where inputs or outputs have a binary answer.\n- Diverse data - where data takes a variety of forms (such as visual and linguistic) and needs to be summarised regularly.\n\nInstruction:\n\nWhat types of problems in government could AI be used to solve\n\nAnswer:\n\nThe potential uses of AI in government are wide and varied but some appropriate areas to consider AI applications include: Resource allocation; Large datasets; Repetitive tasks; Answering basic questions; Summarising data from multiple forms; Predicting future scenarios based on historical data.\n\n",
    "Instruction:\n\nWhat makes a Squishmallow resellable?Context:\n\nDue to the demand for the toy, Squishmallows are often sold by resellers for an increased price. The average resell price for a Squishmallow depends on the size, condition, and rarity of the specific item. Some limited edition or high-demand Squishmallows are sold by resellers and collectors for hundreds or thousands of dollars. Jack the Black Cat, known for its closed white eyes and white whiskers, is one of the rarest Squishmallows sold to date. KellyToys introduced the limited edition stuffed animal on their website in 2020, where it sold out within two hours. Third party websites like eBay host listings for Jack the Black Cat valued at nearly $2,000. Among the many Squishmallows that are sold, some of the most popular include Connor the Cow, Malcolm the Mushroom, Archie the Axolotl, and Philippe the Frog. There are reports that resellers are harassed and doxxed by the community.\n\nAnswer:\n\nSquishmallows are a highly demanded toy and also often are sold as limited edition items. As a result, Squishmallows that are more unique and rare can often be sold or higher value later. One example is Jack the Black Cat which has been listed on eBay for nearly $2,000.\n\n",
    "Instruction:\n\nWho is Thor?Context:\n\nThor (from Old Norse: Þórr) is a prominent god in Germanic paganism. In Norse mythology, he is a hammer-wielding god associated with lightning, thunder, storms, sacred groves and trees, strength, the protection of humankind, hallowing, and fertility. Besides Old Norse Þórr, the deity occurs in Old English as Þunor, in Old Frisian as Thuner, in Old Saxon as Thunar, and in Old High German as Donar, all ultimately stemming from the Proto-Germanic theonym *Þun(a)raz, meaning 'Thunder'.\n\nAnswer:\n\nThor is the god of thunder in Norse mythology. He wields a powerful hammer that only he can pick up. Thor has appeared as a character in Marvel comic books since 1962 and in at least 10 movies.\n\n",
    "Instruction:\n\nWhen was the attack on Pearl HarborContext:\n\nThe attack on Pearl Harbor[nb 3] was a surprise military strike by the Imperial Japanese Navy Air Service upon the United States against the U.S. naval base at Pearl Harbor in Honolulu, Territory of Hawaii, just before 8:00 a.m. (local time) on Sunday, December 7, 1941. The United States was a neutral country at the time; the attack led to its formal entry into World War II the next day. The Japanese military leadership referred to the attack as the Hawaii Operation and Operation AI,[nb 4] and as Operation Z during its planning.\n\nThe attack was preceded by months of negotiations between the U.S. and Japan over the future of the Pacific. Japanese demands included that the U.S. end its sanctions against Japan, cease aiding China in the Second Sino-Japanese war, and allow Japan to access the resources of the Dutch East Indies. Anticipating a negative response from the US, Japan sent out its naval attack groups in November 1941 just prior to receiving the Hull note—the U.S. demand that Japan withdraw from China and Indochina.\n\nJapan intended the attack as a preventive action. Its aim was to prevent the United States Pacific Fleet from interfering with its planned military actions in Southeast Asia against overseas territories of the United Kingdom, the Netherlands, and those of the United States. Over the course of seven hours there were coordinated Japanese attacks on the U.S.-held Philippines, Guam, and Wake Island and on the British Empire in Malaya, Singapore, and Hong Kong.\n\nAnswer:\n\nDecember 7, 1941\n\n",
    "Instruction:\n\nIn the following passage about mechanical-switch keyboards, which keyboards are the loudest, and how can I make them quieter?Context:\n\nEvery key on a mechanical-switch keyboard contains a complete switch underneath. Each switch is composed of a housing, a spring, and a stem, and sometimes other parts such as a separate tactile leaf or a clickbar. Switches come in three variants: \"linear\" with consistent resistance, \"tactile\" with a non-audible bump, and \"clicky\" with both a bump and an audible click. Depending on the resistance of the spring, the key requires different amounts of pressure to actuate and to bottom out. The shape of the stem as well as the design of the switch housing varies the actuation distance and travel distance of the switch. The sound can be altered by the material of the plate, case, lubrication, the keycap profile, and even modifying the individual switch. These modifications, or \"mods\" include applying lubricant to reduce friction inside the switch itself, inserting \"switch films\" to reduce wobble, swapping out the spring inside to modify the resistance of the switch itself and many more. Mechanical keyboards allow for the removal and replacement of keycaps with a common stem type.\n\nAnswer:\n\nMechanical-switch keyboards with \"Clicky\" switches come with both a bump and an audible click. Without adjusting the material of the plates or case, the way for users to reduce the noise would be to replace the keycaps or applying lubricant to reduce friction inside the switch.\n\n",
    "Context:\n\nFriedrich Rudolf Ludwig Freiherr von Canitz (27 November 1654 – 11 August 1699) was a German poet and diplomat. He was one of the few German poets of his era that Frederick the Great enjoyed.\n\nBiography\nCanitz was born in Berlin, Brandenburg. He was influenced by Boileau.  He attended the universities of Leiden and Leipzig, travelled in England, France, Italy and the Netherlands, and on his return was appointed groom of the bedchamber (Kammerjunker) to Frederick William, Elector of Brandenburg, whom he accompanied on his campaigns in Pomerania and Sweden.\n\nIn 1680 Canitz became councillor of legation, and he was employed on various embassies. In 1697 Elector Frederick III made him a privy councillor, and Emperor Leopold I created him a baron of the Empire. Having fallen ill on an embassy to the Hague, he obtained his discharge and died at Berlin in 1699.\n\nHe wrote verse in a restrained, sober style.  He was considered as one of the poets who “produced verse that was specifically aimed at entertaining and flattering princes and high courtiers.” Although he liked making verse in many languages, he never published any of them. Canitz's poems (Nebenstunden unterschiedener Gedichte), which did not appear until after his death (1700), are for the most part dry and stilted imitations of French and Latin models, but they formed a healthy contrast to the coarseness and bombast of the later Silesian poets.\n\nA complete edition of Canitz's poems was published by U. König in 1727; see also L. Fulda, Die Gegner der zweiten schlesischen Schule, ii. (1883).\n\nInstruction:\n\nGiven a reference text about Friedrich Rudolf Ludwig Freiherr von Canitz, when and where was he born?\n\nAnswer:\n\nFriedrich Rudolf Ludwig Freiherr von Canitz was born in Berlin on November 27, 1654.\n\n",
    "Context:\n\nThe first prototype was entirely mechanical. Three prototypes were made, and they were improved over one year. In the meantime, sure of having found a solution to the problem of taking 360° photos, Leme applied for a patent registration, a process that went on for some years.\n\nInstruction:\n\nHow many prototypes were made?\n\nAnswer:\n\nThree prototypes were made and improved over one year.\n\n",
    "Context:\n\nScrubs focuses on the unique point of view of its main character and narrator, Dr. John Michael \"J.D.\" Dorian (Zach Braff) for the first eight seasons, with season nine being narrated by the new main character Lucy Bennett (Kerry Bishé). Most episodes feature multiple story lines thematically linked by voice-overs done by Braff, as well as the comical daydreams of J.D. According to Bill Lawrence, \"What we decided was, rather than have it be a monotone narration, if it's going to be Zach's voice, we're going to do everything through J.D.'s eyes. It opened up a visual medium that those of us as comedy writers were not used to.\" Actors were given the chance to improvise their lines on set with encouragement by series creator Bill Lawrence, with Neil Flynn and Zach Braff being the main improvisors.\n\nInstruction:\n\nWhat was unique about Scrubs?\n\nAnswer:\n\nMost episodes featured voice-overs done by Zach Braff (who stars as the main character, J.D.), as well as the comical daydreams of J.D. This opened up a unique visual medium that the comedy writers were not used to. Also, actors were given the chance to improvise their lines on set.\n\n",
    "Instruction:\n\nWho founded FordContext:\n\nFord Motor Company (commonly known as Ford) is an American multinational automobile manufacturer headquartered in Dearborn, Michigan, United States. It was founded by Henry Ford and incorporated on June 16, 1903. The company sells automobiles and commercial vehicles under the Ford brand, and luxury cars under its Lincoln luxury brand. Ford also owns Brazilian SUV manufacturer Troller, an 8% stake in Aston Martin of the United Kingdom and a 32% stake in China's Jiangling Motors. It also has joint ventures in China (Changan Ford), Taiwan (Ford Lio Ho), Thailand (AutoAlliance Thailand), and Turkey (Ford Otosan). The company is listed on the New York Stock Exchange and is controlled by the Ford family; they have minority ownership but the majority of the voting power.\n\nAnswer:\n\nHenry Ford founded Ford Motor Company (aka Ford) in on June 16, 1903 in Dearborn Michigan.\n\n",
    "Context:\n\nDouglas Stuart Moore (August 10, 1893 – July 25, 1969) was an American composer, songwriter, organist, pianist, conductor, educator, actor, and author. A composer who mainly wrote works with an American subject, his music is generally characterized by lyricism in a popular or conservative style which generally eschewed the more experimental progressive trends of musical modernism. Composer Virgil Thomson described Moore as a neoromantic composer who was influenced by American folk music. While several of his works enjoyed popularity during his lifetime, only his folk opera The Ballad of Baby Doe (1956) has remained well known into the 21st century.\n\nInstruction:\n\nWhat is Douglas Stuart Moore's best remembered for?\n\nAnswer:\n\nThe Ballad of Baby Doe (1956) as it has remained well known into the 21st century.\n\n",
    "Instruction:\n\nGiven that preserving human brains for more than a century is fairly uncommon, what do you think was the motivation for preserving Guiteau's brain?Context:\n\nJames A. Garfield, the 20th president of the United States, was shot at the Baltimore and Potomac Railroad Station in Washington, D.C., at 9:30 am on Saturday, July 2, 1881. He died in Elberon, New Jersey, 79 days later on September 19, 1881. The shooting occurred less than four months into his term as president. Garfield's assassin was Charles J. Guiteau, whose motive was revenge against Garfield for an imagined political debt, and getting Chester A. Arthur elevated to president. Guiteau was convicted of Garfield's murder and executed by hanging one year after the shooting.\n\nPart of Guiteau's preserved brain is on display at the Mütter Museum at the College of Physicians of Philadelphia. Guiteau's bones and more of his brain, along with Garfield's backbone and a few ribs, are kept at the National Museum of Health and Medicine, at the Army's Forest Glen Annex in Silver Spring, Maryland. Garfield's assassination was instrumental to the passage of the Pendleton Civil Service Reform Act on January 16, 1883. Garfield himself had called for civil service reform in his inaugural address and supported it as president in the belief that it would make government more efficient. It was passed as something of a memorial to the fallen President. Arthur lost the Republican nomination in 1884 to Blaine, who went on to lose a close election to Democrat Grover Cleveland.\n\nAnswer:\n\nOne reason for preserving the brain may have been to study structural abnormalities that could have explained Guiteau's violent behavior. Alternatively, because Guiteau was well-known and infamous, his brain may have been preserved for use as a memento or as a warning to discourage presidential assassinations in the future.\n\n",
    "Instruction:\n\nGiven this passage about the human heart, tell me about the major structural features of the human heart as well as the primary purpose of the organ.Context:\n\nThe heart is a muscular organ in most animals. This organ pumps blood through the blood vessels of the circulatory system. The pumped blood carries oxygen and nutrients to the body, while carrying metabolic waste such as carbon dioxide to the lungs. In humans, the heart is approximately the size of a closed fist and is located between the lungs, in the middle compartment of the chest, called mediastinum .\n\nIn humans, other mammals, and birds, the heart is divided into four chambers: upper left and right atria and lower left and right ventricles. Commonly the right atrium and ventricle are referred together as the right heart and their left counterparts as the left heart. Fish, in contrast, have two chambers, an atrium and a ventricle, while most reptiles have three chambers. In a healthy heart blood flows one way through the heart due to heart valves, which prevent backflow. The heart is enclosed in a protective sac, the pericardium, which also contains a small amount of fluid. The wall of the heart is made up of three layers: epicardium, myocardium, and endocardium.\n\nAnswer:\n\nThe major structural features of the human heart are its four chambers for pumping blood. The heart is commonly viewed as having a left side and a right side, with each side comprising two chambers -- an atrium and a ventricle. The four total chambers make up the organ's primary structural features. Together, they are responsible for maintaining blood flow throughout the body via the circulatory system. The heart is also responsible for moving waste products through the bloodstream to the organs that process them.\n\n",
    "Context:\n\nFord Motor Company (commonly known as Ford) is an American multinational automobile manufacturer headquartered in Dearborn, Michigan, United States. It was founded by Henry Ford and incorporated on June 16, 1903. The company sells automobiles and commercial vehicles under the Ford brand, and luxury cars under its Lincoln luxury brand. Ford also owns Brazilian SUV manufacturer Troller, an 8% stake in Aston Martin of the United Kingdom and a 32% stake in China's Jiangling Motors. It also has joint ventures in China (Changan Ford), Taiwan (Ford Lio Ho), Thailand (AutoAlliance Thailand), and Turkey (Ford Otosan). The company is listed on the New York Stock Exchange and is controlled by the Ford family; they have minority ownership but the majority of the voting power.\n\nInstruction:\n\nWho founded Ford\n\nAnswer:\n\nHenry Ford founded Ford Motor Company (aka Ford) in on June 16, 1903 in Dearborn Michigan.\n\n",
    "Context:\n\nThe attack on Pearl Harbor[nb 3] was a surprise military strike by the Imperial Japanese Navy Air Service upon the United States against the U.S. naval base at Pearl Harbor in Honolulu, Territory of Hawaii, just before 8:00 a.m. (local time) on Sunday, December 7, 1941. The United States was a neutral country at the time; the attack led to its formal entry into World War II the next day. The Japanese military leadership referred to the attack as the Hawaii Operation and Operation AI,[nb 4] and as Operation Z during its planning.\n\nThe attack was preceded by months of negotiations between the U.S. and Japan over the future of the Pacific. Japanese demands included that the U.S. end its sanctions against Japan, cease aiding China in the Second Sino-Japanese war, and allow Japan to access the resources of the Dutch East Indies. Anticipating a negative response from the US, Japan sent out its naval attack groups in November 1941 just prior to receiving the Hull note—the U.S. demand that Japan withdraw from China and Indochina.\n\nJapan intended the attack as a preventive action. Its aim was to prevent the United States Pacific Fleet from interfering with its planned military actions in Southeast Asia against overseas territories of the United Kingdom, the Netherlands, and those of the United States. Over the course of seven hours there were coordinated Japanese attacks on the U.S.-held Philippines, Guam, and Wake Island and on the British Empire in Malaya, Singapore, and Hong Kong.\n\nInstruction:\n\nWhen was the attack on Pearl Harbor\n\nAnswer:\n\nDecember 7, 1941\n\n",
    "Instruction:\n\nGiven the paragraph above paragraph, what is the PMP and who established the exam.Context:\n\nProject Management Professional (PMP) is an internationally recognized professional designation offered by the Project Management Institute (PMI). As of 31 July 2020, there are 1,036,368 active PMP-certified individuals and 314 chartered chapters across 214 countries and territories worldwide.\n\nThe exam is one of eight credentials offered by PMI and is based on the ECO PMP Examination Content Outline. Most of the questions reference the Exam Content Outline PMP Examination Content Outline (also known as the E.C.O ).\n\nAnswer:\n\nPMP stands for Project Management Professional, and it was established by the Project Management Institute (PMI). The PMP is a professional certification for project managers that is recognized internationally. The PMP is based on the ECO PMP Examination Content Outline.\n\n",
    "Instruction:\n\nWhat is Douglas Stuart Moore's best remembered for?Context:\n\nDouglas Stuart Moore (August 10, 1893 – July 25, 1969) was an American composer, songwriter, organist, pianist, conductor, educator, actor, and author. A composer who mainly wrote works with an American subject, his music is generally characterized by lyricism in a popular or conservative style which generally eschewed the more experimental progressive trends of musical modernism. Composer Virgil Thomson described Moore as a neoromantic composer who was influenced by American folk music. While several of his works enjoyed popularity during his lifetime, only his folk opera The Ballad of Baby Doe (1956) has remained well known into the 21st century.\n\nAnswer:\n\nThe Ballad of Baby Doe (1956) as it has remained well known into the 21st century.\n\n",
    "Instruction:\n\nWhat is Pinot Noir?Context:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. The name may also refer to wines created predominantly from pinot noir grapes. The name is derived from the French words for pine and black. The word pine alludes to the grape variety having tightly clustered, pinecone–shaped bunches of fruit.\n\nPinot noir is grown around the world, mostly in cooler climates, and the variety is chiefly associated with the Burgundy region of France. Pinot noir is now used to make red wines around the world, as well as champagne, sparkling white wines such as the Italian Franciacorta, and English sparkling wines. Regions that have gained a reputation for red pinot noir wines include the Willamette Valley of Oregon; the Carneros, Central Coast, Sonoma Coast, and Russian River AVAs of California; the Elgin and Walker Bay wine regions of South Africa; the Mornington Peninsula, Adelaide Hills, Great Southern, Tasmania, and Yarra Valley in Australia; and the Central Otago, Martinborough, and Marlborough wine regions of New Zealand. Pinot noir is the most planted varietal (38%) used in sparkling wine production in Champagne and other wine regions.\n\nAnswer:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. Pinot noir is grown around the world, mostly in cooler climates, and the variety is chiefly associated with the Burgundy region of France. Pinot noir is now used to make red wines around the world, as well as champagne, sparkling white wines such as the Italian Franciacorta, and English sparkling wines.\n\n",
    "Instruction:\n\nHow long did the Roman Empire lastContext:\n\nIn modern historiography, Ancient Rome refers to Roman civilisation from the founding of the Italian city of Rome in the 8th century BC to the collapse of the Western Roman Empire in the 5th century AD. It encompasses the Roman Kingdom (753–509 BC), Roman Republic (509–27 BC) and Roman Empire (27 BC–476 AD) until the fall of the western empire.\n\nAnswer:\n\n1229 years\n\n",
    "Instruction:\n\nGiven these paragraphs about battery storage power stations, what was the levelized cost of electricity from battery storage as of 2020?Context:\n\nAs of 2021, the power and capacity of the largest individual battery storage power plants is an order of magnitude less than that of the largest pumped storage power plants, the most common form of grid energy storage. For example, the Bath County Pumped Storage Station, the second largest in the world, can store 24GWh of electricity and dispatch 3GW while the first phase of Vistra Energy's Moss Landing Energy Storage Facility can store 1.2GWh and dispatch 300MW. Grid batteries do not however have to be large, and smaller ones can be deployed widely across a grid for greater redundancy.\n\nAs of 2019, battery power storage is cheaper than open cycle gas turbine power for use up to two hours, and there was around 365 GWh of battery storage deployed worldwide, growing extremely rapidly. Levelized cost of electricity from battery storage has fallen rapidly, halving in two years to US$150 per MWh as of 2020.\n\nAnswer:\n\nUS$150 per MWh.\n\n",
    "Instruction:\n\nGiven a reference text about Friedrich Rudolf Ludwig Freiherr von Canitz, when and where was he born?Context:\n\nFriedrich Rudolf Ludwig Freiherr von Canitz (27 November 1654 – 11 August 1699) was a German poet and diplomat. He was one of the few German poets of his era that Frederick the Great enjoyed.\n\nBiography\nCanitz was born in Berlin, Brandenburg. He was influenced by Boileau.  He attended the universities of Leiden and Leipzig, travelled in England, France, Italy and the Netherlands, and on his return was appointed groom of the bedchamber (Kammerjunker) to Frederick William, Elector of Brandenburg, whom he accompanied on his campaigns in Pomerania and Sweden.\n\nIn 1680 Canitz became councillor of legation, and he was employed on various embassies. In 1697 Elector Frederick III made him a privy councillor, and Emperor Leopold I created him a baron of the Empire. Having fallen ill on an embassy to the Hague, he obtained his discharge and died at Berlin in 1699.\n\nHe wrote verse in a restrained, sober style.  He was considered as one of the poets who “produced verse that was specifically aimed at entertaining and flattering princes and high courtiers.” Although he liked making verse in many languages, he never published any of them. Canitz's poems (Nebenstunden unterschiedener Gedichte), which did not appear until after his death (1700), are for the most part dry and stilted imitations of French and Latin models, but they formed a healthy contrast to the coarseness and bombast of the later Silesian poets.\n\nA complete edition of Canitz's poems was published by U. König in 1727; see also L. Fulda, Die Gegner der zweiten schlesischen Schule, ii. (1883).\n\nAnswer:\n\nFriedrich Rudolf Ludwig Freiherr von Canitz was born in Berlin on November 27, 1654.\n\n",
    "Context:\n\nDartmouth Night starts the college's traditional \"Homecoming\" weekend with an evening of speeches, a parade, and a bonfire. Traditionally, the freshman class builds the bonfire and then runs around it a set number of times in concordance with their class year; the class of 2009 performed 109 circuits, the class of 1999 performed 99, etc. The College officially discourages a number of student traditions of varying degrees of antiquity. During the circling of the bonfire, upperclassmen encourage the freshmen to \"touch the fire\", an action legally considered trespassing and prohibited by police officials present. At halftime of the Homecoming football game on the Saturday of the weekend, some upperclassmen encourage freshman to \"rush the field\", although no upperclassman has seen a significant rush since several injuries sustained during the 1986 rush prompted the school to ban the practice. Among the two or three students who sometimes run across the field, those who are arrested are charged with trespassing (the independent newspaper The Dartmouth Review claimed to set up a fund to automatically pay any fines associated with freshman who rush the field.) However, in 2012 this was proven false when two students rushed the field and were arrested for disorderly conduct. The Dartmouth Review ignored their emails until finally replying and denying that this fund had ever existed. These students then had to pay $300 fines out of pocket. For the 2011 Homecoming game, however, over 40 members of the Class of 2015 rushed the field at homecoming without any action taken by Safety and Security or the Hanover Police Department.\n\nInstruction:\n\nGiven this paragraph about Dartmouth College traditions, which homecoming-related traditions are illegal?\n\nAnswer:\n\nTouching the bonfire, and rushing the football field during halftime of the homecoming game\n\n",
    "Context:\n\nHot pot or hotpot (simplified Chinese: 火锅; traditional Chinese: 火鍋; pinyin: huǒguō; lit. 'fire pot'), also known as soup-food or steamboat, is a dish whereby a heat source placed on the dining table keeps a pot of soup stock simmering, and a variety of Chinese foodstuffs and ingredients are served beside the pot for the diners to put into the hot stock.\n\nInstruction:\n\nGiven a reference text that describes about hotpot, from which country does this dish originate?\n\nAnswer:\n\nHot pot or Hotpot is originated from China.\n\n",
    "Instruction:\n\nWhat is the population of Breezy Point city in Minnesota?Context:\n\nBreezy Point is a city in Crow Wing County, Minnesota, United States. It is part of the Brainerd Micropolitan Statistical Area. The population was 2,346 at the 2010 census.\n\nAnswer:\n\nBreezy Point's population was 2,346 at the 2010 census.\n\n",
    "Instruction:\n\nGiven this paragraph about Dartmouth College traditions, which homecoming-related traditions are illegal?Context:\n\nDartmouth Night starts the college's traditional \"Homecoming\" weekend with an evening of speeches, a parade, and a bonfire. Traditionally, the freshman class builds the bonfire and then runs around it a set number of times in concordance with their class year; the class of 2009 performed 109 circuits, the class of 1999 performed 99, etc. The College officially discourages a number of student traditions of varying degrees of antiquity. During the circling of the bonfire, upperclassmen encourage the freshmen to \"touch the fire\", an action legally considered trespassing and prohibited by police officials present. At halftime of the Homecoming football game on the Saturday of the weekend, some upperclassmen encourage freshman to \"rush the field\", although no upperclassman has seen a significant rush since several injuries sustained during the 1986 rush prompted the school to ban the practice. Among the two or three students who sometimes run across the field, those who are arrested are charged with trespassing (the independent newspaper The Dartmouth Review claimed to set up a fund to automatically pay any fines associated with freshman who rush the field.) However, in 2012 this was proven false when two students rushed the field and were arrested for disorderly conduct. The Dartmouth Review ignored their emails until finally replying and denying that this fund had ever existed. These students then had to pay $300 fines out of pocket. For the 2011 Homecoming game, however, over 40 members of the Class of 2015 rushed the field at homecoming without any action taken by Safety and Security or the Hanover Police Department.\n\nAnswer:\n\nTouching the bonfire, and rushing the football field during halftime of the homecoming game\n\n",
    "Instruction:\n\nWhich American president spoke Dutch as their first language?Context:\n\nVan Buren received a basic education at the village schoolhouse, and briefly studied Latin at the Kinderhook Academy and at Washington Seminary in Claverack. Van Buren was raised speaking primarily Dutch and learned English while attending school; he is the only president of the United States whose first language was not English. Also during his childhood, Van Buren learned at his father's inn how to interact with people from varied ethnic, income, and societal groups, which he used to his advantage as a political organizer. His formal education ended in 1796, when he began reading law at the office of Peter Silvester and his son Francis.\n\nAnswer:\n\nPresident Van Buren spoke Dutch as his first language. He is the only president of the United States of America who spoke English as a second language.\n\n",
    "Instruction:\n\nGiven this paragraph about video game consoles, what was the first console?Context:\n\nThe history of video game consoles, both home and handheld, had their origins in the 1970s. The concept of home consoles used to play games on a television set was founded by the 1972 Magnavox Odyssey, first conceived by Ralph H. Baer in 1966. Handheld consoles bore out from electro-mechanical games that had used mechanical controls and light-emitting diodes (LED) as visual indicators. Handheld electronic games had replaced the mechanical controls with electronic and digital components, and with the introduction of Liquid-crystal display (LCD) to create video-like screens with programmable pixels, systems like the Microvision and the Game & Watch became the first handheld video game consoles, and fully realized by the Game Boy system.\n\nAnswer:\n\nThe Magnavox Odyssey in 1972\n\n",
    "Context:\n\nIce hockey (or simply hockey) is a team sport played on ice skates, usually on an ice skating rink with lines and markings specific to the sport. It belongs to a family of sports called hockey. In ice hockey, two opposing teams use ice hockey sticks to control, advance, and shoot a closed, vulcanized, rubber disc called a \"puck\" into the other team's goal. Each goal is worth one point. The team which scores the most goals is declared the winner. In a formal game, each team has six skaters on the ice at a time, barring any penalties, one of whom is the goaltender. Ice hockey is a full contact sport, and is considered to be one of the more physically demanding sports.\n\nIce hockey is one of the sports featured in the Winter Olympics while its premiere international competition, the IIHF World Championships, are governed by the International Ice Hockey Federation (IIHF) for both men's and women's competitions.\n\nIn North America and parts of Europe the sport is known simply as hockey[citation needed]. However, in other countries, \"hockey\" usually refers to field hockey. In 1994 hockey was officially recognized as Canada's national winter sport.\n\nThe modern sport of ice hockey was developed in Canada, most notably in Montreal, where the first indoor game was played on March 3, 1875. Some characteristics of that game, such as the length of the ice rink and the use of a puck, have been retained to this day. Amateur ice hockey leagues began in the 1880s, and professional ice hockey originated around 1900. The Stanley Cup, emblematic of ice hockey club supremacy, was initially commissioned in 1892 as the \"Dominion Hockey Challenge Cup\" and was first awarded in 1893 to recognize the Canadian amateur champion and later became the championship trophy of the National Hockey League (NHL). In the early 1900s, the Canadian rules were adopted by the Ligue Internationale de Hockey Sur Glace, in Paris, France, the precursor of the IIHF. The sport was played for the first time at the Olympics during the 1920 Summer Olympics.\n\nWhile women also played during the game's early formative years, it was not until organizers began to officially remove body checking from female ice hockey beginning in the mid-1980s that it began to gain greater popularity, which by then had spread to Europe and a variety of other countries. The first IIHF Women's World Championship was held in 1990, and women's play was introduced into the Olympics in 1998.\n\nInstruction:\n\nWhy should I watch ice hockey\n\nAnswer:\n\nIce hockey is a team sport played on ice skates, usually on an ice skating rink with lines and markings specific to the sport. It belongs to a family of sports called hockey. In ice hockey, two opposing teams use ice hockey sticks to control, advance, and shoot a closed, vulcanized, rubber disc called a \"puck\" into the other team's goal. Each goal is worth one point. The team which scores the most goals is declared the winner. In a formal game, each team has six skaters on the ice at a time, barring any penalties, one of whom is the goaltender. Ice hockey is a full contact sport, and is considered to be one of the more physically demanding sports.\n\nIce hockey is fast, intense and fun to watch. The fans in the stadium are sitting close to the ice rink and cheer and push their favorite teams to reach their goals.\n\n",
    "Context:\n\nPPG Industries, Inc. is an American Fortune 500 company and global supplier of paints, coatings, and specialty materials. With headquarters in Pittsburgh, Pennsylvania, PPG operates in more than 70 countries around the globe. By revenue it is the largest coatings company in the world followed by AkzoNobel. It is headquartered in PPG Place, an office and retail complex in downtown Pittsburgh, and is known for its glass facade designed by Postmodern architect Philip Johnson.\n\nInstruction:\n\nWho is the largest coatings company in the world by revenue?\n\nAnswer:\n\nPPG Industries, Inc.\n\n",
    "Instruction:\n\nWhat type of babies did Regalado say Jiankui was making?Context:\n\nOn 25 November 2018, Regalado posted on MIT Technology Review website that He Jiankui was making CRIPSR babies. As it was publicised, He was prompted to announce his experiment and posted the news of the birth of twins, nicknamed Lulu and Nana, on YouTube in five videos the same day. He formally presented the experiment at the Second International Summit on Human Genome Editing organized at the University of Hong Kong on 28 November 2018. He explained that the experiment was to make the babies resistant to HIV infection as they were (as embryos) obtained from an HIV-positive father. He specifically used a mutant gene named CCR5-Δ32 that is known to confer innate resistance to HIV. The twins were born in secrecy in October 2018, and a third baby (revealed in 2022 as Amy) was then almost born, as He reported.\n\nAnswer:\n\nRegalado said that Jiankui was making CRIPSR babies.\n\n",
    "Context:\n\nNatural hydrogen (known as white hydrogen), is naturally occurring molecular hydrogen on or in Earth (as opposed to hydrogen produced in the laboratory or in industry). The name white hydrogen distinguishes it from green hydrogen, which is produced from renewable energy sources, and from grey, brown or black hydrogen, which is obtained from fossil sources or from the electrolysis of water. Natural hydrogen may be renewable, non-polluting and allows for lower cost operation compared to industrial hydrogen. Natural hydrogen has been identified in many source rocks in areas beyond the sedimentary basins where oil companies typically operate.\n\nOrigin of natural hydrogen\nThere are several sources of natural hydrogen:\n\n- degassing of deep hydrogen from the Earth's crust and mantle;\n- reaction of water with ultrabasic rocks (serpentinisation);\n- contact of water with reducing agents in the Earth's mantle;\n- interaction of water with freshly exposed rock surfaces (weathering);\n- decomposition of hydroxyl ions in the structure of minerals;\n- Natural radiolysis of water;\n- decomposition of organic matter;\n- biological activity\n- Extraction\n- Natural hydrogen is extracted from wells, mixed with other gases such as nitrogen or helium.\n\nSeveral sources have been identified in France. Geologists Alain Prinzhofer and Eric Derville have demonstrated the existence of large reservoirs in a dozen countries, including Mali and the United States. However, their potential remains difficult to assess.\n\nNumerous emanations on the ocean floor have been identified but are difficult to exploit. The discovery of a significant emergence in Russia in 2008 suggests the possibility of extracting native hydrogen in geological environments.\n\nGeology\nNatural hydrogen is generated continuously from a variety of natural sources. There are many known hydrogen emergences on mid-ocean ridges. Another of the known reactions, serpentinisation, occurs under the sea floor (in the oceanic crust).\n\nDiagenetic origin (iron oxidation) in the sedimentary basins of cratons, notably in Russia. Other sources are being explored, such as mantle hydrogen, or hydrogen from radiolysis (natural electrolysis) or from bacterial activity. In France, the Alps and Pyrenees are suitable for exploitation. New Caledonia has hyperalkaline sources that show dihydrogen emissions. A large accumulation of natural hydrogen was discovered in Bourakebougou (Mali).\n\nCharacteristics\nDihydrogen is very soluble in fresh water, especially at depth (solubility increases with pressure).\n\nhttps://en.wikipedia.org/wiki/Natural_hydrogen\n\nInstruction:\n\nGiven these paragraphs about Natural hydrogen, what are other forms of hydrogen obtained using different processes?\n\nAnswer:\n\nGreen hydrogen, which is produced from renewable energy sources, and from grey, brown or black hydrogen, which is obtained from fossil sources or from the electrolysis of water.\n\n",
    "Instruction:\n\nWhat's Rockhopper Exploration PLC business?Context:\n\nRockhopper Exploration PLC is an oil and gas exploration company headquartered in Salisbury, Wiltshire, United Kingdom. It owns offshore exploration and production licences in the North Falkland Basin in the waters north of the Falkland Islands.\n\nRockhopper is listed on the Alternative Investment Market of the London Stock Exchange.\n\nAnswer:\n\nRockhopper Exploration PLC is in the oil and gas business, headquartered in Salisbury, Wiltshire, United Kingdom.\n\n",
    "Context:\n\nCombat readiness is a condition of the armed forces and their constituent units and formations, warships, aircraft, weapon systems or other military technology and equipment to perform during combat military operations, or functions consistent with the purpose for which they are organized or designed, or the managing of resources and personnel training in preparation for combat.\n\nMost armed forces maintain varying levels of readiness by the troops to engage in combat due to economic considerations which vary from minutes to months. In modern armed forces troops designated special forces are usually those kept at the highest state of readiness for combat, and are often alerted only a few hours before being committed to combat. Where time is of the essence in military action being initiated, the troops, such as pilots of interceptor aircraft, may be kept in constant state of combat readiness.\n\nInstruction:\n\nGiven a reference text about combat readiness, tell me which troops are kept most ready for combat.\n\nAnswer:\n\nDesignated special forces are normally kept at the highest state of readiness for combat.\n\n",
    "Instruction:\n\nGiven the numerous awards in Major League Baseball, what is the Willie Mays World Series Most Valuable Player (MVP) Award?Context:\n\nThe Willie Mays World Series Most Valuable Player (MVP) Award is given to the Major League Baseball (MLB) player deemed to have the most impact on his team's performance in the World Series, which is the final round of the MLB postseason. The award was first presented in 1955 as the SPORT Magazine Award, but is now decided during the final game of the Series by a committee of reporters and officials present at the game. On September 29, 2017, it was renamed in honor of Willie Mays in remembrance of the 63rd anniversary of The Catch, which occurred the year prior to the award's debut; Mays never won the award himself.\n\nAnswer:\n\nThe Willie Mays World Series Most Valuable Player Award is given to the Major League Baseball player deemed to have the most impact on his team's performance in the World Series.\n\n",
    "Context:\n\nMS Dhoni, is a former Indian cricketer and captain of the Indian national team in limited-overs formats from 2007 to 2017 and in Test cricket from 2008 to 2014, who plays as a Wicket-keeper-Batsman. He is also the current captain of Chennai Super Kings in the Indian Premier League. Under his captaincy, India won the 2007 ICC World Twenty20, the 2011 Cricket World Cup, and the 2013 ICC Champions Trophy, the most by any captain. He also led India to victory in the 2010 and 2016 Asia Cup. Additionally, under his leadership, India won the 2010 and 2011 ICC Test Mace and 2013 ICC ODI Championship. Dhoni is a right-handed wicket-keeper batsman known for his calm captaincy and his ability to finish matches in tight situations. He has scored 17,266 runs in International Cricket (including 10,000 plus runs in ODI Internationals) and is considered one of the best finishers in the game, as well as one of the greatest wicket-keepers and captains in the history of cricket.\n\nInstruction:\n\nFrom the below text about MS Dhoni, tell me what they were most famous for?\n\nAnswer:\n\nMS Dhoni is a former cricketer and captain of the Indian national team. He is most famously known for leading India to victory in 2007 ICC World Twenty20, the 2011 Cricket World Cup and the 2013 ICC Champions Trophy. He is also known for his calm captaincy and considered as one of the best finishers and greatest wicket-keepers in the history of the game.\n\n",
    "Instruction:\n\nWho is the largest coatings company in the world by revenue?Context:\n\nPPG Industries, Inc. is an American Fortune 500 company and global supplier of paints, coatings, and specialty materials. With headquarters in Pittsburgh, Pennsylvania, PPG operates in more than 70 countries around the globe. By revenue it is the largest coatings company in the world followed by AkzoNobel. It is headquartered in PPG Place, an office and retail complex in downtown Pittsburgh, and is known for its glass facade designed by Postmodern architect Philip Johnson.\n\nAnswer:\n\nPPG Industries, Inc.\n\n",
    "Instruction:\n\nGiven a reference text about combat readiness, tell me which troops are kept most ready for combat.Context:\n\nCombat readiness is a condition of the armed forces and their constituent units and formations, warships, aircraft, weapon systems or other military technology and equipment to perform during combat military operations, or functions consistent with the purpose for which they are organized or designed, or the managing of resources and personnel training in preparation for combat.\n\nMost armed forces maintain varying levels of readiness by the troops to engage in combat due to economic considerations which vary from minutes to months. In modern armed forces troops designated special forces are usually those kept at the highest state of readiness for combat, and are often alerted only a few hours before being committed to combat. Where time is of the essence in military action being initiated, the troops, such as pilots of interceptor aircraft, may be kept in constant state of combat readiness.\n\nAnswer:\n\nDesignated special forces are normally kept at the highest state of readiness for combat.\n\n",
    "Instruction:\n\nGiven these paragraphs about Multiomics, what is panomics?Context:\n\nMultiomics, multi-omics, integrative omics, \"panomics\" or \"pan-omics\" is a biological analysis approach in which the data sets are multiple \"omes\", such as the genome, proteome, transcriptome, epigenome, metabolome, and microbiome (i.e., a meta-genome and/or meta-transcriptome, depending upon how it is sequenced); in other words, the use of multiple omics technologies to study life in a concerted way. By combining these \"omes\", scientists can analyze complex biological big data to find novel associations between biological entities, pinpoint relevant biomarkers and build elaborate markers of disease and physiology. In doing so, multiomics integrates diverse omics data to find a coherently matching geno-pheno-envirotype relationship or association. The OmicTools service lists more than 99 softwares related to multiomic data analysis, as well as more than 99 databases on the topic.\n\nSystems biology approaches are often based upon the use of panomic analysis data. The American Society of Clinical Oncology (ASCO) defines panomics as referring to \"the interaction of all biological functions within a cell and with other body functions, combining data collected by targeted tests ... and global assays (such as genome sequencing) with other patient-specific information.\"\n\nSingle-cell multiomics\nA branch of the field of multiomics is the analysis of multilevel single-cell data, called single-cell multiomics. This approach gives us an unprecedent resolution to look at multilevel transitions in health and disease at the single cell level. An advantage in relation to bulk analysis is to mitigate confounding factors derived from cell to cell variation, allowing the uncovering of heterogeneous tissue architectures.\n\nMethods for parallel single-cell genomic and transcriptomic analysis can be based on simultaneous amplification or physical separation of RNA and genomic DNA. They allow insights that cannot be gathered solely from transcriptomic analysis, as RNA data do not contain non-coding genomic regions and information regarding copy-number variation, for example. An extension of this methodology is the integration of single-cell transcriptomes to single-cell methylomes, combining single-cell bisulfite sequencing to single cell RNA-Seq. Other techniques to query the epigenome, as single-cell ATAC-Seq and single-cell Hi-C also exist.\n\nA different, but related, challenge is the integration of proteomic and transcriptomic data. One approach to perform such measurement is to physically separate single-cell lysates in two, processing half for RNA, and half for proteins. The protein content of lysates can be measured by proximity extension assays (PEA), for example, which use DNA-barcoded antibodies. A different approach uses a combination of heavy-metal RNA probes and protein antibodies to adapt mass cytometry for multiomic analysis.\n\nMultiomics and machine learning\nIn parallel to the advances in highthroughput biology, machine learning applications to biomedical data analysis are flourishing. The integration of multi-omics data analysis and machine learning has led to the discovery of new biomarkers. For example, one of the methods of the mixOmics project implements a method based on sparse Partial Least Squares regression for selection of features (putative biomarkers).\n\n\nhttps://en.wikipedia.org/wiki/Multiomics\n\nAnswer:\n\nThe American Society of Clinical Oncology (ASCO) defines panomics as referring to \"the interaction of all biological functions within a cell and with other body functions, combining data collected by targeted tests ... and global assays (such as genome sequencing) with other patient-specific information.\"\n\n",
    "Context:\n\nJames A. Garfield, the 20th president of the United States, was shot at the Baltimore and Potomac Railroad Station in Washington, D.C., at 9:30 am on Saturday, July 2, 1881. He died in Elberon, New Jersey, 79 days later on September 19, 1881. The shooting occurred less than four months into his term as president. Garfield's assassin was Charles J. Guiteau, whose motive was revenge against Garfield for an imagined political debt, and getting Chester A. Arthur elevated to president. Guiteau was convicted of Garfield's murder and executed by hanging one year after the shooting.\n\nPart of Guiteau's preserved brain is on display at the Mütter Museum at the College of Physicians of Philadelphia. Guiteau's bones and more of his brain, along with Garfield's backbone and a few ribs, are kept at the National Museum of Health and Medicine, at the Army's Forest Glen Annex in Silver Spring, Maryland. Garfield's assassination was instrumental to the passage of the Pendleton Civil Service Reform Act on January 16, 1883. Garfield himself had called for civil service reform in his inaugural address and supported it as president in the belief that it would make government more efficient. It was passed as something of a memorial to the fallen President. Arthur lost the Republican nomination in 1884 to Blaine, who went on to lose a close election to Democrat Grover Cleveland.\n\nInstruction:\n\nGiven that preserving human brains for more than a century is fairly uncommon, what do you think was the motivation for preserving Guiteau's brain?\n\nAnswer:\n\nOne reason for preserving the brain may have been to study structural abnormalities that could have explained Guiteau's violent behavior. Alternatively, because Guiteau was well-known and infamous, his brain may have been preserved for use as a memento or as a warning to discourage presidential assassinations in the future.\n\n",
    "Instruction:\n\nGiven these paragraphs about Hydrogen Storage, what have been the two main historical forms of storage?Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nAnswer:\n\nFor many years hydrogen has been stored as compressed gas or cryogenic liquid.\n\n",
    "Context:\n\nMultiomics, multi-omics, integrative omics, \"panomics\" or \"pan-omics\" is a biological analysis approach in which the data sets are multiple \"omes\", such as the genome, proteome, transcriptome, epigenome, metabolome, and microbiome (i.e., a meta-genome and/or meta-transcriptome, depending upon how it is sequenced); in other words, the use of multiple omics technologies to study life in a concerted way. By combining these \"omes\", scientists can analyze complex biological big data to find novel associations between biological entities, pinpoint relevant biomarkers and build elaborate markers of disease and physiology. In doing so, multiomics integrates diverse omics data to find a coherently matching geno-pheno-envirotype relationship or association. The OmicTools service lists more than 99 softwares related to multiomic data analysis, as well as more than 99 databases on the topic.\n\nSystems biology approaches are often based upon the use of panomic analysis data. The American Society of Clinical Oncology (ASCO) defines panomics as referring to \"the interaction of all biological functions within a cell and with other body functions, combining data collected by targeted tests ... and global assays (such as genome sequencing) with other patient-specific information.\"\n\nSingle-cell multiomics\nA branch of the field of multiomics is the analysis of multilevel single-cell data, called single-cell multiomics. This approach gives us an unprecedent resolution to look at multilevel transitions in health and disease at the single cell level. An advantage in relation to bulk analysis is to mitigate confounding factors derived from cell to cell variation, allowing the uncovering of heterogeneous tissue architectures.\n\nMethods for parallel single-cell genomic and transcriptomic analysis can be based on simultaneous amplification or physical separation of RNA and genomic DNA. They allow insights that cannot be gathered solely from transcriptomic analysis, as RNA data do not contain non-coding genomic regions and information regarding copy-number variation, for example. An extension of this methodology is the integration of single-cell transcriptomes to single-cell methylomes, combining single-cell bisulfite sequencing to single cell RNA-Seq. Other techniques to query the epigenome, as single-cell ATAC-Seq and single-cell Hi-C also exist.\n\nA different, but related, challenge is the integration of proteomic and transcriptomic data. One approach to perform such measurement is to physically separate single-cell lysates in two, processing half for RNA, and half for proteins. The protein content of lysates can be measured by proximity extension assays (PEA), for example, which use DNA-barcoded antibodies. A different approach uses a combination of heavy-metal RNA probes and protein antibodies to adapt mass cytometry for multiomic analysis.\n\nMultiomics and machine learning\nIn parallel to the advances in highthroughput biology, machine learning applications to biomedical data analysis are flourishing. The integration of multi-omics data analysis and machine learning has led to the discovery of new biomarkers. For example, one of the methods of the mixOmics project implements a method based on sparse Partial Least Squares regression for selection of features (putative biomarkers).\n\n\nhttps://en.wikipedia.org/wiki/Multiomics\n\nInstruction:\n\nGiven these paragraphs about Multiomics, what is panomics?\n\nAnswer:\n\nThe American Society of Clinical Oncology (ASCO) defines panomics as referring to \"the interaction of all biological functions within a cell and with other body functions, combining data collected by targeted tests ... and global assays (such as genome sequencing) with other patient-specific information.\"\n\n",
    "Instruction:\n\nWho is the first astronaut to get into space in China?Context:\n\nIn 2003, Yang Liwei was launched aboard Shenzhou 5, becoming the first person sent into space by the Chinese space program. This achievement made China the third country to independently send humans into space.\n\nAnswer:\n\nYang Liwei, who reached space in 2003 onboard the Shenzhou 5 space ship, is the first astronaut in China to reach space.\n\n",
    "Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nInstruction:\n\nGiven these paragraphs about Hydrogen Storage, what have been the two main historical forms of storage?\n\nAnswer:\n\nFor many years hydrogen has been stored as compressed gas or cryogenic liquid.\n\n",
    "Instruction:\n\nGiven a reference text that describes about hotpot, from which country does this dish originate?Context:\n\nHot pot or hotpot (simplified Chinese: 火锅; traditional Chinese: 火鍋; pinyin: huǒguō; lit. 'fire pot'), also known as soup-food or steamboat, is a dish whereby a heat source placed on the dining table keeps a pot of soup stock simmering, and a variety of Chinese foodstuffs and ingredients are served beside the pot for the diners to put into the hot stock.\n\nAnswer:\n\nHot pot or Hotpot is originated from China.\n\n",
    "Context:\n\nhe Beatles were an English rock band, formed in Liverpool in 1960, that comprised John Lennon, Paul McCartney, George Harrison and Ringo Starr. They are regarded as the most influential band of all time and were integral to the development of 1960s counterculture and popular music's recognition as an art form. Rooted in skiffle, beat and 1950s rock 'n' roll, their sound incorporated elements of classical music and traditional pop in innovative ways; the band also explored music styles ranging from folk and Indian music to psychedelia and hard rock. As pioneers in recording, songwriting and artistic presentation, the Beatles revolutionised many aspects of the music industry and were often publicised as leaders of the era's youth and sociocultural movements\n\nInstruction:\n\nWhich era of counterculture were the Beatles pivotal to?\n\nAnswer:\n\nThe Beatles were integral to the development of 1960s counterculture\n\n",
    "Instruction:\n\nWhat is Clemson University?Context:\n\nClemson University (/ˈklɛmp.sən, ˈklɛm.zən/[note a]) is a public land-grant research university in Clemson, South Carolina. Founded in 1889, Clemson is the second-largest university by enrollment in South Carolina. For the fall 2019 semester, the university enrolled a total of 20,195 undergraduate students and 5,627 graduate students, and the student/faculty ratio was 18:1. Clemson's 1,400-acre campus  is in the foothills of the Blue Ridge Mountains. The campus now borders Lake Hartwell, which was formed by the dam completed in 1962. The university manages the nearby 17,500-acre Clemson Experimental Forest that is used for research, education, and recreation.\n\nClemson University consists of seven colleges: Agriculture, Forestry and Life Sciences; Architecture, Arts and Humanities; The Wilbur O. and Ann Powers College of Business; Behavioral, Social and Health Sciences; Education; Engineering, Computing and Applied Sciences; and Science. U.S. News & World Report ranks Clemson University 77th for 2022 among national U.S. universities. Clemson University is classified among \"R1: Doctoral Universities – Very high research activity.\"\n\nAnswer:\n\nClemson University is a School based in the Upstate of South Carolina in a town called Clemson. They are known for their Football team and bright orange paw. Clemson is consistently a top 10 football team. Their biggest in-state rival is the University of South Carolina Gamecocks. Clemson has 7 different colleges ranging from Engineering, Business, Agriculture, and Health Sciences.\n\n",
    "Instruction:\n\nGiven these paragraphs about Large language models, when did LLMs emerge?Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nAnswer:\n\nAround 2018.\n\n",
    "Context:\n\nThe European Union (EU) is a supranational political and economic union of 27 member states that are located primarily in Europe. The union has a total area of 4,233,255.3 km2 (1,634,469.0 sq mi) and an estimated total population of nearly 447 million. The EU has often been described as a sui generis political entity (without precedent or comparison) combining the characteristics of both a federation and a confederation.\n\nInstruction:\n\nHow many member states does the European Union have?\n\nAnswer:\n\n27\n\n",
    "Context:\n\nCharles Henry Bromedge Caldwell was born in Hingham, Massachusetts on February 24, 1823. He entered the navy as midshipman February 27, 1838, and became lieutenant September 4, 1852. He commanded the USS Vandalia in the US Navy's second Fiji expedition, an 1859 punitive expedition against Waya Island warriors who had cannibalized two American traders. In 1862, he commanded the gun-boat Itasca, of the western gulf blockading squadron, and took part in the bombardment of Forts Jackson and St. Philip. On the night of April 20, his gun-boat, with the Pinola, was sent on an expedition under the command of Fleet-Capt. Bell, to make a passage for the fleet through the chain obstructions near the forts. Lieut. Caldwell and his party boarded one of the hulks that held the chains, and succeeded in detaching the latter, in spite of the heavy fire to which they were subjected. The Itasca was then swept on shore by the current, in full sight of the forts, and it was half an hour before she was afloat again. She was unable to pass the forts with the rest of the fleet, owing to a shot that penetrated her boiler. Lieut. Caldwell was in the action at Grand Gulf, June 9, 1862, and was promoted to commander on July 16 1862.\n\nHe commanded the iron-clad Essex, of the Mississippi squadron in 1862–63, and took part in the operations at Port Hudson, from March to July 1863, in command of the Essex and the mortar flotilla.\n\nHe commanded the Glaucus of the North Atlantic blockading squadron from 1863 till 1864, and the R. R. Cuyler, of the same squadron, from 1864 till 1865. He became captain, December 12, 1867, chief of staff of the North Atlantic fleet in 1870, and commodore on June 14, 1874.\n\nHe died on November 30, 1877.\n\nInstruction:\n\nGiven this reference text about the career of Charles Henry Bromedge Caldwell, name the ships he commanded after his promotion to the rank of Commander.\n\nAnswer:\n\nEssex\nGlaucus\nR. R. Cuyler\n\n",
    "Context:\n\nIn 1931 the Ford Motor Company relocated from Trafford Park in Manchester, to a larger new plant in Dagenham, which was already the location of supplier Briggs Motorway Bodies. A 500-acre (200 ha) riverside site was developed to become Europe's largest car plant, a vast vertically integrated site with its own blast furnaces and power station, importing iron ore and exporting finished vehicles. By the 1950s Ford had taken over Briggs at Dagenham and its other sites at Doncaster, Southampton, Croydon and Romford. At its peak the Dagenham plant had 4,000,000 square feet (370,000 m2) of floor space and employed over 40,000 people, although this number gradually fell during the final three decades of the 20th century as production methods advanced and Ford invested in other European factories as well. Some of Britain's best selling cars, including the Fiesta, Escort, Cortina and Sierra, were produced at the plant over the next 71 years.\n\nInstruction:\n\nTo which town in the UK did the Ford Motor Company relocate to in 1931?\n\nAnswer:\n\nDagenham\n\n",
    "Instruction:\n\nLuka Modrić (Croatian pronunciation: [lûːka mǒːdritɕ]; born 9 September 1985) is a Croatian professional footballer who plays as a midfielder for La Liga club Real Madrid and captains the Croatia national team. He plays mainly as a central midfielder, but can also play as an attacking midfielder or as a defensive midfielder. He is widely regarded as one of the greatest midfielders of all time, and as the greatest ever Croatian footballer.\n\nBorn in Zadar, Modrić's childhood coincided with the Croatian War of Independence which displaced his family. In 2002, he was signed by Dinamo Zagreb at age 16, after showing promise with his hometown club NK Zadar's youth team. He continued his development in Zagreb, before spells on loan to Zrinjski Mostar and Inter Zaprešić. He made his debut for Dinamo in 2005 and won three consecutive league titles and domestic cups, being named the Prva HNL Player of the Year in 2007. In 2008, he moved to Premier League club Tottenham Hotspur for a club-record transfer fee of £16.5 million, where he led Spurs to their first UEFA Champions League appearance in almost 50 years, reaching the quarter-finals of the 2010–11 tournament.\n\nIn the summer of 2012, Modrić joined Real Madrid for a £30 million transfer fee. There he became a key contributor and helped the team win La Décima and was selected for the 2013–14 Champions League squad of the season. After Zinedine Zidane took over Madrid, Modrić was critical to three consecutive Champions League titles from 2015–16 to 2017–18, each time being voted into the squad of the season. He has won twenty-two major trophies at Real Madrid, including five UEFA Champions League titles, three La Liga titles, one Copa del Rey, four Supercopa de España titles, four UEFA Super Cup titles and five FIFA Club World Cup titles. He won the La Liga Award for \"Best Midfielder\" in 2016 for the second time, and the UEFA Club Football Award for \"Best Midfielder\" in 2017 and 2018. In 2015, he became the first Croatian player to be included in the FIFA FIFPRO World 11, in which he was regularly included until 2019 and then again in 2022, as well in the UEFA Team of the Year between 2016 and 2018. In 2018, Modrić became the first Croatian player to win the UEFA Men's Player of the Year Award, and by winning The Best FIFA Men's Player and Ballon d'Or awards, he became the first player other than Lionel Messi or Cristiano Ronaldo to claim the awards in more than a decade. In 2019, he was awarded the Golden Foot award for career results and personality.\n\nModrić made his international debut for Croatia against Argentina in March 2006, and scored his first international goal in a friendly match against Italy. Modrić has anchored Croatia's \"second Golden Generation\", participating in every major tournament Croatia has qualified for, including the UEFA Euro 2008, 2012, 2016, and 2020, as well as the 2006, 2014, 2018, and 2022 FIFA World Cup. At the Euro 2008, he was selected for the Team of the Tournament, becoming only the second Croatian to ever achieve this honour. Following group stage eliminations in his first two World Cups, Modrić led Croatia to the 2018 World Cup Final, winning the Golden Ball in process. At the following tournament, he led the team to a third-place finish, winning the Bronze Ball in process. In March 2021, he went on to become the country's most capped player in history. Furthermore, he has been named Croatian Footballer of the Year a record eleven times between 2007 and 2022.Context:\n\nWho is Luka Modric?\n\nAnswer:\n\nLuka Modric is a Croatian professional football (soccer) player. He is considered one of the best midfielders of all time and best Croatian player ever. He was born in Zadar, Croatia. In 2002, at the age of 16, he signed with the biggest Croatian soccer club, Dinamo Zagreb where is stayed till 2008 when he signed with Tottenham Hotspur in England. In 2012 he signed with Real Madrid in Spain where he currently plays.\n\n",
    "Context:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. The name may also refer to wines created predominantly from pinot noir grapes. The name is derived from the French words for pine and black. The word pine alludes to the grape variety having tightly clustered, pinecone–shaped bunches of fruit.\n\nPinot noir is grown around the world, mostly in cooler climates, and the variety is chiefly associated with the Burgundy region of France. Pinot noir is now used to make red wines around the world, as well as champagne, sparkling white wines such as the Italian Franciacorta, and English sparkling wines. Regions that have gained a reputation for red pinot noir wines include the Willamette Valley of Oregon; the Carneros, Central Coast, Sonoma Coast, and Russian River AVAs of California; the Elgin and Walker Bay wine regions of South Africa; the Mornington Peninsula, Adelaide Hills, Great Southern, Tasmania, and Yarra Valley in Australia; and the Central Otago, Martinborough, and Marlborough wine regions of New Zealand. Pinot noir is the most planted varietal (38%) used in sparkling wine production in Champagne and other wine regions.\n\nInstruction:\n\nWhat is Pinot Noir?\n\nAnswer:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. Pinot noir is grown around the world, mostly in cooler climates, and the variety is chiefly associated with the Burgundy region of France. Pinot noir is now used to make red wines around the world, as well as champagne, sparkling white wines such as the Italian Franciacorta, and English sparkling wines.\n\n",
    "Context:\n\nLakshmi Puja is celebrated as a part of Tihar, a second national festival of Nepal after Dashain. In Nepal, it is celebrated for five days, which include Kag (crow) Tihar; Kukur (dog) Tihar; Gai (cow) Tihar in the morning and Lakshmi Puja at night; Maha puja (self puja); Goru (Ox and Bull) Tihar and Gobardhan puja; and finally, Bhai Tika (Bhai dhooj)—respectively the first, second, third, fourth and fifth days.\n\nInstruction:\n\nWhat is the last festival celebrated in Tihar and how long does the festival last?\n\nAnswer:\n\nThe festival lasts for 5 days and Bhai Tika is the last festival.\n\n",
    "Context:\n\nRockhopper Exploration PLC is an oil and gas exploration company headquartered in Salisbury, Wiltshire, United Kingdom. It owns offshore exploration and production licences in the North Falkland Basin in the waters north of the Falkland Islands.\n\nRockhopper is listed on the Alternative Investment Market of the London Stock Exchange.\n\nInstruction:\n\nWhat's Rockhopper Exploration PLC business?\n\nAnswer:\n\nRockhopper Exploration PLC is in the oil and gas business, headquartered in Salisbury, Wiltshire, United Kingdom.\n\n",
    "Instruction:\n\nWhen did King Charles II return to Navarre?Context:\n\nKing Charles II returned to Navarre in November 1361, leaving his wife and son behind in France. When in January 1363 it was her turn to move to Navarre, Queen Joan left Charles in the custody of his aunt Blanche, sister of his father and widow of his maternal great-grandfather King Philip VI of France. Charles was reunited with his mother when she returned to France in December 1365, and the following August Charles set foot in his father's kingdom for the first time.\n\nAnswer:\n\nKing Charles II returned to Navarre in November 1361.\n\n",
    "Context:\n\nIn 2003, Yang Liwei was launched aboard Shenzhou 5, becoming the first person sent into space by the Chinese space program. This achievement made China the third country to independently send humans into space.\n\nInstruction:\n\nWho is the first astronaut to get into space in China?\n\nAnswer:\n\nYang Liwei, who reached space in 2003 onboard the Shenzhou 5 space ship, is the first astronaut in China to reach space.\n\n",
    "Instruction:\n\nWhat is the largest retailers and e-commerce companies?Context:\n\nAlibaba is one of the world's largest retailers and e-commerce companies. In 2020, it was also rated as the fifth-largest artificial intelligence company. It is also one of the biggest venture capital firms and investment corporations in the world, as well as the second largest financial services group behind Visa via its fintech arm Ant Group. The company hosts the largest B2B (Alibaba.com), C2C (Taobao), and B2C (Tmall) marketplaces in the world. It has been expanding into the media industry, with revenues rising by triple percentage points year after year. It also set the record on the 2018 edition of China's Singles' Day, the world's biggest online and offline shopping day.\n\nAnswer:\n\nAlibaba is one of the world's largest retailers and e-commerce companies. It consists of many business including B2B (Alibaba.com), C2C (Taobao) and B2C (Tmall). Alibaba is also one of the largest financial companies and AI companies.\n\n",
    "Context:\n\nClemson University (/ˈklɛmp.sən, ˈklɛm.zən/[note a]) is a public land-grant research university in Clemson, South Carolina. Founded in 1889, Clemson is the second-largest university by enrollment in South Carolina. For the fall 2019 semester, the university enrolled a total of 20,195 undergraduate students and 5,627 graduate students, and the student/faculty ratio was 18:1. Clemson's 1,400-acre campus  is in the foothills of the Blue Ridge Mountains. The campus now borders Lake Hartwell, which was formed by the dam completed in 1962. The university manages the nearby 17,500-acre Clemson Experimental Forest that is used for research, education, and recreation.\n\nClemson University consists of seven colleges: Agriculture, Forestry and Life Sciences; Architecture, Arts and Humanities; The Wilbur O. and Ann Powers College of Business; Behavioral, Social and Health Sciences; Education; Engineering, Computing and Applied Sciences; and Science. U.S. News & World Report ranks Clemson University 77th for 2022 among national U.S. universities. Clemson University is classified among \"R1: Doctoral Universities – Very high research activity.\"\n\nInstruction:\n\nWhat is Clemson University?\n\nAnswer:\n\nClemson University is a School based in the Upstate of South Carolina in a town called Clemson. They are known for their Football team and bright orange paw. Clemson is consistently a top 10 football team. Their biggest in-state rival is the University of South Carolina Gamecocks. Clemson has 7 different colleges ranging from Engineering, Business, Agriculture, and Health Sciences.\n\n",
    "Instruction:\n\nWhat was unique about Scrubs?Context:\n\nScrubs focuses on the unique point of view of its main character and narrator, Dr. John Michael \"J.D.\" Dorian (Zach Braff) for the first eight seasons, with season nine being narrated by the new main character Lucy Bennett (Kerry Bishé). Most episodes feature multiple story lines thematically linked by voice-overs done by Braff, as well as the comical daydreams of J.D. According to Bill Lawrence, \"What we decided was, rather than have it be a monotone narration, if it's going to be Zach's voice, we're going to do everything through J.D.'s eyes. It opened up a visual medium that those of us as comedy writers were not used to.\" Actors were given the chance to improvise their lines on set with encouragement by series creator Bill Lawrence, with Neil Flynn and Zach Braff being the main improvisors.\n\nAnswer:\n\nMost episodes featured voice-overs done by Zach Braff (who stars as the main character, J.D.), as well as the comical daydreams of J.D. This opened up a unique visual medium that the comedy writers were not used to. Also, actors were given the chance to improvise their lines on set.\n\n",
    "Context:\n\nThe Willie Mays World Series Most Valuable Player (MVP) Award is given to the Major League Baseball (MLB) player deemed to have the most impact on his team's performance in the World Series, which is the final round of the MLB postseason. The award was first presented in 1955 as the SPORT Magazine Award, but is now decided during the final game of the Series by a committee of reporters and officials present at the game. On September 29, 2017, it was renamed in honor of Willie Mays in remembrance of the 63rd anniversary of The Catch, which occurred the year prior to the award's debut; Mays never won the award himself.\n\nInstruction:\n\nGiven the numerous awards in Major League Baseball, what is the Willie Mays World Series Most Valuable Player (MVP) Award?\n\nAnswer:\n\nThe Willie Mays World Series Most Valuable Player Award is given to the Major League Baseball player deemed to have the most impact on his team's performance in the World Series.\n\n",
    "Instruction:\n\nHow many member states does the European Union have?Context:\n\nThe European Union (EU) is a supranational political and economic union of 27 member states that are located primarily in Europe. The union has a total area of 4,233,255.3 km2 (1,634,469.0 sq mi) and an estimated total population of nearly 447 million. The EU has often been described as a sui generis political entity (without precedent or comparison) combining the characteristics of both a federation and a confederation.\n\nAnswer:\n\n27\n\n",
    "Instruction:\n\nWhy should I watch ice hockeyContext:\n\nIce hockey (or simply hockey) is a team sport played on ice skates, usually on an ice skating rink with lines and markings specific to the sport. It belongs to a family of sports called hockey. In ice hockey, two opposing teams use ice hockey sticks to control, advance, and shoot a closed, vulcanized, rubber disc called a \"puck\" into the other team's goal. Each goal is worth one point. The team which scores the most goals is declared the winner. In a formal game, each team has six skaters on the ice at a time, barring any penalties, one of whom is the goaltender. Ice hockey is a full contact sport, and is considered to be one of the more physically demanding sports.\n\nIce hockey is one of the sports featured in the Winter Olympics while its premiere international competition, the IIHF World Championships, are governed by the International Ice Hockey Federation (IIHF) for both men's and women's competitions.\n\nIn North America and parts of Europe the sport is known simply as hockey[citation needed]. However, in other countries, \"hockey\" usually refers to field hockey. In 1994 hockey was officially recognized as Canada's national winter sport.\n\nThe modern sport of ice hockey was developed in Canada, most notably in Montreal, where the first indoor game was played on March 3, 1875. Some characteristics of that game, such as the length of the ice rink and the use of a puck, have been retained to this day. Amateur ice hockey leagues began in the 1880s, and professional ice hockey originated around 1900. The Stanley Cup, emblematic of ice hockey club supremacy, was initially commissioned in 1892 as the \"Dominion Hockey Challenge Cup\" and was first awarded in 1893 to recognize the Canadian amateur champion and later became the championship trophy of the National Hockey League (NHL). In the early 1900s, the Canadian rules were adopted by the Ligue Internationale de Hockey Sur Glace, in Paris, France, the precursor of the IIHF. The sport was played for the first time at the Olympics during the 1920 Summer Olympics.\n\nWhile women also played during the game's early formative years, it was not until organizers began to officially remove body checking from female ice hockey beginning in the mid-1980s that it began to gain greater popularity, which by then had spread to Europe and a variety of other countries. The first IIHF Women's World Championship was held in 1990, and women's play was introduced into the Olympics in 1998.\n\nAnswer:\n\nIce hockey is a team sport played on ice skates, usually on an ice skating rink with lines and markings specific to the sport. It belongs to a family of sports called hockey. In ice hockey, two opposing teams use ice hockey sticks to control, advance, and shoot a closed, vulcanized, rubber disc called a \"puck\" into the other team's goal. Each goal is worth one point. The team which scores the most goals is declared the winner. In a formal game, each team has six skaters on the ice at a time, barring any penalties, one of whom is the goaltender. Ice hockey is a full contact sport, and is considered to be one of the more physically demanding sports.\n\nIce hockey is fast, intense and fun to watch. The fans in the stadium are sitting close to the ice rink and cheer and push their favorite teams to reach their goals.\n\n",
    "Context:\n\nIn modern historiography, Ancient Rome refers to Roman civilisation from the founding of the Italian city of Rome in the 8th century BC to the collapse of the Western Roman Empire in the 5th century AD. It encompasses the Roman Kingdom (753–509 BC), Roman Republic (509–27 BC) and Roman Empire (27 BC–476 AD) until the fall of the western empire.\n\nInstruction:\n\nHow long did the Roman Empire last\n\nAnswer:\n\n1229 years\n\n",
    "Instruction:\n\nWhat is Gyebangsan?Context:\n\nGyebangsan is a mountain of Gyeongsangnam-do, located in southeastern South Korea.\n\nAnswer:\n\nGyebangsan is a mountain, located in southeastern South Korea.\n\n",
    "Context:\n\nReginaldo de França Lopes (born 31 October 1969), known as Reginaldo França, is a Brazilian professional football manager and former player.\n\nA defensive midfielder, França played his entire career for teams in the Ceará state, aside from a short period at Cascavel in 2004, and notably represented Ferroviário in the 2002 Série C. He retired in 2006 with São Benedito, and subsequently became their manager in the following year. As a manager, he also remained in his native state, notably managing Maranguape for nearly four consecutive years.\n\nInstruction:\n\nGiven a reference text about Reginaldo de França Lopes, tell me what sport and position he played and when he retired.\n\nAnswer:\n\nReginaldo de França Lopes was a footballer who played defensive midfielder. He retired from playing football in 2006 and became a manager.\n\n",
    "Context:\n\nDue to the demand for the toy, Squishmallows are often sold by resellers for an increased price. The average resell price for a Squishmallow depends on the size, condition, and rarity of the specific item. Some limited edition or high-demand Squishmallows are sold by resellers and collectors for hundreds or thousands of dollars. Jack the Black Cat, known for its closed white eyes and white whiskers, is one of the rarest Squishmallows sold to date. KellyToys introduced the limited edition stuffed animal on their website in 2020, where it sold out within two hours. Third party websites like eBay host listings for Jack the Black Cat valued at nearly $2,000. Among the many Squishmallows that are sold, some of the most popular include Connor the Cow, Malcolm the Mushroom, Archie the Axolotl, and Philippe the Frog. There are reports that resellers are harassed and doxxed by the community.\n\nInstruction:\n\nWhat makes a Squishmallow resellable?\n\nAnswer:\n\nSquishmallows are a highly demanded toy and also often are sold as limited edition items. As a result, Squishmallows that are more unique and rare can often be sold or higher value later. One example is Jack the Black Cat which has been listed on eBay for nearly $2,000.\n\n",
    "Context:\n\nThe sixth-generation Subaru Outback for the North American market was unveiled at the New York Auto Show on April 17, 2019. Full production started from July 29, 2019. This redesigned Outback keeps the same body style (wagon/crossover SUV), while still receiving a few changes, such as new taillights (similar to the ones on the Forester and upcoming Legacy) and an updated, modern interior.\n\nInternally, the 2020 Outback moves to the Subaru Global Platform, which is stiffer and offers a common base to allow use of alternative powertrains, such as hybrid or all-electric. The base model sixth-generation Outback was offered with the 2.5-liter gasoline direct-injection FB25D; a turbocharged 2.4-liter FA24F that was first used on the Subaru Ascent was offered as the uplevel engine, providing improved power, torque, and consumption compared to the discontinued EZ36.\n\nIn addition to all-wheel drive coming standard on every trim, the 2021 model year also added LED adaptive steering-responsive headlights (SRH) on premium variants and a seat-belt reminder standard for all passengers.\n\nWorld markets outside of North America, including Japan, did not launch the sixth generation Outback until 2021.\n\nAustralia launched on the 20th February 2021 with a number of differences over the North American version including updated LED headlights with combined Day Running Light and turn/direction indicator with SRH (Steering Responsive Headlights) standard across all variants (the Touring model also gained Adaptive Driving Beam (ADB) until 2023 when ADB became standard across all model variants), as is pushbutton-start with tailgate PIN access. There is improved camera resolution for rear, side and front driver assistance cameras, EyeSight 4.0 with roadside speed sign reading, adjustable speed limiting, and intersection crash avoidance utilising new EyeSight cameras with a wider field of view and a lower profile inside the cabin. Subaru claim the sole engine fitted to Australian Outbacks, the revised 2.5-litre FB25D, is made of 90% new components compared to the Gen5 engine as well. The Japanese Outback was announced on October 7, 2021; in Japan the Outback is offered exclusively with the 1.8-litre CB18 gasoline direct-injection turbo engine instead.\n\nIn September 2021, the European variant received a five-star rating by the European New Car Assessment Programme (EuroNCAP) 2021.\n\nFor the 2022 model year, Subaru added a new trim level, the Wilderness. Outback Wilderness features 9.5 inches of ground clearance, turbocharged 2.4-liter FA24F engine, and re-tuned transmission gearing with revised front and rear gear ratios. Marketed for off-road use, the Outback Wilderness has 17\" wheels with standard all-terrain tires, enhanced body cladding, and synthetic upholstery.\n\nInstruction:\n\nGiven this paragraph about the Subaru Outback, in what year was the Wilderness trim introduced?\n\nAnswer:\n\n2022\n\n",
    "Context:\n\nProject Management Professional (PMP) is an internationally recognized professional designation offered by the Project Management Institute (PMI). As of 31 July 2020, there are 1,036,368 active PMP-certified individuals and 314 chartered chapters across 214 countries and territories worldwide.\n\nThe exam is one of eight credentials offered by PMI and is based on the ECO PMP Examination Content Outline. Most of the questions reference the Exam Content Outline PMP Examination Content Outline (also known as the E.C.O ).\n\nInstruction:\n\nGiven the paragraph above paragraph, what is the PMP and who established the exam.\n\nAnswer:\n\nPMP stands for Project Management Professional, and it was established by the Project Management Institute (PMI). The PMP is a professional certification for project managers that is recognized internationally. The PMP is based on the ECO PMP Examination Content Outline.\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, when did LLMs emerge?\n\nAnswer:\n\nAround 2018.\n\n",
    "Instruction:\n\nFrom the below text about MS Dhoni, tell me what they were most famous for?Context:\n\nMS Dhoni, is a former Indian cricketer and captain of the Indian national team in limited-overs formats from 2007 to 2017 and in Test cricket from 2008 to 2014, who plays as a Wicket-keeper-Batsman. He is also the current captain of Chennai Super Kings in the Indian Premier League. Under his captaincy, India won the 2007 ICC World Twenty20, the 2011 Cricket World Cup, and the 2013 ICC Champions Trophy, the most by any captain. He also led India to victory in the 2010 and 2016 Asia Cup. Additionally, under his leadership, India won the 2010 and 2011 ICC Test Mace and 2013 ICC ODI Championship. Dhoni is a right-handed wicket-keeper batsman known for his calm captaincy and his ability to finish matches in tight situations. He has scored 17,266 runs in International Cricket (including 10,000 plus runs in ODI Internationals) and is considered one of the best finishers in the game, as well as one of the greatest wicket-keepers and captains in the history of cricket.\n\nAnswer:\n\nMS Dhoni is a former cricketer and captain of the Indian national team. He is most famously known for leading India to victory in 2007 ICC World Twenty20, the 2011 Cricket World Cup and the 2013 ICC Champions Trophy. He is also known for his calm captaincy and considered as one of the best finishers and greatest wicket-keepers in the history of the game.\n\n",
    "Context:\n\nOn 25 November 2018, Regalado posted on MIT Technology Review website that He Jiankui was making CRIPSR babies. As it was publicised, He was prompted to announce his experiment and posted the news of the birth of twins, nicknamed Lulu and Nana, on YouTube in five videos the same day. He formally presented the experiment at the Second International Summit on Human Genome Editing organized at the University of Hong Kong on 28 November 2018. He explained that the experiment was to make the babies resistant to HIV infection as they were (as embryos) obtained from an HIV-positive father. He specifically used a mutant gene named CCR5-Δ32 that is known to confer innate resistance to HIV. The twins were born in secrecy in October 2018, and a third baby (revealed in 2022 as Amy) was then almost born, as He reported.\n\nInstruction:\n\nWhat type of babies did Regalado say Jiankui was making?\n\nAnswer:\n\nRegalado said that Jiankui was making CRIPSR babies.\n\n",
    "Context:\n\nGyebangsan is a mountain of Gyeongsangnam-do, located in southeastern South Korea.\n\nInstruction:\n\nWhat is Gyebangsan?\n\nAnswer:\n\nGyebangsan is a mountain, located in southeastern South Korea.\n\n",
    "Context:\n\nThe history of video game consoles, both home and handheld, had their origins in the 1970s. The concept of home consoles used to play games on a television set was founded by the 1972 Magnavox Odyssey, first conceived by Ralph H. Baer in 1966. Handheld consoles bore out from electro-mechanical games that had used mechanical controls and light-emitting diodes (LED) as visual indicators. Handheld electronic games had replaced the mechanical controls with electronic and digital components, and with the introduction of Liquid-crystal display (LCD) to create video-like screens with programmable pixels, systems like the Microvision and the Game & Watch became the first handheld video game consoles, and fully realized by the Game Boy system.\n\nInstruction:\n\nGiven this paragraph about video game consoles, what was the first console?\n\nAnswer:\n\nThe Magnavox Odyssey in 1972\n\n",
    "Instruction:\n\nGiven this reference text about the career of Charles Henry Bromedge Caldwell, name the ships he commanded after his promotion to the rank of Commander.Context:\n\nCharles Henry Bromedge Caldwell was born in Hingham, Massachusetts on February 24, 1823. He entered the navy as midshipman February 27, 1838, and became lieutenant September 4, 1852. He commanded the USS Vandalia in the US Navy's second Fiji expedition, an 1859 punitive expedition against Waya Island warriors who had cannibalized two American traders. In 1862, he commanded the gun-boat Itasca, of the western gulf blockading squadron, and took part in the bombardment of Forts Jackson and St. Philip. On the night of April 20, his gun-boat, with the Pinola, was sent on an expedition under the command of Fleet-Capt. Bell, to make a passage for the fleet through the chain obstructions near the forts. Lieut. Caldwell and his party boarded one of the hulks that held the chains, and succeeded in detaching the latter, in spite of the heavy fire to which they were subjected. The Itasca was then swept on shore by the current, in full sight of the forts, and it was half an hour before she was afloat again. She was unable to pass the forts with the rest of the fleet, owing to a shot that penetrated her boiler. Lieut. Caldwell was in the action at Grand Gulf, June 9, 1862, and was promoted to commander on July 16 1862.\n\nHe commanded the iron-clad Essex, of the Mississippi squadron in 1862–63, and took part in the operations at Port Hudson, from March to July 1863, in command of the Essex and the mortar flotilla.\n\nHe commanded the Glaucus of the North Atlantic blockading squadron from 1863 till 1864, and the R. R. Cuyler, of the same squadron, from 1864 till 1865. He became captain, December 12, 1867, chief of staff of the North Atlantic fleet in 1870, and commodore on June 14, 1874.\n\nHe died on November 30, 1877.\n\nAnswer:\n\nEssex\nGlaucus\nR. R. Cuyler\n\n",
    "Instruction:\n\nGiven a reference text about Reginaldo de França Lopes, tell me what sport and position he played and when he retired.Context:\n\nReginaldo de França Lopes (born 31 October 1969), known as Reginaldo França, is a Brazilian professional football manager and former player.\n\nA defensive midfielder, França played his entire career for teams in the Ceará state, aside from a short period at Cascavel in 2004, and notably represented Ferroviário in the 2002 Série C. He retired in 2006 with São Benedito, and subsequently became their manager in the following year. As a manager, he also remained in his native state, notably managing Maranguape for nearly four consecutive years.\n\nAnswer:\n\nReginaldo de França Lopes was a footballer who played defensive midfielder. He retired from playing football in 2006 and became a manager.\n\n",
    "Instruction:\n\nHow many prototypes were made?Context:\n\nThe first prototype was entirely mechanical. Three prototypes were made, and they were improved over one year. In the meantime, sure of having found a solution to the problem of taking 360° photos, Leme applied for a patent registration, a process that went on for some years.\n\nAnswer:\n\nThree prototypes were made and improved over one year.\n\n",
    "Context:\n\nAlibaba is one of the world's largest retailers and e-commerce companies. In 2020, it was also rated as the fifth-largest artificial intelligence company. It is also one of the biggest venture capital firms and investment corporations in the world, as well as the second largest financial services group behind Visa via its fintech arm Ant Group. The company hosts the largest B2B (Alibaba.com), C2C (Taobao), and B2C (Tmall) marketplaces in the world. It has been expanding into the media industry, with revenues rising by triple percentage points year after year. It also set the record on the 2018 edition of China's Singles' Day, the world's biggest online and offline shopping day.\n\nInstruction:\n\nWhat is the largest retailers and e-commerce companies?\n\nAnswer:\n\nAlibaba is one of the world's largest retailers and e-commerce companies. It consists of many business including B2B (Alibaba.com), C2C (Taobao) and B2C (Tmall). Alibaba is also one of the largest financial companies and AI companies.\n\n",
    "Instruction:\n\nWhat types of problems in government could AI be used to solveContext:\n\nThe potential uses of AI in government are wide and varied, with Deloitte considering that \"Cognitive technologies could eventually revolutionize every facet of government operations\". Mehr suggests that six types of government problems are appropriate for AI applications:\n- Resource allocation - such as where administrative support is required to complete tasks more quickly.\n- Large datasets - where these are too large for employees to work efficiently and multiple datasets could be combined to provide greater insights.\n- Experts shortage - including where basic questions could be answered and niche issues can be learned.\n- Predictable scenario - historical data makes the situation predictable.\n- Procedural - repetitive tasks where inputs or outputs have a binary answer.\n- Diverse data - where data takes a variety of forms (such as visual and linguistic) and needs to be summarised regularly.\n\nAnswer:\n\nThe potential uses of AI in government are wide and varied but some appropriate areas to consider AI applications include: Resource allocation; Large datasets; Repetitive tasks; Answering basic questions; Summarising data from multiple forms; Predicting future scenarios based on historical data.\n\n",
    "Context:\n\nThor (from Old Norse: Þórr) is a prominent god in Germanic paganism. In Norse mythology, he is a hammer-wielding god associated with lightning, thunder, storms, sacred groves and trees, strength, the protection of humankind, hallowing, and fertility. Besides Old Norse Þórr, the deity occurs in Old English as Þunor, in Old Frisian as Thuner, in Old Saxon as Thunar, and in Old High German as Donar, all ultimately stemming from the Proto-Germanic theonym *Þun(a)raz, meaning 'Thunder'.\n\nInstruction:\n\nWho is Thor?\n\nAnswer:\n\nThor is the god of thunder in Norse mythology. He wields a powerful hammer that only he can pick up. Thor has appeared as a character in Marvel comic books since 1962 and in at least 10 movies.\n\n",
    "Context:\n\nIsabel Emily Jay (17 October 1879 – 26 February 1927) was an English opera singer and actress, best known for her performances in soprano roles of the Savoy Operas with the D'Oyly Carte Opera Company and in Edwardian musical comedies. During Jay's career, picture postcards were immensely popular, and Jay was photographed for over 400 different postcards.\n\nAfter studying at the Royal Academy of Music, Jay joined the D'Oyly Carte Opera Company in 1897, with whom she began singing principal roles immediately, becoming the company's leading soprano in 1899, where she played leading roles in comic operas including The Rose of Persia, The Pirates of Penzance, Patience, The Emerald Isle and Iolanthe. She married and left the company in 1902. She returned to the West End stage in 1903 and starred in eleven musicals over the ensuing years, including A Country Girl, The Cingalee, Véronique, The White Chrysanthemum, The Girl Behind the Counter, Miss Hook of Holland, King of Cadonia and The Balkan Princess. She retired in 1911 at age 31.\n\nInstruction:\n\nGiven a reference text about Isabel Emily Jay, tell me where she studied and how old she was when she retired.\n\nAnswer:\n\nIsabel Emily Jay studied at the Royal Academy of Music and retired at 31 years old.\n\n",
    "Instruction:\n\nBased on the reference paragraph, when was the 149th Boat Race?Context:\n\nThe 149th Boat Race took place on 6 April 2003. Held annually, the Boat Race is a side-by-side rowing race between crews from the Universities of Oxford (in dark blue) and Cambridge (in light greenish blue) along a 4.2-mile (6.8 km) tidal stretch of the River Thames in south-west London. The lead changed twice during the race, which Oxford won by one foot (30 cm), the smallest margin of victory in the history of the event. The close race has been described as \"epic\", while Olympic gold medallist Steve Redgrave suggested that the race was the \"greatest we will see in our lifetimes\".\n\nAnswer:\n\nApril 6, 2003\n\n",
    "Context:\n\nEvery key on a mechanical-switch keyboard contains a complete switch underneath. Each switch is composed of a housing, a spring, and a stem, and sometimes other parts such as a separate tactile leaf or a clickbar. Switches come in three variants: \"linear\" with consistent resistance, \"tactile\" with a non-audible bump, and \"clicky\" with both a bump and an audible click. Depending on the resistance of the spring, the key requires different amounts of pressure to actuate and to bottom out. The shape of the stem as well as the design of the switch housing varies the actuation distance and travel distance of the switch. The sound can be altered by the material of the plate, case, lubrication, the keycap profile, and even modifying the individual switch. These modifications, or \"mods\" include applying lubricant to reduce friction inside the switch itself, inserting \"switch films\" to reduce wobble, swapping out the spring inside to modify the resistance of the switch itself and many more. Mechanical keyboards allow for the removal and replacement of keycaps with a common stem type.\n\nInstruction:\n\nIn the following passage about mechanical-switch keyboards, which keyboards are the loudest, and how can I make them quieter?\n\nAnswer:\n\nMechanical-switch keyboards with \"Clicky\" switches come with both a bump and an audible click. Without adjusting the material of the plates or case, the way for users to reduce the noise would be to replace the keycaps or applying lubricant to reduce friction inside the switch.\n\n",
    "Context:\n\nThe 149th Boat Race took place on 6 April 2003. Held annually, the Boat Race is a side-by-side rowing race between crews from the Universities of Oxford (in dark blue) and Cambridge (in light greenish blue) along a 4.2-mile (6.8 km) tidal stretch of the River Thames in south-west London. The lead changed twice during the race, which Oxford won by one foot (30 cm), the smallest margin of victory in the history of the event. The close race has been described as \"epic\", while Olympic gold medallist Steve Redgrave suggested that the race was the \"greatest we will see in our lifetimes\".\n\nInstruction:\n\nBased on the reference paragraph, when was the 149th Boat Race?\n\nAnswer:\n\nApril 6, 2003\n\n",
    "Context:\n\nVan Buren received a basic education at the village schoolhouse, and briefly studied Latin at the Kinderhook Academy and at Washington Seminary in Claverack. Van Buren was raised speaking primarily Dutch and learned English while attending school; he is the only president of the United States whose first language was not English. Also during his childhood, Van Buren learned at his father's inn how to interact with people from varied ethnic, income, and societal groups, which he used to his advantage as a political organizer. His formal education ended in 1796, when he began reading law at the office of Peter Silvester and his son Francis.\n\nInstruction:\n\nWhich American president spoke Dutch as their first language?\n\nAnswer:\n\nPresident Van Buren spoke Dutch as his first language. He is the only president of the United States of America who spoke English as a second language.\n\n",
    "Context:\n\nThe village school was closed during much of the war but re-opened in autumn 1944. Gorbachev did not want to return but when he did he excelled academically. He read voraciously, moving from the Western novels of Thomas Mayne Reid to the works of Vissarion Belinsky, Alexander Pushkin, Nikolai Gogol, and Mikhail Lermontov. In 1946, he joined the Komsomol, the Soviet political youth organization, becoming leader of his local group and then being elected to the Komsomol committee for the district. From primary school he moved to the high school in Molotovskoye; he stayed there during the week while walking the 19 km (12 mi) home during weekends. As well as being a member of the school's drama society, he organized sporting and social activities and led the school's morning exercise class. Over the course of five consecutive summers from 1946 onward he returned home to assist his father in operating a combine harvester, during which they sometimes worked 20-hour days. In 1948, they harvested over 8,000 centners of grain, a feat for which Sergey was awarded the Order of Lenin and his son the Order of the Red Banner of Labour.\n\nInstruction:\n\nBased on this passage, how many miles did Gorbachev walk each week for his round trip commute to school?\n\nAnswer:\n\nAccording to this passage, Gorbachev's round trip walking commute to school was 24 miles per week. He walked 12 miles each way and travelled to and from school only once per week.\n\n",
    "Instruction:\n\nGiven these paragraphs about Natural hydrogen, what are other forms of hydrogen obtained using different processes?Context:\n\nNatural hydrogen (known as white hydrogen), is naturally occurring molecular hydrogen on or in Earth (as opposed to hydrogen produced in the laboratory or in industry). The name white hydrogen distinguishes it from green hydrogen, which is produced from renewable energy sources, and from grey, brown or black hydrogen, which is obtained from fossil sources or from the electrolysis of water. Natural hydrogen may be renewable, non-polluting and allows for lower cost operation compared to industrial hydrogen. Natural hydrogen has been identified in many source rocks in areas beyond the sedimentary basins where oil companies typically operate.\n\nOrigin of natural hydrogen\nThere are several sources of natural hydrogen:\n\n- degassing of deep hydrogen from the Earth's crust and mantle;\n- reaction of water with ultrabasic rocks (serpentinisation);\n- contact of water with reducing agents in the Earth's mantle;\n- interaction of water with freshly exposed rock surfaces (weathering);\n- decomposition of hydroxyl ions in the structure of minerals;\n- Natural radiolysis of water;\n- decomposition of organic matter;\n- biological activity\n- Extraction\n- Natural hydrogen is extracted from wells, mixed with other gases such as nitrogen or helium.\n\nSeveral sources have been identified in France. Geologists Alain Prinzhofer and Eric Derville have demonstrated the existence of large reservoirs in a dozen countries, including Mali and the United States. However, their potential remains difficult to assess.\n\nNumerous emanations on the ocean floor have been identified but are difficult to exploit. The discovery of a significant emergence in Russia in 2008 suggests the possibility of extracting native hydrogen in geological environments.\n\nGeology\nNatural hydrogen is generated continuously from a variety of natural sources. There are many known hydrogen emergences on mid-ocean ridges. Another of the known reactions, serpentinisation, occurs under the sea floor (in the oceanic crust).\n\nDiagenetic origin (iron oxidation) in the sedimentary basins of cratons, notably in Russia. Other sources are being explored, such as mantle hydrogen, or hydrogen from radiolysis (natural electrolysis) or from bacterial activity. In France, the Alps and Pyrenees are suitable for exploitation. New Caledonia has hyperalkaline sources that show dihydrogen emissions. A large accumulation of natural hydrogen was discovered in Bourakebougou (Mali).\n\nCharacteristics\nDihydrogen is very soluble in fresh water, especially at depth (solubility increases with pressure).\n\nhttps://en.wikipedia.org/wiki/Natural_hydrogen\n\nAnswer:\n\nGreen hydrogen, which is produced from renewable energy sources, and from grey, brown or black hydrogen, which is obtained from fossil sources or from the electrolysis of water.\n\n",
    "Instruction:\n\nGiven this paragraph about kubernetes, what is the storage layer of Kubernetes control plane?Context:\n\nThe Kubernetes master node handles the Kubernetes control plane of the cluster, managing its workload and directing communication across the system. The Kubernetes control plane consists of various components, each its own process, that can run both on a single master node or on multiple masters supporting high-availability clusters. The various components of the Kubernetes control plane are as follows:\n\netcd is a persistent, lightweight, distributed, key-value data store that CoreOS has developed. It reliably stores the configuration data of the cluster, representing the overall state of the cluster at any given point of time. etcd favors consistency over availability in the event of a network partition (see CAP theorem). The consistency is crucial for correctly scheduling and operating services.\nThe API server serves the Kubernetes API using JSON over HTTP, which provides both the internal and external interface to Kubernetes. The API server processes and validates REST requests and updates the state of the API objects in etcd, thereby allowing clients to configure workloads and containers across worker nodes. The API server uses etcd's watch API to monitor the cluster, roll out critical configuration changes, or restore any divergences of the state of the cluster back to what the deployer declared. As an example, the deployer may specify that three instances of a particular \"pod\" (see below) need to be running. etcd stores this fact. If the Deployment Controller finds that only two instances are running (conflicting with the etcd declaration), it schedules the creation of an additional instance of that pod.\nThe scheduler is the extensible component that selects on which node an unscheduled pod (the basic entity managed by the scheduler) runs, based on resource availability. The scheduler tracks resource use on each node to ensure that workload is not scheduled in excess of available resources. For this purpose, the scheduler must know the resource requirements, resource availability, and other user-provided constraints or policy directives such as quality-of-service, affinity vs. anti-affinity requirements, and data locality. The scheduler's role is to match resource \"supply\" to workload \"demand\".\nA controller is a reconciliation loop that drives the actual cluster state toward the desired state, communicating with the API server to create, update, and delete the resources it manages (e.g., pods or service endpoints). One kind of controller is a Replication Controller, which handles replication and scaling by running a specified number of copies of a pod across the cluster. It also handles creating replacement pods if the underlying node fails. Other controllers that are part of the core Kubernetes system include a DaemonSet Controller for running exactly one pod on every machine (or some subset of machines), and a Job Controller for running pods that run to completion (e.g., as part of a batch job). Labels selectors that are part of the controller's definition specify the set of pods that a controller manages.\nThe controller manager is a process that manages a set of core Kubernetes controllers.\n\nAnswer:\n\nETCD\n\n"
]