[
    "Context:\n\nEl Niño (/ɛl ˈniːnjoʊ/ el NEEN-yoh, Spanish: [el ˈniɲo]; lit. 'The Boy') is the warm phase of the El Niño–Southern Oscillation (ENSO) and is associated with a band of warm ocean water that develops in the central and east-central equatorial Pacific (approximately between the International Date Line and 120°W), including the area off the Pacific coast of South America. The ENSO is the cycle of warm and cold sea surface temperature (SST) of the tropical central and eastern Pacific Ocean.\n\nEl Niño is accompanied by high air pressure in the western Pacific and low air pressure in the eastern Pacific. El Niño phases are known to last close to four years; however, records demonstrate that the cycles have lasted between two and seven years. During the development of El Niño, rainfall develops between September–November. \n\nIt should be noted that the cool phase of ENSO is Spanish: La Niña, lit. 'The Girl', with SSTs in the eastern Pacific below average, and air pressure high in the eastern Pacific and low in the western Pacific. The ENSO cycle, including both El Niño and La Niña, causes global changes in temperature and rainfall.\n\nInstruction:\n\nWhat is an \"El Niño\" weather pattern?\n\nAnswer:\n\nEl Niño (/ɛl ˈniːnjoʊ/ el NEEN-yoh, Spanish: [el ˈniɲo]; lit. 'The Boy') is the warm phase of the El Niño–Southern Oscillation (ENSO) and is associated with a band of warm ocean water that develops in the central and east-central equatorial Pacific (approximately between the International Date Line and 120°W), including the area off the Pacific coast of South America.\n\n",
    "Instruction:\n\nGiven this paragraph about Hydrogen Storage, what is the hydrogen boiling point?Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nAnswer:\n\nIt boils around 20.268 K (−252.882 °C or −423.188 °F).\n\n",
    "Context:\n\nThe Wheel of Time is a series of high fantasy novels by American author Robert Jordan, with Brandon Sanderson as a co-author for the final three novels. Originally planned as a six-book series at its debut in 1990, The Wheel of Time came to span 14 volumes, in addition to a prequel novel and two companion books. Jordan died in 2007 while working on what was planned to be the final volume in the series. He prepared extensive notes which enabled fellow fantasy author Brandon Sanderson to complete the final book, which grew into three volumes: The Gathering Storm (2009), Towers of Midnight (2010), and A Memory of Light (2013).\n\nInstruction:\n\nHow many volumes of Wheel of Time are there?\n\nAnswer:\n\nOriginally planned as a six-book series at its debut in 1990, The Wheel of Time came to span 14 volumes\n\n",
    "Instruction:\n\nWhat is surfing?Context:\n\nSurfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found in standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or in wave pools.\n\nAnswer:\n\nSurfing is a sport where a rider uses a surfboard to ride a wave\n\n",
    "Context:\n\nCarter attended Plains High School from 1937 to 1941, graduating from the eleventh grade, since the school did not have a twelfth grade. By that time, Archery and Plains had been impoverished by the Great Depression, but the family benefited from New Deal farming subsidies, and Carter's father took a position as a community leader. Carter himself was a diligent student with a fondness for reading. A popular anecdote holds that he was passed over for valedictorian after he and his friends skipped school to venture downtown in a hot rod. Carter's truancy was mentioned in a local newspaper, although it is not clear he would have otherwise been valedictorian. As an adolescent, Carter played on the Plains High School basketball team, and also joined a youth organization named the Future Farmers of America, which helped him develop a lifelong interest in woodworking.\n\nCarter had long dreamed of attending the United States Naval Academy. In 1941, he started undergraduate coursework in engineering at Georgia Southwestern College in nearby Americus, Georgia. The following year, he transferred to the Georgia Institute of Technology in Atlanta, and he earned admission to the Naval Academy in 1943.  He was a good student but was seen as reserved and quiet, in contrast to the academy's culture of aggressive hazing of freshmen.  While at the academy, Carter fell in love with Rosalynn Smith, a friend of his sister Ruth. The two married shortly after his graduation in 1946. He was a sprint football player for the Navy Midshipmen. Carter graduated 60th out of 821 midshipmen in the class of 1947 with a Bachelor of Science degree and was commissioned as an ensign.\n\nInstruction:\n\nGiven these two paragraphs, where did Jimmy Carter go to college?\n\nAnswer:\n\nJimmy Carter received his Bachelor of Science degree from the United States Naval Academy in 1947. However, he began his undergraduate studies at Georgia Southwestern College. A year later, he transferred to the Georgia Institute of Technology before ultimately earning his admission into the Naval Academy where he would complete his studies.\n\n",
    "Instruction:\n\nWhen did the maximum rate of water usage begin to be mandated?Context:\n\nA low-flow fixture is a water saving plumbing fixture designed to achieve water savings by having a lower flow rate of water or a smaller quantity per flush. Some of these low-flow fixtures are faucets, showerheads, and toilets. In the United States a maximum water usage of conventional plumbing fixtures was federally mandated by the Energy policy act of 1992. Low-flow fixtures are designed to save water over conventional fixtures by having a lower flow rate while still maintaining satisfactory performance. The Environmental protection agency (EPA) WaterSense program has requirements for plumbing fixtures to achieve their definition for water saving low-flow.\n\nAnswer:\n\n1992\n\n",
    "Instruction:\n\nIs Mount Saint Helens still active?Context:\n\nMount St. Helens (known as Lawetlat'la to the indigenous Cowlitz people, and Loowit or Louwala-Clough to the Klickitat) is an active stratovolcano located in Skamania County, Washington, in the Pacific Northwest region of the United States. It lies 52 miles (83 km) northeast of Portland, Oregon, and 98 miles (158 km) south of Seattle. Mount St. Helens takes its English name from that of the British diplomat Lord St Helens, a friend of explorer George Vancouver who surveyed the area in the late 18th century. The volcano is part of the Cascade Volcanic Arc, a segment of the Pacific Ring of Fire.\n\nThe Mount St. Helens major eruption of May 18, 1980 remains the deadliest and most economically destructive volcanic event in U.S. history. Fifty-seven people were killed; 200 homes, 47 bridges, 15 miles (24 km) of railways, and 185 miles (298 km) of highway were destroyed. A massive debris avalanche, triggered by a magnitude 5.1 earthquake, caused a lateral eruption that reduced the elevation of the mountain's summit from 9,677 ft (2,950 m) to 8,363 ft (2,549 m), leaving a 1 mile (1.6 km) wide horseshoe-shaped crater. The debris avalanche was 0.6 cubic miles (2.5 km3) in volume. The 1980 eruption disrupted terrestrial ecosystems near the volcano. By contrast, aquatic ecosystems in the area greatly benefited from the amounts of ash, allowing life to multiply rapidly. Six years after the eruption, most lakes in the area had returned to their normal state.\n\nAfter its 1980 eruption, the volcano experienced continuous volcanic activity until 2008. Geologists predict that future eruptions will be more destructive, as the configuration of the lava domes requires more pressure to erupt. However, Mount St. Helens is a popular hiking spot and it is climbed year-round. In 1982, the Mount St. Helens National Volcanic Monument was established by President Ronald Reagan and the U.S. Congress.\n\nAnswer:\n\nMount St. Helens, located in the sate of Washington is considered an active volcano.\n\n",
    "Context:\n\nThe Lotus Mark IX (1955) was an aluminium-bodied sports racing car manufactured by Lotus Engineering Ltd. About thirty of the Mark IX sports racing cars were made. It was closely related to the Lotus model Mark VIII (1954), of which only about seven cars were made. These cars were largely based on the innovative space frame of the Lotus Mark VI (1952). The highly aerodynamic bodies were designed by Frank Costin and constructed by Williams & Pritchard Limited.\n\nDuring this early era, of 1954–1955, Lotus Engineering was still a fledgling company, and cars were delivered in different states of completion on special orders. Similar to the Mark VIII, the Mark IX was available in various configurations and different engines, including the 1500 cc MG, 1500 cc Connaught and 2-litre Bristol were fitted. However, the Mark IX designation is most often powered by the 1100 cc Coventry Climax engine. Apparently, two models of Mark IX were offered – the \"Club\" and the \"Le Mans\", the latter of which had larger drum brakes fitted.\n\nInstruction:\n\nGiven a reference text about Lotus Mark IX, who designed the car?\n\nAnswer:\n\nThe Lotus Mark IX was designed by Frank Costin.\n\n",
    "Instruction:\n\nGiven this reference text about beneficence, what can I do to ensure compliance to the beneficence concept?Context:\n\nBeneficence is a concept in research ethics that states that researchers should have the welfare of the research participant as a goal of any clinical trial or other research study. The antonym of this term, maleficence, describes a practice that opposes the welfare of any research participant. According to the Belmont Report, researchers are required to follow two moral requirements in line with the principle of beneficence: do not harm and maximize possible benefits for research while minimizing any potential harm on others.\n\nThe concept that medical professionals and researchers would always practice beneficence seems natural to most patients and research participants, but in fact, every health intervention or research intervention has potential to harm the recipient. There are many different precedents in medicine and research for conducting a cost–benefit analysis and judging whether a certain action would be a sufficient practice of beneficence, and the extent to which treatments are acceptable or unacceptable is under debate.\n\nDespite differences in opinion, there are many concepts on which there is wide agreement. One is that there should be community consensus when determining best practices for dealing with ethical problems.\n\nAnswer:\n\nEnsure you are not harming your research participants, while maximizing benefits and minimizing any potential harm.  Engage with your community to determine best practices when encountering ethical concerns.  This should ensure your compliance with beneficence.\n\n",
    "Context:\n\nSurfing is a surface water sport in which an individual, a surfer (or two in tandem surfing), uses a board to ride on the forward section, or face, of a moving wave of water, which usually carries the surfer towards the shore. Waves suitable for surfing are primarily found on ocean shores, but can also be found in standing waves in the open ocean, in lakes, in rivers in the form of a tidal bore, or in wave pools.\n\nInstruction:\n\nWhat is surfing?\n\nAnswer:\n\nSurfing is a sport where a rider uses a surfboard to ride a wave\n\n",
    "Instruction:\n\nWhat types of political organizations did pre-colonial Africa have?Context:\n\nPre-colonial Africa possessed perhaps as many as 10,000 different states and polities characterized by many different sorts of political organization and rule. These included small family groups of hunter-gatherers such as the San people of southern Africa; larger, more structured groups such as the family clan groupings of the Bantu-speaking peoples of central, southern, and eastern Africa; heavily structured clan groups in the Horn of Africa; the large Sahelian kingdoms; and autonomous city-states and kingdoms such as those of the Akan; Edo, Yoruba, and Igbo people in West Africa; and the Swahili coastal trading towns of Southeast Africa.\n\nAnswer:\n\nPre-colonial Africa had many political organizations including: small family groups, larger family clan groupings, heavily structured clan groups, and autonomous city-states and kingdoms.\n\n",
    "Instruction:\n\nGiven the following paragraph about the nutrition profile of peanut butter, what minerals is peanut butter rich in?Context:\n\nIn a 100 gram amount, smooth peanut butter supplies 597 Calories and is composed of 51% fat, 22% protein, 22% carbohydrates (including 5% dietary fiber), and 1% water (table). Both crunchy and smooth peanut butter are sources of saturated and monounsaturated fats (mainly oleic acid) as 25% of total serving amount, and polyunsaturated fat (12% of total), primarily as linoleic acid).\n\nPeanut butter is a rich source (20% or more of the Daily Value, DV) of dietary fiber, vitamin E, pantothenic acid, folate, niacin, and vitamin B6 (table, USDA FoodData Central). Also high in content are the dietary minerals manganese, magnesium, phosphorus, zinc, copper, and sodium (added as salt during manufacturing). Peanut butter is a moderate source (10–19% DV) of thiamin, riboflavin, iron, and potassium (table).\n\nAnswer:\n\nMinerals that peanut butter is rich in include manganese, magnesium, phosphorus, zinc, copper, and sodium.\n\n",
    "Context:\n\nDiversity is believed to bring substantial benefits such as better decision making and improved problem solving, greater creativity and innovation, which leads to enhanced product development, and more successful marketing to different types of customers\n\nInstruction:\n\nWhy is prioritizing diversity hiring in an organization important?\n\nAnswer:\n\nDiversity drives creativity, innovation, and personal growth.\n\n",
    "Instruction:\n\nGiven the following paragraph about a laptops, why are laptops called \"laptop\"?Context:\n\nThe names \"laptop\" and \"notebook\" refer to the fact that the computer can be practically placed on (or on top of) the user's lap and can be used similarly to a notebook. As of 2022, in American English, the terms \"laptop\" and \"notebook\" are used interchangeably; in other dialects of English, one or the other may be preferred. Although the term \"notebook\" originally referred to a specific size of laptop (originally smaller and lighter than mainstream laptops of the time), the term has come to mean the same thing and no longer refers to any specific size.\n\nAnswer:\n\nLaptops are called \"laptop\" because the computer can be practically placed on the user's lap .\n\n",
    "Context:\n\nThe Joint Direct Attack Munition (JDAM) is a guidance kit that converts unguided bombs, or \"dumb bombs\", into all-weather precision-guided munitions. JDAM-equipped bombs are guided by an integrated inertial guidance system coupled to a Global Positioning System (GPS) receiver, giving them a published range of up to 15 nautical miles (28 km). JDAM-equipped bombs range from 500 to 2,000 pounds (230 to 910 kg). The JDAM's guidance system was jointly developed by the United States Air Force and United States Navy, hence the \"joint\" in JDAM. When installed on a bomb, the JDAM kit is given a GBU (Guided Bomb Unit) identifier, superseding the Mark 80 or BLU (Bomb, Live Unit) nomenclature of the bomb to which it is attached.\n\nThe JDAM is not a stand-alone weapon; rather it is a \"bolt-on\" guidance package that converts unguided gravity bombs into precision-guided munitions (PGMs). The key components of the system consist of a tail section with aerodynamic control surfaces, a (body) strake kit, and a combined inertial guidance system and GPS guidance control unit.\n\nThe JDAM was meant to improve upon laser-guided bomb and imaging infrared technology, which can be hindered by bad ground and weather conditions. Laser seekers are now being fitted to some JDAMs.\n\nInstruction:\n\nWhy is JDAM so cost effective?\n\nAnswer:\n\nThe Joint Direct Attack Munition (JDAM) is a guidance kit that converts unguided bombs to precision-guided munitions. There are several reasons why JDAM is one of the most cost effective weapons ever invented.\n\nBy using GPS navigation, the JDAM guidance kit can be extremely cheap, as low as $25k/kit.  It is likely cheaper than any other precision-guided weapons.\n\nGPS navigation provides good targeting precision, typically within meters. Combined with blast radius of 500-2000 lbs unguided bombs, JDAM can effectively destroy any targets on the ground.\n\nBecause JDAM has navigation capability, pilots no longer need to precisely aim the bombers  against the targets. It allows a bomber to quickly and precisely hit multiple targets along the route.\n\nSome JDAM guidance kits include targeting sensors, such as laser targeting. They can be used against mobile targets, which further increases the use cases for JDAM.\n\nIn summary, by combining dumb bombs with a guidance kit, JDAM becomes a very cost effective weapon system, and is widely adopted by the US and other military forces.\n\n",
    "Instruction:\n\nGiven this paragraph about Novak Djokovic, how many majors titles does he currently hold?Context:\n\nNovak Djokovic (Serbian Cyrillic: Новак Ђоковић, romanized: Novak Đoković, pronounced [nôʋaːk dʑôːkoʋitɕ] (listen); born 22 May 1987) is a Serbian professional tennis player. He is currently ranked the world No. 1 player in men's singles by the Association of Tennis Professionals (ATP), and has held the top position for a record total 381 weeks, finishing as the year-end No. 1 an Open Era record seven times. He has won a total of 93 singles titles on the men's ATP Tour with titles comprising a joint-record 22 majors, a record ten Australian Opens, a record 38 Masters, a joint-record six Tour Finals, and a record 66 Big Titles. Djokovic has completed a non-calendar year Grand Slam in singles, becoming the only man in tennis history to be the reigning champion of the four majors at once across three different surfaces. He is also the first man in the Open Era to achieve a double Career Grand Slam in singles and the only player to complete the career Golden Masters in singles by winning all of the nine Masters tournaments, which he has done twice.\n\nAnswer:\n\n22\n\n",
    "Context:\n\nLasantha Rodrigo (born 28 May 1938) is a former cricketer who played 14 matches of first-class cricket for Ceylon between 1959 and 1971.\n\nLife and career\nLasantha Rodrigo was born in Moratuwa and attended Prince of Wales' College, Moratuwa, where he captained the cricket team in 1958 and 1959, and also captained the Ceylon schools team. His father, J. B. C. Rodrigo, was principal of Prince of Wales' College from 1933 to 1959.\n\nHe made his highest first-class score on his debut, in the Gopalan Trophy match in 1958–59, when he scored 89. Batting at number three, he top-scored with 44 for Ceylon in their one-day match against the touring Australians in April 1961. He toured India with the Ceylon team in 1964-65, playing in all three matches against India, but with only moderate success.\n\nHe worked for Ceylon Cold Stores for 31 years as a mechanical engineer. Inability to take time off work to play cricket shortened his cricket career. In 2014 he was formally honoured by Sri Lanka Cricket for his services to cricket in Sri Lanka, and awarded 300,000 rupees. In September 2018, he was one of 49 former Sri Lankan cricketers felicitated by Sri Lanka Cricket, to honour them for their services before Sri Lanka became a full member of the International Cricket Council (ICC).\n\nRodrigo lives with his wife Sweenie in Moratuwa, opposite Prince of Wales' College. They have a daughter and a son.\n\nInstruction:\n\nGiven a reference text about Lasantha Rodrigo, tell me how long he worked as a mechanical engineer and who worked for.\n\nAnswer:\n\nLasantha Rodrigo worked as a mechanical engineer for Ceylon Cold Stores for 31 years.\n\n",
    "Instruction:\n\nWhat does Touch Typing refer to?Context:\n\nTouch typing (also called blind typing, or touch keyboarding) is a style of typing. Although the phrase refers to typing without using the sense of sight to find the keys—specifically, a touch typist will know their location on the keyboard through muscle memory—the term is often used to refer to a specific form of touch typing that involves placing the eight fingers in a horizontal row along the middle of the keyboard (the home row) and having them reach for specific other keys. (Under this usage, typists who do not look at the keyboard but do not use home row either are referred to as hybrid typists.) Both two-handed touch typing and one-handed touch typing are possible.\n\nAnswer:\n\nTouch typing refers to typing without using the sense of sight to find the keys\n\n",
    "Context:\n\nNew York, often called New York City or NYC, is the most populous city in the United States. With a 2020 population of 8,804,190 distributed over 300.46 square miles (778.2 km2), New York City is the most densely populated major city in the United States and more than twice as populous as Los Angeles, the nation's second-largest city.\n\nInstruction:\n\nWhich is the most populous city in the United States\n\nAnswer:\n\nNew York\n\n",
    "Instruction:\n\nWhat are the major innovations and scientific discoveries from UC Berkeley?Context:\n\nA number of significant inventions and discoveries have been made by Berkeley faculty members and researchers:\n\nNatural sciences\nEdit\nAtomic bomb – Physics professor J. Robert Oppenheimer was wartime director of Los Alamos National Laboratory and the Manhattan Project.\nCarbon 14 and photosynthesis – Martin Kamen and Sam Ruben first discovered carbon 14 in 1940, and Nobel laureate Melvin Calvin and his colleagues used carbon 14 as a molecular tracer to reveal the carbon assimilation path in photosynthesis, known as Calvin cycle.\nCarcinogens – Identified chemicals that damage DNA. The Ames test was described in a series of papers in 1973 by Bruce Ames and his group at the university.\nChemical elements – 16 elements have been discovered at Berkeley (technetium, astatine, neptunium, plutonium, americium, curium, berkelium, californium, einsteinium, fermium, mendelevium, nobelium, lawrencium, rutherfordium, dubnium, and seaborgium).\nCovalent bond – Gilbert N. Lewis in 1916 described the sharing of electron pairs between atoms, and invented the Lewis notation to describe the mechanisms.\nCRISPR gene editing – Nobel laureate Jennifer Doudna discovers a precise and inexpensive way for manipulating DNA in human cells.\nCyclotron – Ernest O. Lawrence created a particle accelerator in 1934, and was awarded the Nobel Physics Prize in 1939.\nDark energy – Saul Perlmutter and many others in the Supernova Cosmology Project discover the universe is expanding because of dark energy 1998.\nFlu vaccine – Wendell M. Stanley and colleagues discovered the vaccine in the 1940s.\nHydrogen bomb – Edward Teller, the father of hydrogen bomb, was a professor at Berkeley and a researcher at the Lawrence Livermore National Laboratory and the Los Alamos National Laboratory.\nImmunotherapy of cancer – James P. Allison discovers and develops monoclonal antibody therapy that uses the immune system to combat cancer 1992–1995.\nMolecular clock – Allan Wilson discovery in 1967.\nNeuroplasticity – Marian Diamond discovers structural, biochemical, and synaptic changes in brain caused by environmental enrichment 1964\nOncogene – Peter Duesberg discovers first cancer causing gene in a virus 1970s.\nTelomerase – Elizabeth H. Blackburn, Carol Greider, and Jack Szostak discover enzyme that promotes cell division and growth 1985.\nVitamin E – Gladys Anderson Emerson isolates Vitamin E in a pure form in 1952.\n\nAnswer:\n\nAtomic bomb by J. Robert Oppenheimer, carbon 14 and its photosynthesis, covalent bond, cyclotron, and etc.\n\n",
    "Context:\n\nA small-world network is a mathematical graph in which most nodes are not neighbors of one another, but the neighbors of any given node are likely to be neighbors of each other. Due to this, most neighboring nodes can be reached from every other node by a small number of hops or steps. Specifically, a small-world network is defined to be a network where the typical distance L between two randomly chosen nodes (the number of steps required) grows proportionally to the logarithm of the number of nodes N in the network.\n\nInstruction:\n\nWhat is a small-world network?\n\nAnswer:\n\nA small-world network is a mathematical graph in which most nodes are not neighbors of one another, but the neighbors of any given node are likely to be neighbors of each other.\n\n",
    "Context:\n\nA low-flow fixture is a water saving plumbing fixture designed to achieve water savings by having a lower flow rate of water or a smaller quantity per flush. Some of these low-flow fixtures are faucets, showerheads, and toilets. In the United States a maximum water usage of conventional plumbing fixtures was federally mandated by the Energy policy act of 1992. Low-flow fixtures are designed to save water over conventional fixtures by having a lower flow rate while still maintaining satisfactory performance. The Environmental protection agency (EPA) WaterSense program has requirements for plumbing fixtures to achieve their definition for water saving low-flow.\n\nInstruction:\n\nWhen did the maximum rate of water usage begin to be mandated?\n\nAnswer:\n\n1992\n\n",
    "Instruction:\n\nWhich movie was originally declared the winner for Best Picture?Context:\n\nThe winners were announced during the awards ceremony on February 26, 2017. Moonlight became the first film with an all-black cast and the first LGBT-themed film to win Best Picture. In an event unprecedented in the history of the Oscars, La La Land was incorrectly announced as the Best Picture, and, a few minutes later, the error was corrected and Moonlight was declared the winner. O.J.: Made in America, at 467 minutes, became the longest film to win an Academy Award, surpassing the 431-minute long War and Peace, which won the Academy Award for Best Foreign Language Film in 1969. Following the five-part documentary's win, new academy rules barred any \"multi-part or limited series\" from being eligible for documentary categories. With Casey Affleck winning the Oscar for Best Actor, he and his older brother, Ben Affleck, became the 16th pair of siblings to win Academy Awards. Mahershala Ali became the first Muslim actor to win an Oscar. Viola Davis became the first black person to achieve the Triple Crown of Acting with her Oscar, Emmy, and Tony wins.\n\nAnswer:\n\nLa La Land was originally declared the winner for Best Picture\n\n",
    "Context:\n\nPortugal's overseas presence in sub-Saharan Africa (most notably in Angola, Cape Verde, Mozambique, Guinea-Bissau, and São Tomé and Príncipe) lasted from the 16th century to 1975, after the Estado Novo regime was overthrown in a military coup in Lisbon. Rhodesia unilaterally declared independence from the United Kingdom in 1965, under the white minority government of Ian Smith, but was not internationally recognized as an independent state (as Zimbabwe) until 1980, when black nationalists gained power after a bitter guerrilla war. Although South Africa was one of the first African countries to gain independence, the state remained under the control of the country's white minority through a system of racial segregation known as apartheid until 1994.\n\nInstruction:\n\nWhat is apartheid, and which country experienced it?\n\nAnswer:\n\nApartheid is a system of racial segregation in South Africa.\n\n",
    "Instruction:\n\nWhat is the primary information in this paragraph?Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nAnswer:\n\nThe paragraph discussed racial manipulation in the 19th to 20th centuries. It considers Europeans to be discriminative against people from the Middle East, Asia and North Africa, and uses artist expressions to communicate and manipulate these prejudice to their general population.\n\n",
    "Context:\n\n\"Tomorrow\" is a show tune from the musical Annie, with music by Charles Strouse and lyrics by Martin Charnin, published in 1977. The number was originally written as \"Replay\" (The Way We Live Now) for the 1970 short film Replay, with both music and lyrics by Strouse.\n\nIn 1972 Strouse, and Thomas Meehan began working on a musical based on the Little Orphan Annie comic strips, Annie. Strouse contributed a reworked version of \"Replay\" as \"Tomorrow\". \"Annie\" took until 1976 to reach Broadway and during that time Strouse reworked \"Replay\" again for possible use in what became \"Charlie and Algernon\", a musical version of Daniel Keyes's Flowers for Algernon with book by playwright David Rogers although it was not ultimately used. \"\n\nInstruction:\n\nWho wrote the music and lyrics for Replay?\n\nAnswer:\n\nCharles Strouse\n\n",
    "Context:\n\nLollapalooza /ˌlɒləpəˈluːzə/ (Lolla) is an annual American four-day music festival held in Grant Park in Chicago. It originally started as a touring event in 1991, but several years later, Chicago became its permanent location. Music genres include but are not limited to alternative rock, heavy metal, punk rock, hip hop, and electronic dance music. Lollapalooza has also featured visual arts, nonprofit organizations, and political organizations. The festival, held in Grant Park, hosts an estimated 400,000 people each July and sells out annually. Lollapalooza is one of the largest and most iconic music festivals in the world and one of the longest-running in the United States.\n\nLollapalooza was conceived and created in 1991 as a farewell tour by Perry Farrell, singer of the group Jane's Addiction.\n\nInstruction:\n\nGiven a reference text about Lollapalooza, where does it take place, who started it and what is it?\n\nAnswer:\n\nLollapalooze is an annual musical festival held in Grant Park in Chicago, Illinois. It was started in 1991 as a farewell tour by Perry Farrell, singe of the group Jane's Addiction. The festival includes an array of musical genres including alternative rock, heavy metal, punk rock, hip hop, and electronic dance music. The festivals welcomes an estimated 400,000 people each year and sells out annually. Some notable headliners include: the Red Hot Chili Peppers, Chance the Rapper, Metallica, and Lady Gage. Lollapalooza is one of the largest and most iconic festivals in the world and a staple of Chicago.\n\n",
    "Instruction:\n\nGiven this paragraph about London, give me a reason why the London Docklands became a focus for regeneration in the 1980s.Context:\n\nGreater London's population declined in the decades after the Second World War, from an estimated peak of 8.6 million in 1939 to around 6.8 million in the 1980s. The principal ports for London moved downstream to Felixstowe and Tilbury, with the London Docklands area becoming a focus for regeneration, including the Canary Wharf development. This was born out of London's increasing role as an international financial centre in the 1980s. The Thames Barrier was completed in the 1980s to protect London against tidal surges from the North Sea.\n\nAnswer:\n\nOne reason why the London Docklands became a focus for regeneration in the 1980s is that London had an increasing role as an international financial centre.\n\n",
    "Context:\n\nAraber Rahaman (died 28 April 2013) was an Indian politician. He was the Tripura MLA for Boxanagar from 1978–1988.\n\nInstruction:\n\nWhat was the profession of Araber Rahaman?\n\nAnswer:\n\nHe was a politician.\n\n",
    "Instruction:\n\nWhat is a small-world network?Context:\n\nA small-world network is a mathematical graph in which most nodes are not neighbors of one another, but the neighbors of any given node are likely to be neighbors of each other. Due to this, most neighboring nodes can be reached from every other node by a small number of hops or steps. Specifically, a small-world network is defined to be a network where the typical distance L between two randomly chosen nodes (the number of steps required) grows proportionally to the logarithm of the number of nodes N in the network.\n\nAnswer:\n\nA small-world network is a mathematical graph in which most nodes are not neighbors of one another, but the neighbors of any given node are likely to be neighbors of each other.\n\n",
    "Context:\n\nIn a 100 gram amount, smooth peanut butter supplies 597 Calories and is composed of 51% fat, 22% protein, 22% carbohydrates (including 5% dietary fiber), and 1% water (table). Both crunchy and smooth peanut butter are sources of saturated and monounsaturated fats (mainly oleic acid) as 25% of total serving amount, and polyunsaturated fat (12% of total), primarily as linoleic acid).\n\nPeanut butter is a rich source (20% or more of the Daily Value, DV) of dietary fiber, vitamin E, pantothenic acid, folate, niacin, and vitamin B6 (table, USDA FoodData Central). Also high in content are the dietary minerals manganese, magnesium, phosphorus, zinc, copper, and sodium (added as salt during manufacturing). Peanut butter is a moderate source (10–19% DV) of thiamin, riboflavin, iron, and potassium (table).\n\nInstruction:\n\nGiven the following paragraph about the nutrition profile of peanut butter, what minerals is peanut butter rich in?\n\nAnswer:\n\nMinerals that peanut butter is rich in include manganese, magnesium, phosphorus, zinc, copper, and sodium.\n\n",
    "Instruction:\n\nFrom the passage provided, extract the difference in caffeine between a light roast and a dark roast.Context:\n\nSucrose is rapidly lost during the roasting process, and may disappear entirely in darker roasts. During roasting, aromatic oils and acids weaken, changing the flavor; at 205 °C (401 °F), other oils start to develop. One of these oils, caffeol, is created at about 200 °C (392 °F), which is largely responsible for coffee's aroma and flavor. The difference of caffeine content between a light roast and a dark roast is only about 0.1%.\n\nAnswer:\n\nLight roasts and dark roasts differ in caffeine content by about 0.1%.\n\n",
    "Context:\n\n2022 Mazar-i-Sharif mosque bombing\n\nOn 21 April 2022, a powerful bomb rocked the Shia Seh Dokan mosque in Mazar-i-Sharif, Balkh Province, Afghanistan killing at least 31 people and injuring more than 87 others. The Islamic State – Khorasan Province claimed responsibility via Telegram.\n\nWorshippers were performing the Zuhr prayer inside the mosque when the bomb exploded. Authorities counted 31 dead and at least 87 injured, six of whom were wounded critically.\n\nThe bombing was part of a series of attacks on the same day, including two explosions targeting Taliban officers in Kunduz and Khogyani District and a bombing that injured two Shia children in Kabul.\n\nInstruction:\n\nGiven a reference text about the 2022 Mazar-i-Sharif mosque bombing, how many people were injured and killed?\n\nAnswer:\n\nAt least 31 people were killed and more than 87 others were injured in the 2022 Mazar-i-Sharif mosque bombing.\n\n",
    "Instruction:\n\nWho wrote the music and lyrics for Replay?Context:\n\n\"Tomorrow\" is a show tune from the musical Annie, with music by Charles Strouse and lyrics by Martin Charnin, published in 1977. The number was originally written as \"Replay\" (The Way We Live Now) for the 1970 short film Replay, with both music and lyrics by Strouse.\n\nIn 1972 Strouse, and Thomas Meehan began working on a musical based on the Little Orphan Annie comic strips, Annie. Strouse contributed a reworked version of \"Replay\" as \"Tomorrow\". \"Annie\" took until 1976 to reach Broadway and during that time Strouse reworked \"Replay\" again for possible use in what became \"Charlie and Algernon\", a musical version of Daniel Keyes's Flowers for Algernon with book by playwright David Rogers although it was not ultimately used. \"\n\nAnswer:\n\nCharles Strouse\n\n",
    "Instruction:\n\nGiven these two paragraphs, where did Jimmy Carter go to college?Context:\n\nCarter attended Plains High School from 1937 to 1941, graduating from the eleventh grade, since the school did not have a twelfth grade. By that time, Archery and Plains had been impoverished by the Great Depression, but the family benefited from New Deal farming subsidies, and Carter's father took a position as a community leader. Carter himself was a diligent student with a fondness for reading. A popular anecdote holds that he was passed over for valedictorian after he and his friends skipped school to venture downtown in a hot rod. Carter's truancy was mentioned in a local newspaper, although it is not clear he would have otherwise been valedictorian. As an adolescent, Carter played on the Plains High School basketball team, and also joined a youth organization named the Future Farmers of America, which helped him develop a lifelong interest in woodworking.\n\nCarter had long dreamed of attending the United States Naval Academy. In 1941, he started undergraduate coursework in engineering at Georgia Southwestern College in nearby Americus, Georgia. The following year, he transferred to the Georgia Institute of Technology in Atlanta, and he earned admission to the Naval Academy in 1943.  He was a good student but was seen as reserved and quiet, in contrast to the academy's culture of aggressive hazing of freshmen.  While at the academy, Carter fell in love with Rosalynn Smith, a friend of his sister Ruth. The two married shortly after his graduation in 1946. He was a sprint football player for the Navy Midshipmen. Carter graduated 60th out of 821 midshipmen in the class of 1947 with a Bachelor of Science degree and was commissioned as an ensign.\n\nAnswer:\n\nJimmy Carter received his Bachelor of Science degree from the United States Naval Academy in 1947. However, he began his undergraduate studies at Georgia Southwestern College. A year later, he transferred to the Georgia Institute of Technology before ultimately earning his admission into the Naval Academy where he would complete his studies.\n\n",
    "Instruction:\n\nWhat sport does Arshdeep play?Context:\n\nArshdeep Singh (born 7 May 1994) is an Indian professional footballer who plays as a forward for Minerva Punjab F.C. in the I-League.\n\nAnswer:\n\nfootball\n\n",
    "Context:\n\nJoseph Robinette Biden Jr. was born on November 20, 1942, at St. Mary's Hospital in Scranton, Pennsylvania, to Catherine Eugenia \"Jean\" Biden (née Finnegan) and Joseph Robinette Biden Sr. The oldest child in a Catholic family, he has a sister, Valerie, and two brothers, Francis and James. Jean was of Irish descent, while Joseph Sr. had English, Irish, and French Huguenot ancestry. Biden's paternal line has been traced to stonemason William Biden, who was born in 1789 in Westbourne, England, and emigrated to Maryland in the United States by 1820.\nhttps://en.wikipedia.org/wiki/Joe_Biden\n\nInstruction:\n\nBased on this paragraph, what was Joe Biden's mother's maiden's name, what city was he born in, how many siblings did he have growing up, and what religion was he as a child?\n\nAnswer:\n\nBased on this paragraph, Joe Biden's mother's maiden name was Finnegan, he was born in the city of Stranton, he had three siblings (a younger sister and two younger brothers), and he was raised as a member of the Catholic church.\n\n",
    "Instruction:\n\nWhich is the second most populated state in India?Context:\n\nMaharashtra (/məhɑːˈrɑːʃtrə/; Marathi: [məhaɾaːʂʈɾə] (listen), abbr. MH or Maha) is a state in the western peninsular region of India occupying a substantial portion of the Deccan Plateau. Maharashtra is the second-most populous state in India and the second-most populous country subdivision globally. It was formed on 1 May 1960 by splitting the bilingual Bombay State, which had existed since 1956, into majority Marathi-speaking Maharashtra and Gujarati-speaking Gujarat. Maharashtra is home to the Marathi people, the predominant ethno-linguistic group, who speak the Marathi language, the official language of the state. The state is divided into 6 divisions and 36 districts, with the state capital being Mumbai, the most populous urban area in India, and Nagpur serving as the winter capital, which also hosts the winter session of the state legislature. Godavari and Krishna are the two major rivers in the state. Forests cover 16.47 per cent of the state's geographical area. Out of the total cultivable land in the state, about 60 per cent is used for grain crops in the Deccan region, rice in coastal Konkan, and other high rainfall areas.\n\nAnswer:\n\nMaharashtra\n\n",
    "Instruction:\n\nHow many volumes of Wheel of Time are there?Context:\n\nThe Wheel of Time is a series of high fantasy novels by American author Robert Jordan, with Brandon Sanderson as a co-author for the final three novels. Originally planned as a six-book series at its debut in 1990, The Wheel of Time came to span 14 volumes, in addition to a prequel novel and two companion books. Jordan died in 2007 while working on what was planned to be the final volume in the series. He prepared extensive notes which enabled fellow fantasy author Brandon Sanderson to complete the final book, which grew into three volumes: The Gathering Storm (2009), Towers of Midnight (2010), and A Memory of Light (2013).\n\nAnswer:\n\nOriginally planned as a six-book series at its debut in 1990, The Wheel of Time came to span 14 volumes\n\n",
    "Context:\n\nThe Henry Holst String Quartet was founded by the Danish violinist Henry Holst in 1931. Holst had studied at the Royal Danish Conservatory under Axel Gade and Carl Nielsen. In 1923, he was appointed leader of the Berlin Philharmonic Orchestra, but in 1931 he moved to Manchester as a Professor at the Royal Manchester College of Music.\n\nThe move to Manchester led to the formation of the Henry Holst String Quartet with Charles Taylor (second violin), Herbert Downes (viola) and Anthony Pini (cello). The ensemble was recognised as fine quartet, touring extensively in the UK and broadcasting on BBC Radio. They played a number of times in Liverpool for the Rodewald Concert Society in the 1934 and 1937 seasons.\n\nErnest Element (2nd violin) and Frank Venton (viola) also sometimes played for the quartet. Herbert Downes left to lead his own quartet in 1935. Charles Taylor also left to found his own quartet and was replaced by Reginald Stead as second violin. Reginald Stead later became the leader of the BBC Northern Orchestra. Anthony Pini joined the London Philharmonic Orchestra in 1932 and was replaced by John C Hock as cellist. The Henry Holst Quartet finally disbanded when Henry Holst formed the Philharmonia Quartet in 1941 at the instigation of Walter Legge to record for Columbia Records.\n\nInstruction:\n\nHow long did the Henry Holst String Quartet last with its original group of members based on this text? Explain your work.\n\nAnswer:\n\nIt lasted for one year before an original member left. The first member to leave was Anthony Pini in 1932. The band was founded when Holst moved to Manchester in 1931. There is one year between these dates.\n\n",
    "Context:\n\nThe winners were announced during the awards ceremony on February 26, 2017. Moonlight became the first film with an all-black cast and the first LGBT-themed film to win Best Picture. In an event unprecedented in the history of the Oscars, La La Land was incorrectly announced as the Best Picture, and, a few minutes later, the error was corrected and Moonlight was declared the winner. O.J.: Made in America, at 467 minutes, became the longest film to win an Academy Award, surpassing the 431-minute long War and Peace, which won the Academy Award for Best Foreign Language Film in 1969. Following the five-part documentary's win, new academy rules barred any \"multi-part or limited series\" from being eligible for documentary categories. With Casey Affleck winning the Oscar for Best Actor, he and his older brother, Ben Affleck, became the 16th pair of siblings to win Academy Awards. Mahershala Ali became the first Muslim actor to win an Oscar. Viola Davis became the first black person to achieve the Triple Crown of Acting with her Oscar, Emmy, and Tony wins.\n\nInstruction:\n\nWhich movie was originally declared the winner for Best Picture?\n\nAnswer:\n\nLa La Land was originally declared the winner for Best Picture\n\n",
    "Context:\n\nThe development of metal–oxide–semiconductor (MOS) very-large-scale integration (VLSI), in the form of complementary MOS (CMOS) technology, enabled increasing MOS transistor counts in digital electronics. This provided more processing power for the development of practical artificial neural networks in the 1980s. From 1988 onward, the use of neural networks transformed the field of protein structure prediction, in particular when the first cascading networks were trained on profiles (matrices) produced by multiple sequence alignments.\n\nInstruction:\n\nDuring which decade did neural networks first lead to practically useful systems?\n\nAnswer:\n\nThe development of metal–oxide–semiconductor (MOS) very-large-scale integration (VLSI), in the form of complementary MOS (CMOS) technology, enabled the development of practical artificial neural networks in the 1980s\n\n",
    "Instruction:\n\nWhat is TSA?Context:\n\nThe Transportation Security Administration (TSA) is an agency of the United States Department of Homeland Security (DHS) that has authority over the security of transportation systems within, and connecting to the United States. It was created as a response to the September 11 attacks to improve airport security procedures and consolidate air travel security under a dedicated federal administrative law enforcement agency.\n\nAnswer:\n\nTSA stands for Transportation Security Administration in the United States. It is the agency that is responsible for the security of transportation systems within United States. They are mainly responsible for airport security.\n\n",
    "Context:\n\nTouch typing (also called blind typing, or touch keyboarding) is a style of typing. Although the phrase refers to typing without using the sense of sight to find the keys—specifically, a touch typist will know their location on the keyboard through muscle memory—the term is often used to refer to a specific form of touch typing that involves placing the eight fingers in a horizontal row along the middle of the keyboard (the home row) and having them reach for specific other keys. (Under this usage, typists who do not look at the keyboard but do not use home row either are referred to as hybrid typists.) Both two-handed touch typing and one-handed touch typing are possible.\n\nInstruction:\n\nWhat does Touch Typing refer to?\n\nAnswer:\n\nTouch typing refers to typing without using the sense of sight to find the keys\n\n",
    "Context:\n\nA number of significant inventions and discoveries have been made by Berkeley faculty members and researchers:\n\nNatural sciences\nEdit\nAtomic bomb – Physics professor J. Robert Oppenheimer was wartime director of Los Alamos National Laboratory and the Manhattan Project.\nCarbon 14 and photosynthesis – Martin Kamen and Sam Ruben first discovered carbon 14 in 1940, and Nobel laureate Melvin Calvin and his colleagues used carbon 14 as a molecular tracer to reveal the carbon assimilation path in photosynthesis, known as Calvin cycle.\nCarcinogens – Identified chemicals that damage DNA. The Ames test was described in a series of papers in 1973 by Bruce Ames and his group at the university.\nChemical elements – 16 elements have been discovered at Berkeley (technetium, astatine, neptunium, plutonium, americium, curium, berkelium, californium, einsteinium, fermium, mendelevium, nobelium, lawrencium, rutherfordium, dubnium, and seaborgium).\nCovalent bond – Gilbert N. Lewis in 1916 described the sharing of electron pairs between atoms, and invented the Lewis notation to describe the mechanisms.\nCRISPR gene editing – Nobel laureate Jennifer Doudna discovers a precise and inexpensive way for manipulating DNA in human cells.\nCyclotron – Ernest O. Lawrence created a particle accelerator in 1934, and was awarded the Nobel Physics Prize in 1939.\nDark energy – Saul Perlmutter and many others in the Supernova Cosmology Project discover the universe is expanding because of dark energy 1998.\nFlu vaccine – Wendell M. Stanley and colleagues discovered the vaccine in the 1940s.\nHydrogen bomb – Edward Teller, the father of hydrogen bomb, was a professor at Berkeley and a researcher at the Lawrence Livermore National Laboratory and the Los Alamos National Laboratory.\nImmunotherapy of cancer – James P. Allison discovers and develops monoclonal antibody therapy that uses the immune system to combat cancer 1992–1995.\nMolecular clock – Allan Wilson discovery in 1967.\nNeuroplasticity – Marian Diamond discovers structural, biochemical, and synaptic changes in brain caused by environmental enrichment 1964\nOncogene – Peter Duesberg discovers first cancer causing gene in a virus 1970s.\nTelomerase – Elizabeth H. Blackburn, Carol Greider, and Jack Szostak discover enzyme that promotes cell division and growth 1985.\nVitamin E – Gladys Anderson Emerson isolates Vitamin E in a pure form in 1952.\n\nInstruction:\n\nWhat are the major innovations and scientific discoveries from UC Berkeley?\n\nAnswer:\n\nAtomic bomb by J. Robert Oppenheimer, carbon 14 and its photosynthesis, covalent bond, cyclotron, and etc.\n\n",
    "Instruction:\n\nBased on this paragraph, what was Joe Biden's mother's maiden's name, what city was he born in, how many siblings did he have growing up, and what religion was he as a child?Context:\n\nJoseph Robinette Biden Jr. was born on November 20, 1942, at St. Mary's Hospital in Scranton, Pennsylvania, to Catherine Eugenia \"Jean\" Biden (née Finnegan) and Joseph Robinette Biden Sr. The oldest child in a Catholic family, he has a sister, Valerie, and two brothers, Francis and James. Jean was of Irish descent, while Joseph Sr. had English, Irish, and French Huguenot ancestry. Biden's paternal line has been traced to stonemason William Biden, who was born in 1789 in Westbourne, England, and emigrated to Maryland in the United States by 1820.\nhttps://en.wikipedia.org/wiki/Joe_Biden\n\nAnswer:\n\nBased on this paragraph, Joe Biden's mother's maiden name was Finnegan, he was born in the city of Stranton, he had three siblings (a younger sister and two younger brothers), and he was raised as a member of the Catholic church.\n\n",
    "Context:\n\nBull sharks are large and stout, with females being larger than males. The bull shark can be up to 81 cm (2 ft 8 in) in length at birth. Adult female bull sharks average 2.4 m (8 ft) long and typically weigh 130 kg (290 lb), whereas the slightly smaller adult male averages 2.25 m (7 ft) and 95 kg (209 lb). While a maximum size of 3.5 m (11 ft) is commonly reported, a single record exists of a female specimen of exactly 4.0 m (13 ft). A 3.25 m (10.7 ft) long pregnant individual reached 450 kg (990 lb). Bull sharks are wider and heavier than other requiem sharks of comparable length, and are grey on top and white below. The second dorsal fin is smaller than the first. The bull shark's caudal fin is longer and lower than that of the larger sharks, and it has a small snout, and lacks an interdorsal ridge.\n\nInstruction:\n\nAccording to this paragraph about bull sharks, how long are male adult sharks in meters?\n\nAnswer:\n\nMale adult bull sharks average 2.25 meters in length.\n\n",
    "Instruction:\n\nGiven this paragraph about the Ain Elzarga Wetland, why is this location one of the most important wetlands in the region?Context:\n\nAin Elzarga Wetland is a Ramsar-protected wetland of Libya. It was established in 2000 and covers an area of 33 hectares (82 acres). Ramsar says of it: \"A small natural sebkha or depression with at least one natural connection to the sea, wet all year round but with increasing water levels and salinity during summer. The sebkha, with mudflats and salt marsh community, is surrounded by dunes from east to west and rocky hills to the south and east. The site is one of the most important wetlands in the area of the El Kouf National Park for migratory waterbirds. The birdwatching and ecotourism potential is considerable but undeveloped. Unsustainable hunting and destruction of vegetation, especially during summer, are considered threats.\n\nAnswer:\n\nThe Ain Elzarga Wetland is an important wetland due to being the home for migratory waterbirds.\n\n",
    "Instruction:\n\nWhat is an expert system, and when did they first emerge?Context:\n\nBoom 1980–1987\nIn the 1980s a form of AI program called \"expert systems\" was adopted by corporations around the world and knowledge became the focus of mainstream AI research. In those same years, the Japanese government aggressively funded AI with its fifth generation computer project. Another encouraging event in the early 1980s was the revival of connectionism in the work of John Hopfield and David Rumelhart. Once again, AI had achieved success.\n\nThe rise of expert systems\nAn expert system is a program that answers questions or solves problems about a specific domain of knowledge, using logical rules that are derived from the knowledge of experts. The earliest examples were developed by Edward Feigenbaum and his students. Dendral, begun in 1965, identified compounds from spectrometer readings. MYCIN, developed in 1972, diagnosed infectious blood diseases. They demonstrated the feasibility of the approach.\n\nExpert systems restricted themselves to a small domain of specific knowledge (thus avoiding the commonsense knowledge problem) and their simple design made it relatively easy for programs to be built and then modified once they were in place. All in all, the programs proved to be useful: something that AI had not been able to achieve up to this point.\n\nIn 1980, an expert system called XCON was completed at CMU for the Digital Equipment Corporation. It was an enormous success: it was saving the company 40 million dollars annually by 1986. Corporations around the world began to develop and deploy expert systems and by 1985 they were spending over a billion dollars on AI, most of it to in-house AI departments. An industry grew up to support them, including hardware companies like Symbolics and Lisp Machines and software companies such as IntelliCorp and Aion.\n\nAnswer:\n\nAn expert system is a program that uses logical rules derived from expert knowledge to answer questions or solve problems in a specific domain of knowledge. The first expert system, called Dendral, was developed in 1965 by Edward Feigenbaum and his students and identified compounds from spectrometer readings.\n\n",
    "Instruction:\n\nWhere is the Bulgan Volcanic Field located?Context:\n\nKhanuy-Gol (also known as Bulgan Volcanic Field, Chanuj Gol Hanui Gol or Hanuy Gol) is a volcanic field in Mongolia. Khanuy-Gol is located in the northern Hangai range, north of the settlement of Bulgan.\n\nTopographic map\nIt covers a surface area of 3,500 square kilometres (1,400 sq mi) 150 kilometres (93 mi) southwest of Ulanbator. Among the 10 cones with heights of 30–190 metres (98–623 ft) that make up the field are Baga Togo Uul/Bogo-Togo-Ula (meaning \"Little Togo Mountain\", 28 metres (92 ft) high, 48°55.79′N 102°46.22′E to 48°55.34′N 102°45.75′E), Ikh Togo Uul/Ikha-Togo-Ula (meaning \"Great Togo mountain\", 219 metres (719 ft) high, 48°59.53′N 102°44.48′E), Togo, Urun Dush, and Uran Uul. This cone is the highest of the field, with a height of 280 metres (920 ft). Baga Togo Uul has one maar-like vent among its three vents, these vents are named Javalach, Togo and Tulga. Both Togo cones have a vegetation cover.\n\nAnswer:\n\nThe Bulgan Volcanic Field is located in Mongolia, in the northern Hangai range.\n\n",
    "Context:\n\nThe Underground Railroad was a network of clandestine routes and safe houses established in the United States during the early- to the mid-19th century. It was used by enslaved African Americans primarily to escape into free states and Canada. The network was assisted by abolitionists and others sympathetic to the cause of the escapees. The enslaved persons who risked escape and those who aided them are also collectively referred to as the \"Underground Railroad\". Various other routes led to Mexico, where slavery had been abolished, and to islands in the Caribbean that were not part of the slave trade. An earlier escape route running south toward Florida, then a Spanish possession (except 1763–1783), existed from the late 17th century until approximately 1790. However, the network now generally known as the Underground Railroad began in the late 18th century. It ran north and grew steadily until the Emancipation Proclamation was signed by President Abraham Lincoln. One estimate suggests that by 1850, approximately 100,000 enslaved people had escaped to freedom via the network\n\nInstruction:\n\nWhat was the Underground Railroad?\n\nAnswer:\n\nThe Underground Railroad was a secret network of routes and safe houses in the United States established in the early 19th century that led to free states, Canada, Mexico and other overseas areas. Black slaves used the Underground Railroad to escape from slavery. It is estimated that by 1850, about 100,000 slaves had escaped to freedom by the \"Railroad\".\n\n",
    "Context:\n\nPre-colonial Africa possessed perhaps as many as 10,000 different states and polities characterized by many different sorts of political organization and rule. These included small family groups of hunter-gatherers such as the San people of southern Africa; larger, more structured groups such as the family clan groupings of the Bantu-speaking peoples of central, southern, and eastern Africa; heavily structured clan groups in the Horn of Africa; the large Sahelian kingdoms; and autonomous city-states and kingdoms such as those of the Akan; Edo, Yoruba, and Igbo people in West Africa; and the Swahili coastal trading towns of Southeast Africa.\n\nInstruction:\n\nWhat types of political organizations did pre-colonial Africa have?\n\nAnswer:\n\nPre-colonial Africa had many political organizations including: small family groups, larger family clan groupings, heavily structured clan groups, and autonomous city-states and kingdoms.\n\n",
    "Instruction:\n\nWhy is prioritizing diversity hiring in an organization important?Context:\n\nDiversity is believed to bring substantial benefits such as better decision making and improved problem solving, greater creativity and innovation, which leads to enhanced product development, and more successful marketing to different types of customers\n\nAnswer:\n\nDiversity drives creativity, innovation, and personal growth.\n\n",
    "Context:\n\nGreater London's population declined in the decades after the Second World War, from an estimated peak of 8.6 million in 1939 to around 6.8 million in the 1980s. The principal ports for London moved downstream to Felixstowe and Tilbury, with the London Docklands area becoming a focus for regeneration, including the Canary Wharf development. This was born out of London's increasing role as an international financial centre in the 1980s. The Thames Barrier was completed in the 1980s to protect London against tidal surges from the North Sea.\n\nInstruction:\n\nGiven this paragraph about London, give me a reason why the London Docklands became a focus for regeneration in the 1980s.\n\nAnswer:\n\nOne reason why the London Docklands became a focus for regeneration in the 1980s is that London had an increasing role as an international financial centre.\n\n",
    "Context:\n\nSwimming under ice. On 16 March 2000, Hof set the Guinness World Record for farthest swim under ice on his second attempt, with a distance of 57.5 metres (188.6 feet). Hof's first attempt the day before failed when he began his swim without goggles and his corneas froze solid and blinded him. A rescue diver pulled him to the surface after he passed out. The record has been broken several times since and is 265 feet (81 m) as of 2022.\"\n\nInstruction:\n\nWho set the first Guinness World Record for swimming under ice?\n\nAnswer:\n\nOn 16 March 2000, Wim Hof set the Guinness World Record for thre farthest swim under ice, with a distance of 57.5 metres (188.6 feet).\n\n",
    "Instruction:\n\nHow long did the Henry Holst String Quartet last with its original group of members based on this text? Explain your work.Context:\n\nThe Henry Holst String Quartet was founded by the Danish violinist Henry Holst in 1931. Holst had studied at the Royal Danish Conservatory under Axel Gade and Carl Nielsen. In 1923, he was appointed leader of the Berlin Philharmonic Orchestra, but in 1931 he moved to Manchester as a Professor at the Royal Manchester College of Music.\n\nThe move to Manchester led to the formation of the Henry Holst String Quartet with Charles Taylor (second violin), Herbert Downes (viola) and Anthony Pini (cello). The ensemble was recognised as fine quartet, touring extensively in the UK and broadcasting on BBC Radio. They played a number of times in Liverpool for the Rodewald Concert Society in the 1934 and 1937 seasons.\n\nErnest Element (2nd violin) and Frank Venton (viola) also sometimes played for the quartet. Herbert Downes left to lead his own quartet in 1935. Charles Taylor also left to found his own quartet and was replaced by Reginald Stead as second violin. Reginald Stead later became the leader of the BBC Northern Orchestra. Anthony Pini joined the London Philharmonic Orchestra in 1932 and was replaced by John C Hock as cellist. The Henry Holst Quartet finally disbanded when Henry Holst formed the Philharmonia Quartet in 1941 at the instigation of Walter Legge to record for Columbia Records.\n\nAnswer:\n\nIt lasted for one year before an original member left. The first member to leave was Anthony Pini in 1932. The band was founded when Holst moved to Manchester in 1931. There is one year between these dates.\n\n",
    "Instruction:\n\nWhat makes a Squishmallow resellable?Context:\n\nDue to the demand for the toy, Squishmallows are often sold by resellers for an increased price. The average resell price for a Squishmallow depends on the size, condition, and rarity of the specific item. Some limited edition or high-demand Squishmallows are sold by resellers and collectors for hundreds or thousands of dollars. Jack the Black Cat, known for its closed white eyes and white whiskers, is one of the rarest Squishmallows sold to date. KellyToys introduced the limited edition stuffed animal on their website in 2020, where it sold out within two hours. Third party websites like eBay host listings for Jack the Black Cat valued at nearly $2,000. Among the many Squishmallows that are sold, some of the most popular include Connor the Cow, Malcolm the Mushroom, Archie the Axolotl, and Philippe the Frog. There are reports that resellers are harassed and doxxed by the community.\n\nAnswer:\n\nSquishmallows are a highly demanded toy and also often are sold as limited edition items. As a result, Squishmallows that are more unique and rare can often be sold or higher value later. One example is Jack the Black Cat which has been listed on eBay for nearly $2,000.\n\n",
    "Context:\n\nSucrose is rapidly lost during the roasting process, and may disappear entirely in darker roasts. During roasting, aromatic oils and acids weaken, changing the flavor; at 205 °C (401 °F), other oils start to develop. One of these oils, caffeol, is created at about 200 °C (392 °F), which is largely responsible for coffee's aroma and flavor. The difference of caffeine content between a light roast and a dark roast is only about 0.1%.\n\nInstruction:\n\nFrom the passage provided, extract the difference in caffeine between a light roast and a dark roast.\n\nAnswer:\n\nLight roasts and dark roasts differ in caffeine content by about 0.1%.\n\n",
    "Instruction:\n\nWhat are some examples of low-flow fixtures?Context:\n\nA low-flow fixture is a water saving plumbing fixture designed to achieve water savings by having a lower flow rate of water or a smaller quantity per flush. Some of these low-flow fixtures are faucets, showerheads, and toilets. In the United States a maximum water usage of conventional plumbing fixtures was federally mandated by the Energy policy act of 1992. Low-flow fixtures are designed to save water over conventional fixtures by having a lower flow rate while still maintaining satisfactory performance. The Environmental protection agency (EPA) WaterSense program has requirements for plumbing fixtures to achieve their definition for water saving low-flow.\n\nAnswer:\n\nfaucets, showerheads, and toilets\n\n",
    "Instruction:\n\nGiven this paragraph about muscle strains and that my symptoms include severe and acute pain with movement limitations, how bad is my strain?Context:\n\nA strain can occur as a result of improper body mechanics with any activity (e.g., contact sports, lifting heavy objects) that can induce mechanical trauma or injury. Generally, the muscle or tendon overstretches and is placed under more physical stress than it can withstand. Strains commonly result in a partial or complete tear of a tendon or muscle, or they can be severe in the form of a complete tendon rupture. Strains most commonly occur in the foot, leg, or back. Acute strains are more closely associated with recent mechanical trauma or injury. Chronic strains typically result from repetitive movement of the muscles and tendons over a long period of time.\n\nDegrees of Injury (as classified by the American College of Sports Medicine):\n\nFirst degree (mildest) – little tissue tearing; mild tenderness; pain with full range of motion.\nSecond degree – torn muscle or tendon tissues; painful, limited motion; possibly some swelling or depression at the spot of the injury.\nThird degree (most severe) – limited or no movement; severe acute pain, though sometimes painless straight after the initial injury\n\nAnswer:\n\nYou likely have a Grade 3 strain, often considered amongst the most severe types\n\n",
    "Instruction:\n\nGiven a reference text about Lotus Mark IX, who designed the car?Context:\n\nThe Lotus Mark IX (1955) was an aluminium-bodied sports racing car manufactured by Lotus Engineering Ltd. About thirty of the Mark IX sports racing cars were made. It was closely related to the Lotus model Mark VIII (1954), of which only about seven cars were made. These cars were largely based on the innovative space frame of the Lotus Mark VI (1952). The highly aerodynamic bodies were designed by Frank Costin and constructed by Williams & Pritchard Limited.\n\nDuring this early era, of 1954–1955, Lotus Engineering was still a fledgling company, and cars were delivered in different states of completion on special orders. Similar to the Mark VIII, the Mark IX was available in various configurations and different engines, including the 1500 cc MG, 1500 cc Connaught and 2-litre Bristol were fitted. However, the Mark IX designation is most often powered by the 1100 cc Coventry Climax engine. Apparently, two models of Mark IX were offered – the \"Club\" and the \"Le Mans\", the latter of which had larger drum brakes fitted.\n\nAnswer:\n\nThe Lotus Mark IX was designed by Frank Costin.\n\n",
    "Instruction:\n\nDuring which decade did neural networks first lead to practically useful systems?Context:\n\nThe development of metal–oxide–semiconductor (MOS) very-large-scale integration (VLSI), in the form of complementary MOS (CMOS) technology, enabled increasing MOS transistor counts in digital electronics. This provided more processing power for the development of practical artificial neural networks in the 1980s. From 1988 onward, the use of neural networks transformed the field of protein structure prediction, in particular when the first cascading networks were trained on profiles (matrices) produced by multiple sequence alignments.\n\nAnswer:\n\nThe development of metal–oxide–semiconductor (MOS) very-large-scale integration (VLSI), in the form of complementary MOS (CMOS) technology, enabled the development of practical artificial neural networks in the 1980s\n\n",
    "Context:\n\nArshdeep Singh (born 7 May 1994) is an Indian professional footballer who plays as a forward for Minerva Punjab F.C. in the I-League.\n\nInstruction:\n\nWhat sport does Arshdeep play?\n\nAnswer:\n\nfootball\n\n",
    "Instruction:\n\nWho set the first Guinness World Record for swimming under ice?Context:\n\nSwimming under ice. On 16 March 2000, Hof set the Guinness World Record for farthest swim under ice on his second attempt, with a distance of 57.5 metres (188.6 feet). Hof's first attempt the day before failed when he began his swim without goggles and his corneas froze solid and blinded him. A rescue diver pulled him to the surface after he passed out. The record has been broken several times since and is 265 feet (81 m) as of 2022.\"\n\nAnswer:\n\nOn 16 March 2000, Wim Hof set the Guinness World Record for thre farthest swim under ice, with a distance of 57.5 metres (188.6 feet).\n\n",
    "Instruction:\n\nWhat was the profession of Araber Rahaman?Context:\n\nAraber Rahaman (died 28 April 2013) was an Indian politician. He was the Tripura MLA for Boxanagar from 1978–1988.\n\nAnswer:\n\nHe was a politician.\n\n",
    "Context:\n\nKhanuy-Gol (also known as Bulgan Volcanic Field, Chanuj Gol Hanui Gol or Hanuy Gol) is a volcanic field in Mongolia. Khanuy-Gol is located in the northern Hangai range, north of the settlement of Bulgan.\n\nTopographic map\nIt covers a surface area of 3,500 square kilometres (1,400 sq mi) 150 kilometres (93 mi) southwest of Ulanbator. Among the 10 cones with heights of 30–190 metres (98–623 ft) that make up the field are Baga Togo Uul/Bogo-Togo-Ula (meaning \"Little Togo Mountain\", 28 metres (92 ft) high, 48°55.79′N 102°46.22′E to 48°55.34′N 102°45.75′E), Ikh Togo Uul/Ikha-Togo-Ula (meaning \"Great Togo mountain\", 219 metres (719 ft) high, 48°59.53′N 102°44.48′E), Togo, Urun Dush, and Uran Uul. This cone is the highest of the field, with a height of 280 metres (920 ft). Baga Togo Uul has one maar-like vent among its three vents, these vents are named Javalach, Togo and Tulga. Both Togo cones have a vegetation cover.\n\nInstruction:\n\nWhere is the Bulgan Volcanic Field located?\n\nAnswer:\n\nThe Bulgan Volcanic Field is located in Mongolia, in the northern Hangai range.\n\n",
    "Instruction:\n\nWhat is an \"El Niño\" weather pattern?Context:\n\nEl Niño (/ɛl ˈniːnjoʊ/ el NEEN-yoh, Spanish: [el ˈniɲo]; lit. 'The Boy') is the warm phase of the El Niño–Southern Oscillation (ENSO) and is associated with a band of warm ocean water that develops in the central and east-central equatorial Pacific (approximately between the International Date Line and 120°W), including the area off the Pacific coast of South America. The ENSO is the cycle of warm and cold sea surface temperature (SST) of the tropical central and eastern Pacific Ocean.\n\nEl Niño is accompanied by high air pressure in the western Pacific and low air pressure in the eastern Pacific. El Niño phases are known to last close to four years; however, records demonstrate that the cycles have lasted between two and seven years. During the development of El Niño, rainfall develops between September–November. \n\nIt should be noted that the cool phase of ENSO is Spanish: La Niña, lit. 'The Girl', with SSTs in the eastern Pacific below average, and air pressure high in the eastern Pacific and low in the western Pacific. The ENSO cycle, including both El Niño and La Niña, causes global changes in temperature and rainfall.\n\nAnswer:\n\nEl Niño (/ɛl ˈniːnjoʊ/ el NEEN-yoh, Spanish: [el ˈniɲo]; lit. 'The Boy') is the warm phase of the El Niño–Southern Oscillation (ENSO) and is associated with a band of warm ocean water that develops in the central and east-central equatorial Pacific (approximately between the International Date Line and 120°W), including the area off the Pacific coast of South America.\n\n",
    "Context:\n\n\"The sauna in Finland is an old phenomenon and its roots are difficult to trace, but its earliest versions are believed to be from 7000 BC.[citation needed] Bath houses were recorded in Europe during the same time period, but Finnish bathing habits were poorly documented for most of history. One of the first written mentions of what is believed to be the sauna customs of the forefathers of the Finns was written by Nestor the Chronicler in 1112. He told of \"\"hot wooden saunas in which naked bathers beat themselves with branches and finally pour cold water over themselves\"\".\n\nDuring the Reformation in Scandinavia the popularity of saunas expanded to other countries because the European bath houses were being destroyed.\n\nOne reason the sauna culture has always flourished in Finland has been because of the versatility of the sauna. When people were moving, the first thing they did was to build a sauna. Finns have used the sauna to live in, eat, address matters of hygiene, and, most importantly, give birth in an almost sterile environment. Unlike many other, more densely populated places in Europe, the availability of wood needed to build and warm the sauna has never been an issue. Another reason for its popularity is that in such a cold climate, the sauna allows people warmth for at least a short period of time. However, it is just as popular in the summer as in the winter.\"\n\nInstruction:\n\nWhat is one of the first recorded mentions of the sauna in Finnish literature?\n\nAnswer:\n\nNestor the Chronicler in 1112. He told of \"hot wooden saunas in which naked bathers beat themselves with branches and finally pour cold water over themselves\"\".\n\n",
    "Context:\n\nBeneficence is a concept in research ethics that states that researchers should have the welfare of the research participant as a goal of any clinical trial or other research study. The antonym of this term, maleficence, describes a practice that opposes the welfare of any research participant. According to the Belmont Report, researchers are required to follow two moral requirements in line with the principle of beneficence: do not harm and maximize possible benefits for research while minimizing any potential harm on others.\n\nThe concept that medical professionals and researchers would always practice beneficence seems natural to most patients and research participants, but in fact, every health intervention or research intervention has potential to harm the recipient. There are many different precedents in medicine and research for conducting a cost–benefit analysis and judging whether a certain action would be a sufficient practice of beneficence, and the extent to which treatments are acceptable or unacceptable is under debate.\n\nDespite differences in opinion, there are many concepts on which there is wide agreement. One is that there should be community consensus when determining best practices for dealing with ethical problems.\n\nInstruction:\n\nGiven this reference text about beneficence, what can I do to ensure compliance to the beneficence concept?\n\nAnswer:\n\nEnsure you are not harming your research participants, while maximizing benefits and minimizing any potential harm.  Engage with your community to determine best practices when encountering ethical concerns.  This should ensure your compliance with beneficence.\n\n",
    "Instruction:\n\nGiven a reference text about Lollapalooza, where does it take place, who started it and what is it?Context:\n\nLollapalooza /ˌlɒləpəˈluːzə/ (Lolla) is an annual American four-day music festival held in Grant Park in Chicago. It originally started as a touring event in 1991, but several years later, Chicago became its permanent location. Music genres include but are not limited to alternative rock, heavy metal, punk rock, hip hop, and electronic dance music. Lollapalooza has also featured visual arts, nonprofit organizations, and political organizations. The festival, held in Grant Park, hosts an estimated 400,000 people each July and sells out annually. Lollapalooza is one of the largest and most iconic music festivals in the world and one of the longest-running in the United States.\n\nLollapalooza was conceived and created in 1991 as a farewell tour by Perry Farrell, singer of the group Jane's Addiction.\n\nAnswer:\n\nLollapalooze is an annual musical festival held in Grant Park in Chicago, Illinois. It was started in 1991 as a farewell tour by Perry Farrell, singe of the group Jane's Addiction. The festival includes an array of musical genres including alternative rock, heavy metal, punk rock, hip hop, and electronic dance music. The festivals welcomes an estimated 400,000 people each year and sells out annually. Some notable headliners include: the Red Hot Chili Peppers, Chance the Rapper, Metallica, and Lady Gage. Lollapalooza is one of the largest and most iconic festivals in the world and a staple of Chicago.\n\n",
    "Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nInstruction:\n\nWhat is the primary information in this paragraph?\n\nAnswer:\n\nThe paragraph discussed racial manipulation in the 19th to 20th centuries. It considers Europeans to be discriminative against people from the Middle East, Asia and North Africa, and uses artist expressions to communicate and manipulate these prejudice to their general population.\n\n",
    "Instruction:\n\nGiven a reference text about Lasantha Rodrigo, tell me how long he worked as a mechanical engineer and who worked for.Context:\n\nLasantha Rodrigo (born 28 May 1938) is a former cricketer who played 14 matches of first-class cricket for Ceylon between 1959 and 1971.\n\nLife and career\nLasantha Rodrigo was born in Moratuwa and attended Prince of Wales' College, Moratuwa, where he captained the cricket team in 1958 and 1959, and also captained the Ceylon schools team. His father, J. B. C. Rodrigo, was principal of Prince of Wales' College from 1933 to 1959.\n\nHe made his highest first-class score on his debut, in the Gopalan Trophy match in 1958–59, when he scored 89. Batting at number three, he top-scored with 44 for Ceylon in their one-day match against the touring Australians in April 1961. He toured India with the Ceylon team in 1964-65, playing in all three matches against India, but with only moderate success.\n\nHe worked for Ceylon Cold Stores for 31 years as a mechanical engineer. Inability to take time off work to play cricket shortened his cricket career. In 2014 he was formally honoured by Sri Lanka Cricket for his services to cricket in Sri Lanka, and awarded 300,000 rupees. In September 2018, he was one of 49 former Sri Lankan cricketers felicitated by Sri Lanka Cricket, to honour them for their services before Sri Lanka became a full member of the International Cricket Council (ICC).\n\nRodrigo lives with his wife Sweenie in Moratuwa, opposite Prince of Wales' College. They have a daughter and a son.\n\nAnswer:\n\nLasantha Rodrigo worked as a mechanical engineer for Ceylon Cold Stores for 31 years.\n\n",
    "Instruction:\n\nIs Belgrandia varica a type of plant?Context:\n\nBelgrandia varica is a species of minute freshwater snail with an operculum, an aquatic gastropod mollusc or micromollusc in the family Hydrobiidae.\n\nAnswer:\n\nNo, it is a type of snail.\n\n",
    "Context:\n\nThe Walrus and the Whistleblower is a 2020 Canadian documentary film directed by Nathalie Bibeau. The film profiles Phil Demers, a former employee of Marineland who attempted to blow the whistle on allegedly inhumane treatment of animals at the institution.\n\nAccording to a film industry newsletter, the film was made \"in association with the Documentary Channel, and CBC Docs\". The Documentary Channel's announcement about the film stated that Demers had \"appeared four times on the Joe Rogan show, has testified before the Canadian Senate, and is being sued for $1.5 million for plotting to steal Smooshi, the walrus\".\n\nThe film premiered as part of the 2020 Hot Docs Canadian International Documentary Festival. Due to the COVID-19 pandemic in Canada it was not screened theatrically, but premiered as part of the festival's online streaming component and aired on CBC Television on May 28 as part of the network's special Hot Docs at Home series of films from the festival.\n\nIn June 2020, the film was named as the winner of 2020 Rogers Audience Award, alongside the films 9/11 Kids, There's No Place Like This Place, Anyplace, First We Eat and The Forbidden Reel, and as Overall Favourite at Hot Docs. The Audience Award allowed the film to be fast tracked in the Academy Award for Best Documentary Feature category, \"provided it meets all other criteria for eligibility\". Northern Banner, a division of Raven Banner Entertainment, subsequently announced that it had acquired the rights to distribute the film in Canada, probably starting before year end. The US and international distribution rights went to Gravitas Ventures.\n\nThe film received a nomination for the Donald Brittain Award at the 9th Canadian Screen Awards in 2021.\n\nInstruction:\n\nHow many awards did the film The Walrus and the Whistleblower win per this entry of information?\n\nAnswer:\n\n2.  the 2020 Rogers Audience Award, and the Donald Brittain Award in 2021.\n\n",
    "Instruction:\n\nAccording to this paragraph about bull sharks, how long are male adult sharks in meters?Context:\n\nBull sharks are large and stout, with females being larger than males. The bull shark can be up to 81 cm (2 ft 8 in) in length at birth. Adult female bull sharks average 2.4 m (8 ft) long and typically weigh 130 kg (290 lb), whereas the slightly smaller adult male averages 2.25 m (7 ft) and 95 kg (209 lb). While a maximum size of 3.5 m (11 ft) is commonly reported, a single record exists of a female specimen of exactly 4.0 m (13 ft). A 3.25 m (10.7 ft) long pregnant individual reached 450 kg (990 lb). Bull sharks are wider and heavier than other requiem sharks of comparable length, and are grey on top and white below. The second dorsal fin is smaller than the first. The bull shark's caudal fin is longer and lower than that of the larger sharks, and it has a small snout, and lacks an interdorsal ridge.\n\nAnswer:\n\nMale adult bull sharks average 2.25 meters in length.\n\n",
    "Context:\n\nBoom 1980–1987\nIn the 1980s a form of AI program called \"expert systems\" was adopted by corporations around the world and knowledge became the focus of mainstream AI research. In those same years, the Japanese government aggressively funded AI with its fifth generation computer project. Another encouraging event in the early 1980s was the revival of connectionism in the work of John Hopfield and David Rumelhart. Once again, AI had achieved success.\n\nThe rise of expert systems\nAn expert system is a program that answers questions or solves problems about a specific domain of knowledge, using logical rules that are derived from the knowledge of experts. The earliest examples were developed by Edward Feigenbaum and his students. Dendral, begun in 1965, identified compounds from spectrometer readings. MYCIN, developed in 1972, diagnosed infectious blood diseases. They demonstrated the feasibility of the approach.\n\nExpert systems restricted themselves to a small domain of specific knowledge (thus avoiding the commonsense knowledge problem) and their simple design made it relatively easy for programs to be built and then modified once they were in place. All in all, the programs proved to be useful: something that AI had not been able to achieve up to this point.\n\nIn 1980, an expert system called XCON was completed at CMU for the Digital Equipment Corporation. It was an enormous success: it was saving the company 40 million dollars annually by 1986. Corporations around the world began to develop and deploy expert systems and by 1985 they were spending over a billion dollars on AI, most of it to in-house AI departments. An industry grew up to support them, including hardware companies like Symbolics and Lisp Machines and software companies such as IntelliCorp and Aion.\n\nInstruction:\n\nWhat is an expert system, and when did they first emerge?\n\nAnswer:\n\nAn expert system is a program that uses logical rules derived from expert knowledge to answer questions or solve problems in a specific domain of knowledge. The first expert system, called Dendral, was developed in 1965 by Edward Feigenbaum and his students and identified compounds from spectrometer readings.\n\n",
    "Context:\n\nA strain can occur as a result of improper body mechanics with any activity (e.g., contact sports, lifting heavy objects) that can induce mechanical trauma or injury. Generally, the muscle or tendon overstretches and is placed under more physical stress than it can withstand. Strains commonly result in a partial or complete tear of a tendon or muscle, or they can be severe in the form of a complete tendon rupture. Strains most commonly occur in the foot, leg, or back. Acute strains are more closely associated with recent mechanical trauma or injury. Chronic strains typically result from repetitive movement of the muscles and tendons over a long period of time.\n\nDegrees of Injury (as classified by the American College of Sports Medicine):\n\nFirst degree (mildest) – little tissue tearing; mild tenderness; pain with full range of motion.\nSecond degree – torn muscle or tendon tissues; painful, limited motion; possibly some swelling or depression at the spot of the injury.\nThird degree (most severe) – limited or no movement; severe acute pain, though sometimes painless straight after the initial injury\n\nInstruction:\n\nGiven this paragraph about muscle strains and that my symptoms include severe and acute pain with movement limitations, how bad is my strain?\n\nAnswer:\n\nYou likely have a Grade 3 strain, often considered amongst the most severe types\n\n",
    "Context:\n\nBelgrandia varica is a species of minute freshwater snail with an operculum, an aquatic gastropod mollusc or micromollusc in the family Hydrobiidae.\n\nInstruction:\n\nIs Belgrandia varica a type of plant?\n\nAnswer:\n\nNo, it is a type of snail.\n\n",
    "Instruction:\n\nWhat is apartheid, and which country experienced it?Context:\n\nPortugal's overseas presence in sub-Saharan Africa (most notably in Angola, Cape Verde, Mozambique, Guinea-Bissau, and São Tomé and Príncipe) lasted from the 16th century to 1975, after the Estado Novo regime was overthrown in a military coup in Lisbon. Rhodesia unilaterally declared independence from the United Kingdom in 1965, under the white minority government of Ian Smith, but was not internationally recognized as an independent state (as Zimbabwe) until 1980, when black nationalists gained power after a bitter guerrilla war. Although South Africa was one of the first African countries to gain independence, the state remained under the control of the country's white minority through a system of racial segregation known as apartheid until 1994.\n\nAnswer:\n\nApartheid is a system of racial segregation in South Africa.\n\n",
    "Instruction:\n\nWhere are the oldest oak trees in Central America?Context:\n\nThe Cerro Arenal Natural Reserve was declared a protected area on November 4, 1991, it compromises one of 78 protected areas of Nicaragua and is managed by Ministry of the Environment and Natural Resources (MARENA).\n\nThe highest point in the reserve is located inside a tropical cloud forest 1,570 meters above sea level, rain occurs 8 months annually, between May and December. Cerro Arenal Natural Reserve is one of the smallest protected areas of Nicaragua and is abundant with flora and fauna.  Many animals are present throughout the reserve, animals such as monkeys, and armadillos. The reserve also contains the oldest oak trees in Central America.\n\nAnswer:\n\nThe oldest oak trees reside in the Cerro Arenal Natural Reserve, which was officially declared a protected area on November 4, 1991.\n\n",
    "Instruction:\n\nOf which generation is Jiang the core leader of ChinaContext:\n\nJiang Zemin (17 August 1926 – 30 November 2022) was a Chinese politician who served as general secretary of the Chinese Communist Party (CCP) from 1989 to 2002, as chairman of the Central Military Commission from 1989 to 2004, and as president of China from 1993 to 2003. Jiang was paramount leader of China from 1989 to 2002. He was the core leader of the third generation of Chinese leadership, one of four core leaders alongside Mao Zedong, Deng Xiaoping and Xi Jinping.\n\nBorn in Yangzhou, Jiangsu, Jiang joined the CCP while he was in college. After the establishment of the People's Republic of China in 1949, he received training at the Stalin Automobile Works in Moscow in the 1950s, later returning to Shanghai in 1962 to serve in various institutes, later being sent between 1970-1972 to Romania as part of an expert team to establish machinery manufacturing plants in the country. After 1979, he was appointed as the vice chair of two commissions by vice premier Gu Mu to oversee the newly-established special economic zones (SEZs). He became the vice minister of the newly-established Ministry of Electronics Industry and a member of the CCP Central Committee in 1982.\n\nJiang was appointed as the mayor of Shanghai in 1985, later being promoted to its Communist Party secretary, as well as a member of the CCP Politburo, in 1987. Jiang came to power unexpectedly as a compromise candidate following the 1989 Tiananmen Square protests and massacre, when he replaced Zhao Ziyang as CCP general secretary after Zhao was ousted for his support for the student movement. As the involvement of the \"Eight Elders\" in Chinese politics steadily declined, Jiang consolidated his hold on power to become the \"paramount leader\" in the country during the 1990s. Urged by Deng Xiaoping's southern tour in 1992, Jiang officially introduced the term \"socialist market economy\" in his speech during the 14th CCP National Congress held later that year, which accelerated \"opening up and reform\".\n\nUnder Jiang's leadership, China experienced substantial economic growth with the continuation of market reforms. The returning of Hong Kong from the United Kingdom in 1997 and of Macau from Portugal in 1999, and entry into the World Trade Organisation in 2001, were landmark moments of his era. China also witnessed improved relations with the outside world, while the Communist Party maintained its tight control over the state. Jiang faced criticism over human rights abuses, including the crackdown on the Falun Gong movement. His contributions to party doctrine, known as the \"Three Represents\", were written into the CCP constitution in 2002. Jiang gradually vacated his official leadership titles from 2002 to 2005, being succeeded in these roles by Hu Jintao, although he and his political faction continued to influence affairs until much later. On 30 November 2022, Jiang died from leukemia and multiple organ failure in Shanghai.\n\nAnswer:\n\nHe is the third generation of Chinese leadership\n\n",
    "Context:\n\nNovak Djokovic (Serbian Cyrillic: Новак Ђоковић, romanized: Novak Đoković, pronounced [nôʋaːk dʑôːkoʋitɕ] (listen); born 22 May 1987) is a Serbian professional tennis player. He is currently ranked the world No. 1 player in men's singles by the Association of Tennis Professionals (ATP), and has held the top position for a record total 381 weeks, finishing as the year-end No. 1 an Open Era record seven times. He has won a total of 93 singles titles on the men's ATP Tour with titles comprising a joint-record 22 majors, a record ten Australian Opens, a record 38 Masters, a joint-record six Tour Finals, and a record 66 Big Titles. Djokovic has completed a non-calendar year Grand Slam in singles, becoming the only man in tennis history to be the reigning champion of the four majors at once across three different surfaces. He is also the first man in the Open Era to achieve a double Career Grand Slam in singles and the only player to complete the career Golden Masters in singles by winning all of the nine Masters tournaments, which he has done twice.\n\nInstruction:\n\nGiven this paragraph about Novak Djokovic, how many majors titles does he currently hold?\n\nAnswer:\n\n22\n\n",
    "Context:\n\nIn the mathematical area of graph theory, a clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent. That is, a clique of a graph  G is an induced subgraph of  G that is complete. Cliques are one of the basic concepts of graph theory and are used in many other mathematical problems and constructions on graphs. Cliques have also been studied in computer science: the task of finding whether there is a clique of a given size in a graph (the clique problem) is NP-complete, but despite this hardness result, many algorithms for finding cliques have been studied.\n\nAlthough the study of complete subgraphs goes back at least to the graph-theoretic reformulation of Ramsey theory by Erdős & Szekeres (1935), the term clique comes from Luce & Perry (1949), who used complete subgraphs in social networks to model cliques of people; that is, groups of people all of whom know each other. Cliques have many other applications in the sciences and particularly in bioinformatics.\n\nInstruction:\n\nWhat is a clique in graph theory?\n\nAnswer:\n\nIn graph theory, a clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.\n\n",
    "Instruction:\n\nWhat was the Underground Railroad?Context:\n\nThe Underground Railroad was a network of clandestine routes and safe houses established in the United States during the early- to the mid-19th century. It was used by enslaved African Americans primarily to escape into free states and Canada. The network was assisted by abolitionists and others sympathetic to the cause of the escapees. The enslaved persons who risked escape and those who aided them are also collectively referred to as the \"Underground Railroad\". Various other routes led to Mexico, where slavery had been abolished, and to islands in the Caribbean that were not part of the slave trade. An earlier escape route running south toward Florida, then a Spanish possession (except 1763–1783), existed from the late 17th century until approximately 1790. However, the network now generally known as the Underground Railroad began in the late 18th century. It ran north and grew steadily until the Emancipation Proclamation was signed by President Abraham Lincoln. One estimate suggests that by 1850, approximately 100,000 enslaved people had escaped to freedom via the network\n\nAnswer:\n\nThe Underground Railroad was a secret network of routes and safe houses in the United States established in the early 19th century that led to free states, Canada, Mexico and other overseas areas. Black slaves used the Underground Railroad to escape from slavery. It is estimated that by 1850, about 100,000 slaves had escaped to freedom by the \"Railroad\".\n\n",
    "Context:\n\nDue to the demand for the toy, Squishmallows are often sold by resellers for an increased price. The average resell price for a Squishmallow depends on the size, condition, and rarity of the specific item. Some limited edition or high-demand Squishmallows are sold by resellers and collectors for hundreds or thousands of dollars. Jack the Black Cat, known for its closed white eyes and white whiskers, is one of the rarest Squishmallows sold to date. KellyToys introduced the limited edition stuffed animal on their website in 2020, where it sold out within two hours. Third party websites like eBay host listings for Jack the Black Cat valued at nearly $2,000. Among the many Squishmallows that are sold, some of the most popular include Connor the Cow, Malcolm the Mushroom, Archie the Axolotl, and Philippe the Frog. There are reports that resellers are harassed and doxxed by the community.\n\nInstruction:\n\nWhat makes a Squishmallow resellable?\n\nAnswer:\n\nSquishmallows are a highly demanded toy and also often are sold as limited edition items. As a result, Squishmallows that are more unique and rare can often be sold or higher value later. One example is Jack the Black Cat which has been listed on eBay for nearly $2,000.\n\n",
    "Context:\n\nAin Elzarga Wetland is a Ramsar-protected wetland of Libya. It was established in 2000 and covers an area of 33 hectares (82 acres). Ramsar says of it: \"A small natural sebkha or depression with at least one natural connection to the sea, wet all year round but with increasing water levels and salinity during summer. The sebkha, with mudflats and salt marsh community, is surrounded by dunes from east to west and rocky hills to the south and east. The site is one of the most important wetlands in the area of the El Kouf National Park for migratory waterbirds. The birdwatching and ecotourism potential is considerable but undeveloped. Unsustainable hunting and destruction of vegetation, especially during summer, are considered threats.\n\nInstruction:\n\nGiven this paragraph about the Ain Elzarga Wetland, why is this location one of the most important wetlands in the region?\n\nAnswer:\n\nThe Ain Elzarga Wetland is an important wetland due to being the home for migratory waterbirds.\n\n",
    "Instruction:\n\nWhat is one of the first recorded mentions of the sauna in Finnish literature?Context:\n\n\"The sauna in Finland is an old phenomenon and its roots are difficult to trace, but its earliest versions are believed to be from 7000 BC.[citation needed] Bath houses were recorded in Europe during the same time period, but Finnish bathing habits were poorly documented for most of history. One of the first written mentions of what is believed to be the sauna customs of the forefathers of the Finns was written by Nestor the Chronicler in 1112. He told of \"\"hot wooden saunas in which naked bathers beat themselves with branches and finally pour cold water over themselves\"\".\n\nDuring the Reformation in Scandinavia the popularity of saunas expanded to other countries because the European bath houses were being destroyed.\n\nOne reason the sauna culture has always flourished in Finland has been because of the versatility of the sauna. When people were moving, the first thing they did was to build a sauna. Finns have used the sauna to live in, eat, address matters of hygiene, and, most importantly, give birth in an almost sterile environment. Unlike many other, more densely populated places in Europe, the availability of wood needed to build and warm the sauna has never been an issue. Another reason for its popularity is that in such a cold climate, the sauna allows people warmth for at least a short period of time. However, it is just as popular in the summer as in the winter.\"\n\nAnswer:\n\nNestor the Chronicler in 1112. He told of \"hot wooden saunas in which naked bathers beat themselves with branches and finally pour cold water over themselves\"\".\n\n",
    "Context:\n\nMount St. Helens (known as Lawetlat'la to the indigenous Cowlitz people, and Loowit or Louwala-Clough to the Klickitat) is an active stratovolcano located in Skamania County, Washington, in the Pacific Northwest region of the United States. It lies 52 miles (83 km) northeast of Portland, Oregon, and 98 miles (158 km) south of Seattle. Mount St. Helens takes its English name from that of the British diplomat Lord St Helens, a friend of explorer George Vancouver who surveyed the area in the late 18th century. The volcano is part of the Cascade Volcanic Arc, a segment of the Pacific Ring of Fire.\n\nThe Mount St. Helens major eruption of May 18, 1980 remains the deadliest and most economically destructive volcanic event in U.S. history. Fifty-seven people were killed; 200 homes, 47 bridges, 15 miles (24 km) of railways, and 185 miles (298 km) of highway were destroyed. A massive debris avalanche, triggered by a magnitude 5.1 earthquake, caused a lateral eruption that reduced the elevation of the mountain's summit from 9,677 ft (2,950 m) to 8,363 ft (2,549 m), leaving a 1 mile (1.6 km) wide horseshoe-shaped crater. The debris avalanche was 0.6 cubic miles (2.5 km3) in volume. The 1980 eruption disrupted terrestrial ecosystems near the volcano. By contrast, aquatic ecosystems in the area greatly benefited from the amounts of ash, allowing life to multiply rapidly. Six years after the eruption, most lakes in the area had returned to their normal state.\n\nAfter its 1980 eruption, the volcano experienced continuous volcanic activity until 2008. Geologists predict that future eruptions will be more destructive, as the configuration of the lava domes requires more pressure to erupt. However, Mount St. Helens is a popular hiking spot and it is climbed year-round. In 1982, the Mount St. Helens National Volcanic Monument was established by President Ronald Reagan and the U.S. Congress.\n\nInstruction:\n\nIs Mount Saint Helens still active?\n\nAnswer:\n\nMount St. Helens, located in the sate of Washington is considered an active volcano.\n\n",
    "Instruction:\n\nGiven a reference text about the 2022 Mazar-i-Sharif mosque bombing, how many people were injured and killed?Context:\n\n2022 Mazar-i-Sharif mosque bombing\n\nOn 21 April 2022, a powerful bomb rocked the Shia Seh Dokan mosque in Mazar-i-Sharif, Balkh Province, Afghanistan killing at least 31 people and injuring more than 87 others. The Islamic State – Khorasan Province claimed responsibility via Telegram.\n\nWorshippers were performing the Zuhr prayer inside the mosque when the bomb exploded. Authorities counted 31 dead and at least 87 injured, six of whom were wounded critically.\n\nThe bombing was part of a series of attacks on the same day, including two explosions targeting Taliban officers in Kunduz and Khogyani District and a bombing that injured two Shia children in Kabul.\n\nAnswer:\n\nAt least 31 people were killed and more than 87 others were injured in the 2022 Mazar-i-Sharif mosque bombing.\n\n",
    "Instruction:\n\nWhich is the most populous city in the United StatesContext:\n\nNew York, often called New York City or NYC, is the most populous city in the United States. With a 2020 population of 8,804,190 distributed over 300.46 square miles (778.2 km2), New York City is the most densely populated major city in the United States and more than twice as populous as Los Angeles, the nation's second-largest city.\n\nAnswer:\n\nNew York\n\n",
    "Context:\n\nThe Cerro Arenal Natural Reserve was declared a protected area on November 4, 1991, it compromises one of 78 protected areas of Nicaragua and is managed by Ministry of the Environment and Natural Resources (MARENA).\n\nThe highest point in the reserve is located inside a tropical cloud forest 1,570 meters above sea level, rain occurs 8 months annually, between May and December. Cerro Arenal Natural Reserve is one of the smallest protected areas of Nicaragua and is abundant with flora and fauna.  Many animals are present throughout the reserve, animals such as monkeys, and armadillos. The reserve also contains the oldest oak trees in Central America.\n\nInstruction:\n\nWhere are the oldest oak trees in Central America?\n\nAnswer:\n\nThe oldest oak trees reside in the Cerro Arenal Natural Reserve, which was officially declared a protected area on November 4, 1991.\n\n",
    "Context:\n\nMaharashtra (/məhɑːˈrɑːʃtrə/; Marathi: [məhaɾaːʂʈɾə] (listen), abbr. MH or Maha) is a state in the western peninsular region of India occupying a substantial portion of the Deccan Plateau. Maharashtra is the second-most populous state in India and the second-most populous country subdivision globally. It was formed on 1 May 1960 by splitting the bilingual Bombay State, which had existed since 1956, into majority Marathi-speaking Maharashtra and Gujarati-speaking Gujarat. Maharashtra is home to the Marathi people, the predominant ethno-linguistic group, who speak the Marathi language, the official language of the state. The state is divided into 6 divisions and 36 districts, with the state capital being Mumbai, the most populous urban area in India, and Nagpur serving as the winter capital, which also hosts the winter session of the state legislature. Godavari and Krishna are the two major rivers in the state. Forests cover 16.47 per cent of the state's geographical area. Out of the total cultivable land in the state, about 60 per cent is used for grain crops in the Deccan region, rice in coastal Konkan, and other high rainfall areas.\n\nInstruction:\n\nWhich is the second most populated state in India?\n\nAnswer:\n\nMaharashtra\n\n",
    "Context:\n\nA low-flow fixture is a water saving plumbing fixture designed to achieve water savings by having a lower flow rate of water or a smaller quantity per flush. Some of these low-flow fixtures are faucets, showerheads, and toilets. In the United States a maximum water usage of conventional plumbing fixtures was federally mandated by the Energy policy act of 1992. Low-flow fixtures are designed to save water over conventional fixtures by having a lower flow rate while still maintaining satisfactory performance. The Environmental protection agency (EPA) WaterSense program has requirements for plumbing fixtures to achieve their definition for water saving low-flow.\n\nInstruction:\n\nWhat are some examples of low-flow fixtures?\n\nAnswer:\n\nfaucets, showerheads, and toilets\n\n",
    "Instruction:\n\nWhy is JDAM so cost effective?Context:\n\nThe Joint Direct Attack Munition (JDAM) is a guidance kit that converts unguided bombs, or \"dumb bombs\", into all-weather precision-guided munitions. JDAM-equipped bombs are guided by an integrated inertial guidance system coupled to a Global Positioning System (GPS) receiver, giving them a published range of up to 15 nautical miles (28 km). JDAM-equipped bombs range from 500 to 2,000 pounds (230 to 910 kg). The JDAM's guidance system was jointly developed by the United States Air Force and United States Navy, hence the \"joint\" in JDAM. When installed on a bomb, the JDAM kit is given a GBU (Guided Bomb Unit) identifier, superseding the Mark 80 or BLU (Bomb, Live Unit) nomenclature of the bomb to which it is attached.\n\nThe JDAM is not a stand-alone weapon; rather it is a \"bolt-on\" guidance package that converts unguided gravity bombs into precision-guided munitions (PGMs). The key components of the system consist of a tail section with aerodynamic control surfaces, a (body) strake kit, and a combined inertial guidance system and GPS guidance control unit.\n\nThe JDAM was meant to improve upon laser-guided bomb and imaging infrared technology, which can be hindered by bad ground and weather conditions. Laser seekers are now being fitted to some JDAMs.\n\nAnswer:\n\nThe Joint Direct Attack Munition (JDAM) is a guidance kit that converts unguided bombs to precision-guided munitions. There are several reasons why JDAM is one of the most cost effective weapons ever invented.\n\nBy using GPS navigation, the JDAM guidance kit can be extremely cheap, as low as $25k/kit.  It is likely cheaper than any other precision-guided weapons.\n\nGPS navigation provides good targeting precision, typically within meters. Combined with blast radius of 500-2000 lbs unguided bombs, JDAM can effectively destroy any targets on the ground.\n\nBecause JDAM has navigation capability, pilots no longer need to precisely aim the bombers  against the targets. It allows a bomber to quickly and precisely hit multiple targets along the route.\n\nSome JDAM guidance kits include targeting sensors, such as laser targeting. They can be used against mobile targets, which further increases the use cases for JDAM.\n\nIn summary, by combining dumb bombs with a guidance kit, JDAM becomes a very cost effective weapon system, and is widely adopted by the US and other military forces.\n\n",
    "Instruction:\n\nWhat is a clique in graph theory?Context:\n\nIn the mathematical area of graph theory, a clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent. That is, a clique of a graph  G is an induced subgraph of  G that is complete. Cliques are one of the basic concepts of graph theory and are used in many other mathematical problems and constructions on graphs. Cliques have also been studied in computer science: the task of finding whether there is a clique of a given size in a graph (the clique problem) is NP-complete, but despite this hardness result, many algorithms for finding cliques have been studied.\n\nAlthough the study of complete subgraphs goes back at least to the graph-theoretic reformulation of Ramsey theory by Erdős & Szekeres (1935), the term clique comes from Luce & Perry (1949), who used complete subgraphs in social networks to model cliques of people; that is, groups of people all of whom know each other. Cliques have many other applications in the sciences and particularly in bioinformatics.\n\nAnswer:\n\nIn graph theory, a clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.\n\n",
    "Context:\n\nThe Transportation Security Administration (TSA) is an agency of the United States Department of Homeland Security (DHS) that has authority over the security of transportation systems within, and connecting to the United States. It was created as a response to the September 11 attacks to improve airport security procedures and consolidate air travel security under a dedicated federal administrative law enforcement agency.\n\nInstruction:\n\nWhat is TSA?\n\nAnswer:\n\nTSA stands for Transportation Security Administration in the United States. It is the agency that is responsible for the security of transportation systems within United States. They are mainly responsible for airport security.\n\n",
    "Context:\n\nThe names \"laptop\" and \"notebook\" refer to the fact that the computer can be practically placed on (or on top of) the user's lap and can be used similarly to a notebook. As of 2022, in American English, the terms \"laptop\" and \"notebook\" are used interchangeably; in other dialects of English, one or the other may be preferred. Although the term \"notebook\" originally referred to a specific size of laptop (originally smaller and lighter than mainstream laptops of the time), the term has come to mean the same thing and no longer refers to any specific size.\n\nInstruction:\n\nGiven the following paragraph about a laptops, why are laptops called \"laptop\"?\n\nAnswer:\n\nLaptops are called \"laptop\" because the computer can be practically placed on the user's lap .\n\n",
    "Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nInstruction:\n\nGiven this paragraph about Hydrogen Storage, what is the hydrogen boiling point?\n\nAnswer:\n\nIt boils around 20.268 K (−252.882 °C or −423.188 °F).\n\n",
    "Context:\n\nJiang Zemin (17 August 1926 – 30 November 2022) was a Chinese politician who served as general secretary of the Chinese Communist Party (CCP) from 1989 to 2002, as chairman of the Central Military Commission from 1989 to 2004, and as president of China from 1993 to 2003. Jiang was paramount leader of China from 1989 to 2002. He was the core leader of the third generation of Chinese leadership, one of four core leaders alongside Mao Zedong, Deng Xiaoping and Xi Jinping.\n\nBorn in Yangzhou, Jiangsu, Jiang joined the CCP while he was in college. After the establishment of the People's Republic of China in 1949, he received training at the Stalin Automobile Works in Moscow in the 1950s, later returning to Shanghai in 1962 to serve in various institutes, later being sent between 1970-1972 to Romania as part of an expert team to establish machinery manufacturing plants in the country. After 1979, he was appointed as the vice chair of two commissions by vice premier Gu Mu to oversee the newly-established special economic zones (SEZs). He became the vice minister of the newly-established Ministry of Electronics Industry and a member of the CCP Central Committee in 1982.\n\nJiang was appointed as the mayor of Shanghai in 1985, later being promoted to its Communist Party secretary, as well as a member of the CCP Politburo, in 1987. Jiang came to power unexpectedly as a compromise candidate following the 1989 Tiananmen Square protests and massacre, when he replaced Zhao Ziyang as CCP general secretary after Zhao was ousted for his support for the student movement. As the involvement of the \"Eight Elders\" in Chinese politics steadily declined, Jiang consolidated his hold on power to become the \"paramount leader\" in the country during the 1990s. Urged by Deng Xiaoping's southern tour in 1992, Jiang officially introduced the term \"socialist market economy\" in his speech during the 14th CCP National Congress held later that year, which accelerated \"opening up and reform\".\n\nUnder Jiang's leadership, China experienced substantial economic growth with the continuation of market reforms. The returning of Hong Kong from the United Kingdom in 1997 and of Macau from Portugal in 1999, and entry into the World Trade Organisation in 2001, were landmark moments of his era. China also witnessed improved relations with the outside world, while the Communist Party maintained its tight control over the state. Jiang faced criticism over human rights abuses, including the crackdown on the Falun Gong movement. His contributions to party doctrine, known as the \"Three Represents\", were written into the CCP constitution in 2002. Jiang gradually vacated his official leadership titles from 2002 to 2005, being succeeded in these roles by Hu Jintao, although he and his political faction continued to influence affairs until much later. On 30 November 2022, Jiang died from leukemia and multiple organ failure in Shanghai.\n\nInstruction:\n\nOf which generation is Jiang the core leader of China\n\nAnswer:\n\nHe is the third generation of Chinese leadership\n\n",
    "Instruction:\n\nHow many awards did the film The Walrus and the Whistleblower win per this entry of information?Context:\n\nThe Walrus and the Whistleblower is a 2020 Canadian documentary film directed by Nathalie Bibeau. The film profiles Phil Demers, a former employee of Marineland who attempted to blow the whistle on allegedly inhumane treatment of animals at the institution.\n\nAccording to a film industry newsletter, the film was made \"in association with the Documentary Channel, and CBC Docs\". The Documentary Channel's announcement about the film stated that Demers had \"appeared four times on the Joe Rogan show, has testified before the Canadian Senate, and is being sued for $1.5 million for plotting to steal Smooshi, the walrus\".\n\nThe film premiered as part of the 2020 Hot Docs Canadian International Documentary Festival. Due to the COVID-19 pandemic in Canada it was not screened theatrically, but premiered as part of the festival's online streaming component and aired on CBC Television on May 28 as part of the network's special Hot Docs at Home series of films from the festival.\n\nIn June 2020, the film was named as the winner of 2020 Rogers Audience Award, alongside the films 9/11 Kids, There's No Place Like This Place, Anyplace, First We Eat and The Forbidden Reel, and as Overall Favourite at Hot Docs. The Audience Award allowed the film to be fast tracked in the Academy Award for Best Documentary Feature category, \"provided it meets all other criteria for eligibility\". Northern Banner, a division of Raven Banner Entertainment, subsequently announced that it had acquired the rights to distribute the film in Canada, probably starting before year end. The US and international distribution rights went to Gravitas Ventures.\n\nThe film received a nomination for the Donald Brittain Award at the 9th Canadian Screen Awards in 2021.\n\nAnswer:\n\n2.  the 2020 Rogers Audience Award, and the Donald Brittain Award in 2021.\n\n"
]