[
    "Instruction:\n\nWhen did Porsche stop producing air-cooled engines in the 911?Answer:\n\nPorsche stopped producing air-cooled engines in the 911 in 1998 with the 996 series.\n\n",
    "Instruction:\n\nGiven this reference text about the Flex Computer System, why was it created?Answer:\n\nIt was designed for the safe and efficient implementation of strongly typed procedures.\n\n",
    "Instruction:\n\nGiven these paragraphs about Asperger Multiomics, what is the goal in combining all the \"omes\"?Answer:\n\nBy combining these \"omes\", scientists can analyze complex biological big data to find novel associations between biological entities, pinpoint relevant biomarkers and build elaborate markers of disease and physiology. In doing so, multiomics integrates diverse omics data to find a coherently matching geno-pheno-envirotype relationship or association.\n\n",
    "Instruction:\n\nIs the glass ceiling real?Answer:\n\nWhile it is not real as a physical object, it is considered real metaphorically, as it represents an invisible barrier that hinder women from rising beyond a certain organizational or societal hierarchy.\n\n",
    "Instruction:\n\nGiven a reference about the creation of the UFC, tell me the member of the Gracie family  who co-created the UFC and the city they hosted the first UFC event.Answer:\n\nRorion Gracie is the co-creator. The first event was held in Denver. Colorado.\n\n",
    "Instruction:\n\nBased on this paragraph, what is the diameter of a 10 F Foley catheter in mm?Answer:\n\nAccording to this paragraph, the diameter of a 1 F catheter is 1/77mm so the diameter of a 10 F catheter is 10/77mm.\n\n",
    "Instruction:\n\nWho founded the city of Price, Quebec?Answer:\n\nThe Price Brothers and Company\n\n",
    "Instruction:\n\nGiven this reference text about Jimmy John's, how many Jimmy John's locations are there?Answer:\n\nThere are currently 2700 locations in the Jimmy John's franchise.\n\n",
    "Instruction:\n\nWho is the Avatar? And what was he trying to accomplish?Answer:\n\nIn the show Avatar: The Last Airbender, Aang was the current Avatar and the last survivor of his nation, the Air Nomads. He and his friends Katara, Sokka, and Toph, strived to end the Fire Nation's war against the other nations and defeat Fire Lord Ozai before he conquered the world.\n\n",
    "Instruction:\n\nGiven this paragraph about David Bowie, in which decade might you describe his music as having peaked?Answer:\n\n1970s\n\n",
    "Instruction:\n\nWhat was Goff's best game mentioned in the text?Answer:\n\nGoff's best game mentioned in the text was on October 2 when he threw four touchdowns passes, and added a tenure-high 378 passing yards during a 48–45 loss to the Seattle Seahawks.\n\nGoff played another good game against the Washington Commanders, when he threw for 256 yards and four touchdowns in a 36–27 victory, but this performance wasn't as good as the game against the Seahawks because he threw for fewer yards even though he threw for the same amount of touchdowns.\n\nNote that the text is also missing information that would be useful in judging Goff's performance such as QBR, completion percentage, etc.\n\n",
    "Instruction:\n\nGiven this paragraph about the grand Ethiopian renaissance dam, what is the expected power generation on the latest design.Answer:\n\nThe new design developed in 2017 has a planned power generation of 16,153 GWh/year using 16  hydropower generating units.\n\n",
    "Instruction:\n\nWhat was Dick Lammi's most famous work?Answer:\n\nDick Lammi was most famous for his work as a member of Lu Watters's band, the Yerba Buena Jazz Band.\n\n",
    "Instruction:\n\nHow important is pilot communication with a non-towered controlled airport?Answer:\n\nPiloting into a non-towered airport in my experience can be more challenging than towered airports.  What makes it challenging is that you are not speaking to anyone in charge of the airspace.  You are broadcasting to an open communications channel and hope all the other pilots “play” by the rules.  The first best practice is to have a basic understanding of the airport, how many runways, what direction do they run, direction of the traffic pattern and traffic pattern altitude etc.?   Practice consistency as this will aid in your decision making process.  As you approach the airport you must also check the weather via AWOS or ASOS to determine the wind direction, speed and altimeter setting.  The next step is to tune into airport UNICOM to listen to other traffic in the area, note the departures and arrivals and also note other planes in the traffic pattern.  The next step is to identify yourself via the airport UNICOM channel, provide your distance to the airport and your direction from the airport.   Your approach direction will most likely determine how and where you will join the traffic pattern.  Most importantly, keep listening to the airport UNICOM and actively look for any other planes either in the traffic pattern or in the vicinity.  There are a minimum of 4 traffic pattern legs - crosswind, downwind, base and final.  Your job as a pilot is to communicate as you enter each pattern leg. It is also beneficial to communicate your intentions whether you are executing a full stop landing or a touch-n-go.  If you are doing a full-stop landing be sure to communicate when you are clear of the given runway.\n\n",
    "Instruction:\n\nGiven a reference text about Megan Reid, American professional soccer player, what college did she attend and how many soccer games did she start in her senior year of college?Answer:\n\nReid attended the University of Virginia and during her senior year she started all 21 games.\n\n",
    "Instruction:\n\nWhat is a herbivore?Answer:\n\nA herbivore is an animal anatomically and physiologically adapted to eating plant material, for example foliage or marine algae, for the main component of its diet.\n\n",
    "Instruction:\n\nGiven this paragraph about Michel Warschawski, tell me the two organizations that Warschawski led during his life.Answer:\n\nMichel Warschawski, an anti-Zionist activist, led the Marxist Revolutionary Communist League and later the Alternative Information Center.\n\n",
    "Instruction:\n\nWho is the first astronaut to get into space in China?Answer:\n\nYang Liwei, who reached space in 2003 onboard the Shenzhou 5 space ship, is the first astronaut in China to reach space.\n\n",
    "Instruction:\n\nWhich era of counterculture were the Beatles pivotal to?Answer:\n\nThe Beatles were integral to the development of 1960s counterculture\n\n",
    "Instruction:\n\nWhy do eucalyptus trees have such an excellent aroma?  Is there any other uses for Eucalyptus?Answer:\n\nThe oil from Eucalyptus trees provides several benefits with the most prevalent being the pleasant aroma.  As a tree that grows fast and has been used strategically to reduce the risk of malaria by draining swamps a little Eucalyptus goes a long way.  The oil produced by these trees are also useful in an antimicrobial activity and in some cases has been known to make the trees more flammable.  Outside of their native Australia they have been viewed as an invasive species.\n\n",
    "Instruction:\n\nWhere is Ecsenius tessera commonly found?Answer:\n\nEcsenius tessera is commonly found in coral reefs in the western Pacific ocean, close to Vanuatu.\n\n",
    "Instruction:\n\nHow many times did Gordie Howe retire?Answer:\n\nBased on the provided information, Howe retired two times.\n\nHowe retired for the first time in 1971, but then later joined his sons Mark and Marty on the Houston Aeros of the WHA. Howe would then return to the NHL in 1979 where he played one season before retiring for a second time.\n\n",
    "Instruction:\n\nWhich nation started the Arab Spring and what caused it?Answer:\n\nThe Arab Spring began in Tunisia in response to corruption and economic stagnation. From Tunisia, the protests then spread to five other countries: Libya, Egypt, Yemen, Syria and Bahrain.\n\n",
    "Instruction:\n\nMalibamat'so RiverAnswer:\n\nMalibamat'so River is a river in northern Lesotho. Its origin is near to the South African border, where it drains the eastern slopes of the Maloti Range. It flows southwards past the village of Lejone, and eventually joins the Senqu River 5 kilometres (3.1 mi) northeast of Mohlanapeng.\n\nThe Malibamat'so forms the northern arm of the Katse Dam reservoir, a part of the Lesotho Highlands Water Project. Katse is Africa's highest elevation dam at 1,993 metres (6,539 ft) above sea level. Here the river is joined by the Bokong/Bokung River.\n\n",
    "Instruction:\n\nGiven a reference text about the blood hammer phenomenon, tell me the background of the term \"blood-hammer\".Answer:\n\nThe term \"blood-hammer\" was introduced by analogy with the hydraulic expression \"water hammer\" that was already used in vascular physiology.\n\n"
]