[
    "Instruction:\n\nGiven this paragraph about triathlon, who founded ironmanContext:\n\nOn Wednesday, September 25, 1974, the race started. It began with a run of a 4.8 km (3 mi) loop, followed by biking twice around Fiesta Island for a total of 8.0 km (5 mi). Entrants would then get off the bikes, take their shoes off and run into the water to swim to the mainland. That was followed by running in bare feet, then swimming again along the bay, then one last swim up to the entrance of Fiesta Island, and a final crawl up a steep dirt bank to finish. Most participants were not skilled swimmers, so Johnstone recruited his 13-year-old son to float on his surfboard and act as lifeguard. Some participants took longer than expected, and it began to get dark as they finished their swims. Shanahan recalls they pulled up a few cars and turned on the headlights so the athletes could see. Johnstone and Shanahan were surprised by the large number of entrants (46), mainly coming from local running clubs. Two notable entrants, Judy and John Collins, would four years later found the event which brought international attention to the new sport: the Hawaii Ironman\n\nAnswer:\n\nIronman was founded by Judy and John Collins four years after the first known modern day triathlon on Wednesday, September 25th, 1974.\n\n",
    "Instruction:\n\nGiven a reference text about the rock band Pink Floy: What was the name of Pink Floyd's last album and when was it released?Context:\n\nPink Floyd are an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.\n\nPink Floyd were founded in 1965 by Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), and Richard Wright (keyboards, vocals). Under Barrett's leadership, they released two charting singles and the successful debut album The Piper at the Gates of Dawn (1967). The guitarist and vocalist David Gilmour joined in January 1968; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind Pink Floyd's most successful albums, The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977) and The Wall (1979). The musical film based on The Wall, Pink Floyd – The Wall (1982), won two BAFTA Awards. Pink Floyd also composed several film scores.\n\nFollowing personal tensions, Wright left Pink Floyd in 1981, followed by Waters in 1985. Gilmour and Mason continued as Pink Floyd, rejoined later by Wright. They produced the albums A Momentary Lapse of Reason (1987) and The Division Bell (1994), backed by major tours, before entering a long hiatus. In 2005, all but Barrett reunited for a performance at the global awareness event Live 8. Barrett died in 2006, and Wright in 2008. The last Pink Floyd studio album, The Endless River (2014), was based on unreleased material from the Division Bell recording sessions. In 2022, Gilmour and Mason reformed Pink Floyd to release the song \"Hey, Hey, Rise Up!\" in protest of the Russo-Ukrainian War.\n\nBy 2013, Pink Floyd had sold more than 250 million records worldwide, making them one of the best-selling music artists of all time. The Dark Side of the Moon and The Wall were inducted into the Grammy Hall of Fame, and these albums and Wish You Were Here are among the best-selling albums of all time. Four Pink Floyd albums topped the US Billboard 200, and five topped the UK Albums Chart. Pink Floyd's hit singles include \"See Emily Play\" (1967), \"Money\" (1973), \"Another Brick in the Wall, Part 2\" (1979), \"Not Now John\" (1983), \"On the Turning Away\" (1987) and \"High Hopes\" (1994). They were inducted into the US Rock and Roll Hall of Fame in 1996 and the UK Music Hall of Fame in 2005. In 2008, Pink Floyd were awarded the Polar Music Prize in Sweden for their contribution to modern music.\n\nAnswer:\n\nThe last album of Pink Floyd was called \"The Endless River\" and was released in 2014.\n\n",
    "Instruction:\n\nGiven these paragraphs about the Tesla bot, where and when was it announced?Context:\n\nOptimus, also known as Tesla Bot, is a conceptual general-purpose robotic humanoid under development by Tesla, Inc. It was announced at the company's Artificial Intelligence (AI) Day event on August 19, 2021. CEO Elon Musk claimed during the event that Tesla would likely build a prototype by 2022. Musk is on record having said that he thinks Optimus \"has the potential to be more significant than the vehicle business over time.\"\n\nTesla Bot is planned to measure 5 ft 8 in (173 cm) tall and weigh 125 lb (57 kg). According to the presentation made during the first AI Day event, a Tesla Bot will be \"controlled by the same AI system Tesla is developing for the advanced driver-assistance system used in its cars\" and have a carrying capacity of 45 lb (20 kg). Proposed tasks for the product are ones that are \"dangerous, repetitive and boring\", such as providing manufacturing assistance.\n\nhttps://en.wikipedia.org/wiki/Optimus_(robot)\n\nAnswer:\n\nIt was announced at the company's Artificial Intelligence (AI) Day event on August 19, 2021.\n\n",
    "Context:\n\nStansfeld began his career as a civil servant in HM Customs and Excise. In 1877, he moved to Oxford, and later matriculated as a student at Exeter College, where he studied Medicine, attaining his BA in 1889, MA in 1893 and qualified as a doctor in 1897. In 1897 he started the Oxford Medical Misson in Bermondsey, London, where he founded the Stansfeld Oxford & Bermondsey Club in the same year. In 1909, he decided to take Holy Orders and studied part-time at Wycliffe Hall, Oxford. He was appointed Vicar of St Anne's Church, Thoburn Square, Bermondsey in 1910, and then returned to Oxford in 1912 as Rector of St Ebbe's, Oxford then a slum district until his retirement in 1926. Stansfeld died at Spelsbury, Oxfordshire, aged 85 in December 1939. He campaigned successfully for the erection of a children's playground and public baths in St Ebbe's. His philanthropy is commemorated by a blue plaque in Paradise Square, unveiled in June 2009.\n\nInstruction:\n\nWhen was the Stansfeld's death\n\nAnswer:\n\nStansfeld died at Spelsbury, Oxfordshire, aged 85 in December 1939\n\n",
    "Instruction:\n\nWhat is Sinking Sand?Context:\n\nQuicksand, also known as sinking sand, is a colloid consisting of fine granular material (such as sand, silt or clay) and water. It forms in saturated loose sand when the sand is suddenly agitated. When water in the sand cannot escape, it creates a liquefied soil that loses strength and cannot support weight. Quicksand can form in standing water or in upward flowing water (as from an artesian spring). In the case of upward flowing water, forces oppose the force of gravity and suspend the soil particles.\n\nAnswer:\n\nSinking Sand is most commonly known as Quicksand.\n\n",
    "Context:\n\nFurze Hill (or Furzehill) is a hamlet situated in the New Forest National Park of Hampshire, England. It is in the civil parish of Ellingham, Harbridge and Ibsley. Its nearest town is Fordingbridge, which lies approximately 3.1 miles (5.2 km) north-west from the hamlet.\n\nFurze Hill is a hamlet in the civil parish of Hyde. It is situated on low ground on either side of Huckles Brook on the South Gorley to Ogdens road. The houses are surrounded by fields and paddocks. Additional houses can be found at the southern edge of Gorley Common lining a narrow track to North Gorley.\n\nFurze Hill is the most recent settlement in the parish of Hyde, becoming an established community only in the 20th century.\n\nInstruction:\n\nWas Furze Hill an established community in the 19th century?\n\nAnswer:\n\nNo, it was not an established community until the 20th century.\n\n",
    "Context:\n\nScrub Daddy is a cleaning product company best known for an eponymous sponge it manufactures in the shape of a smiley face. The product is made of a polymer which changes texture – firm in cold water and soft in warm water. As of 2019, Scrub Daddy had the highest revenue of any product successfully pitched on the ABC reality show Shark Tank.\n\nHistory\nAfter damaging the exterior of a vehicle when cleaning the outside, detailer Aaron Krause invented a line of buffing and polishing pads. The company was acquired by 3M in August 2008. 3M did not purchase a line of sponges Krause had invented, leaving them to sit in his factory. Five years later, Krause used the remaining sponges to clean his dishes and lawn furniture. According to Krause, this is when he \"realized his multi-million dollar idea.\"\n\nAccording to the company's website, Scrub Daddy, Inc. was founded in 2012 with grassroots marketing. On the Shark Tank episode originally airing in October 2012, Lori Greiner made a 20% equity stake deal with Krause for $200,000. The following day, Greiner and Krause sold out of 42,000 sponges in under seven minutes on QVC. Greiner then helped Scrub Daddy to be sold in retail stores such as Bed, Bath & Beyond. In January 2017, Scrub Daddy's total revenues surpassed $100 million – the highest of any Shark Tank product. As of October 2019, the company's lifetime sales were $209 million. In Season 14 Episode 13, it was reported that Scrub Daddy in 10 years has 273 employees, 160 products, sold in 257,000 retail locations, top 5 grossing company in shark tank history, doing over $670m in retail sales since launch.\n\nInstruction:\n\nGiven a reference text about Scrub Daddy, tell me the details on the deal the founder made on Shark Tank.\n\nAnswer:\n\nAaron Krause, the founder of Scrub Daddy, made a deal with Lori Greiner on Shark Tank, giving her 20% equity in the company for $200,000.\n\n",
    "Instruction:\n\nGiven these paragraphs about Large language models, when did LLMs emerge?Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nAnswer:\n\nAround 2018.\n\n",
    "Context:\n\nCyberpunk 2077 is a 2020 action role-playing video game developed by CD Projekt Red and published by CD Projekt. Set in Night City, an open world set in the Cyberpunk universe, players assume the role of a customisable mercenary known as V, who can acquire skills in hacking and machinery with options for melee and ranged combat. The main story follows V's struggle as they deal with a mysterious cybernetic implant that threatens to overwrite their body with the personality and memories of a deceased celebrity only perceived by V; the two must work together to be separated and save V's life.\n\nInstruction:\n\nWho is the protagonist in CyberPunk 2077?\n\nAnswer:\n\nThe main story revolves around the protagonist V, as they deal with a mysterious cybernetic implant that threatens to overwrite their body with another person's memories.\n\n",
    "Context:\n\nAfter Jimmy John Liautaud graduated second to last in his class at Elgin Academy in 1982, his father gave him a choice to either join the Army or start a business. Although his father wanted him to enlist, the younger Liautaud chose the latter, and his father agreed to loan him $25,000 in exchange for a 48% stake in the business. Initially Jimmy John wanted to open a hot dog stand, but after visiting numerous such stands throughout the summer of 1982, he realized the $25,000 would not be enough for such a venture. After a chance encounter at a sandwich shop, Jimmy John realized that he could open a sandwich shop within his available budget by purchasing premium meats at a neighborhood market and baking his own bread. With the help of his family as tasters, he decided to put four sandwiches on his original menu. Paying $200 a month in rent, Liautaud could only afford used equipment consisting of a refrigerator, a chest freezer, an oven, and a meat slicer.\n\nOn January 13, 1983, Jimmy John's Gourmet Sandwiches opened in Charleston, Illinois. Due to the poor location of his first store, Liautaud decided to include delivery of his sandwiches to boost sales. He began by bringing samples door-to-door to the dorms of nearby Eastern Illinois University, which he had attended for one semester.\n\nInstruction:\n\nGiven this reference text about Jimmy John's, where was the original Jimmy John's located?\n\nAnswer:\n\nThe original Jimmy John's was located in Charleston, Illinois.\n\n",
    "Instruction:\n\nBased on the provided text, In what year did the National Gallery of Ireland open its doors to the public and what kind of art is it known for?Context:\n\nThe National Gallery of Ireland (Irish: Gailearaí Náisiúnta na hÉireann) houses the national collection of Irish and European art. It is located in the centre of Dublin with one entrance on Merrion Square, beside Leinster House, and another on Clare Street. It was founded in 1854 and opened its doors ten years later. The gallery has an extensive, representative collection of Irish paintings and is also notable for its Italian Baroque and Dutch masters painting. The current director is Caroline Campbell.\n\nAnswer:\n\nThe National Gallery of Ireland opened in 1864 and is known for its Irish, Italian Baroque, and Dutch masters paintings\n\n",
    "Instruction:\n\nDid the dome last as long as it was designed for?Context:\n\nAfter an ice storm in December 2015, the 13-year-old dome collapsed. It housed several events for indoor track athletes, including practices and meets, practice room for all winter sports teams, physical education classes, and various community events.\n\nThe dome was designed by Air Structures American Technologies Inc. and cost $3 million at the time of its construction in 2002. It was meant to last 15–20 years.\n\nAnswer:\n\nNo, it did not. The dome only lasted 13 years, but it was designed to last 15-20 years.\n\n",
    "Context:\n\nThey hold the highest number of FA Cup trophies, with 14. The club is one of only six clubs to have won the FA Cup twice in succession, in 2002 and 2003, and 2014 and 2015. Arsenal have achieved three League and FA Cup \"Doubles\" (in 1971, 1998 and 2002), a feat only previously achieved by Manchester United (in 1994, 1996 and 1999). They were the first side in English football to complete the FA Cup and League Cup double, in 1993. Arsenal were also the first London club to reach the final of the UEFA Champions League, in 2006, losing the final 2–1 to Barcelona.\n\nInstruction:\n\nWhich English football club has won the most FA Cup trophies?\n\nAnswer:\n\nArsenal - 14\n\n",
    "Context:\n\nCasting took place virtually through Zoom due to the COVID-19 pandemic. Casting director Victoria Thomas wanted to honor the game without being limited by it. Mazin and Thomas sought high-profile guest stars; Thomas said many of the actors \"don't usually do one-episode guest spots\". On February 10, 2021, Pascal and Ramsey were cast as Joel and Ellie. Earlier that day, it was reported Mahershala Ali was offered the role of Joel after Matthew McConaughey turned it down; The Hollywood Reporter noted Ali \"did circle a role\" in the show, but a deal was never formed. Any actresses considered for Ellie for the canceled film adaptation—such as Maisie Williams and Kaitlyn Dever—had aged out of consideration by the time the series was in production, resulting in a reset of candidates. The producers primarily sought actors who could embody Joel and Ellie individually as well as imitate their relationship.: 14:42  Though both were previously featured on HBO's Game of Thrones, Pascal and Ramsey had not met before the filming of The Last of Us began but found they had instant chemistry, which developed over the course of production.\n\nInstruction:\n\nGiven this paragraph about the Last of Us TV Series, who was not cast in the show?\n\nAnswer:\n\nMatthew McConaughey turned down the role of Joel which was also reportedly offered to and turned down by Mahershala Ali afterwards. Maisie Williams and Kaitlyn Dever were considered for the role of Ellie but aged out of consideration by the time of production.\n\n",
    "Instruction:\n\nWhat kind of grand prix is the 1932 Australian Grand PrixContext:\n\nThe 1932 Australian Grand Prix was a motor race held at the Phillip Island circuit in Victoria, Australia on 14 March 1932. It was the fifth Australian Grand Prix and the fifth to be held at Phillip Island.\n\nThe race was organized by the Light Car Club of Australia, formerly known as the Victorian Light Car Club, and was limited to cars having an engine with a piston displacement of 2000cc or less. It was the first Australian Grand Prix to be decided on a straight handicap basis, with the winner being the first car to complete the 31 laps. The two \"scratch\" competitors had to concede starts ranging up to 29 minutes, equating to an advantage of four laps. The previous practice of cars contesting four classes was discontinued. Weather conditions were reported to be \"ideal\".\n\nThe race, in which there were 18 starters, was won by Bill Thompson driving a Bugatti. Thompson was also awarded the Herald Trophy for recording the fastest time of the race.\n\nAnswer:\n\nThe 1932 Australian Grand Prix was a motor race held at the Phillip Island circuit in Victoria, Australia on 14 March 1932. It was the fifth Australian Grand Prix and the fifth to be held at Phillip Island.\n\nThe race was organized by the Light Car Club of Australia, formerly known as the Victorian Light Car Club, and was limited to cars having an engine with a piston displacement of 2000cc or less. It was the first Australian Grand Prix to be decided on a straight handicap basis, with the winner being the first car to complete the 31 laps. The two \"scratch\" competitors had to concede starts ranging up to 29 minutes, equating to an advantage of four laps. The previous practice of cars contesting four classes was discontinued. Weather conditions were reported to be \"ideal\".\n\nThe race, in which there were 18 starters, was won by Bill Thompson driving a Bugatti. Thompson was also awarded the Herald Trophy for recording the fastest time of the race.\n\n",
    "Instruction:\n\nWas Furze Hill an established community in the 19th century?Context:\n\nFurze Hill (or Furzehill) is a hamlet situated in the New Forest National Park of Hampshire, England. It is in the civil parish of Ellingham, Harbridge and Ibsley. Its nearest town is Fordingbridge, which lies approximately 3.1 miles (5.2 km) north-west from the hamlet.\n\nFurze Hill is a hamlet in the civil parish of Hyde. It is situated on low ground on either side of Huckles Brook on the South Gorley to Ogdens road. The houses are surrounded by fields and paddocks. Additional houses can be found at the southern edge of Gorley Common lining a narrow track to North Gorley.\n\nFurze Hill is the most recent settlement in the parish of Hyde, becoming an established community only in the 20th century.\n\nAnswer:\n\nNo, it was not an established community until the 20th century.\n\n",
    "Instruction:\n\nWhen was the Stansfeld's deathContext:\n\nStansfeld began his career as a civil servant in HM Customs and Excise. In 1877, he moved to Oxford, and later matriculated as a student at Exeter College, where he studied Medicine, attaining his BA in 1889, MA in 1893 and qualified as a doctor in 1897. In 1897 he started the Oxford Medical Misson in Bermondsey, London, where he founded the Stansfeld Oxford & Bermondsey Club in the same year. In 1909, he decided to take Holy Orders and studied part-time at Wycliffe Hall, Oxford. He was appointed Vicar of St Anne's Church, Thoburn Square, Bermondsey in 1910, and then returned to Oxford in 1912 as Rector of St Ebbe's, Oxford then a slum district until his retirement in 1926. Stansfeld died at Spelsbury, Oxfordshire, aged 85 in December 1939. He campaigned successfully for the erection of a children's playground and public baths in St Ebbe's. His philanthropy is commemorated by a blue plaque in Paradise Square, unveiled in June 2009.\n\nAnswer:\n\nStansfeld died at Spelsbury, Oxfordshire, aged 85 in December 1939\n\n",
    "Instruction:\n\nGiven the following paragraph, where did House music originate?Context:\n\nHouse is a music genre characterized by a repetitive four-on-the-floor beat and a typical tempo of 120 beats per minute. It was created by DJs and music producers from Chicago's underground club culture in the early/mid 1980s, as DJs began altering disco songs to give them a more mechanical beat.\n\nHouse was pioneered by African American DJs and producers in Chicago such as Frankie Knuckles, Ron Hardy, Jesse Saunders, Chip E., Joe Smooth, Steve \"Silk\" Hurley, Farley \"Jackmaster\" Funk, Marshall Jefferson, Phuture, and others. House music expanded to other cities such as London, then New York City and became a worldwide phenomenon.\n\nAnswer:\n\nHouse music originated in Chicago, Illinois in the United States of America by producers/DJs such as Frankie Knuckles, Ron Hardy, and Jesse Saunders.\n\n",
    "Context:\n\nGandhi had dropped out of the cheapest college he could afford in Bombay. Mavji Dave Joshiji, a Brahmin priest and family friend, advised Gandhi and his family that he should consider law studies in London. In July 1888, his wife Kasturba gave birth to their first surviving son, Harilal. His mother was not comfortable about Gandhi leaving his wife and family, and going so far from home. Gandhi's uncle Tulsidas also tried to dissuade his nephew. Gandhi wanted to go. To persuade his wife and mother, Gandhi made a vow in front of his mother that he would abstain from meat, alcohol and women. Gandhi's brother Laxmidas, who was already a lawyer, cheered Gandhi's London studies plan and offered to support him. Putlibai gave Gandhi her permission and blessing.\n\nOn 10 August 1888, Gandhi aged 18, left Porbandar for Mumbai, then known as Bombay. Upon arrival, he stayed with the local Modh Bania community whose elders warned him that England would tempt him to compromise his religion, and eat and drink in Western ways. Despite Gandhi informing them of his promise to his mother and her blessings, he was excommunicated from his caste. Gandhi ignored this, and on 4 September, he sailed from Bombay to London, with his brother seeing him off. Gandhi attended University College, London, where he took classes in English literature with Henry Morley in 1888–1889.\n\nHe also enrolled at Inner Temple with the intention of becoming a barrister. His childhood shyness and self-withdrawal had continued through his teens. He retained these traits when he arrived in London, but joined a public speaking practice group and overcame his shyness sufficiently to practise law\n\nInstruction:\n\nGiven this paragraph about Mahatma Gandhi, can you tell me why did he go to London?\n\nAnswer:\n\nGandhi travelled to London in the late 1880s to study law. He first took English literature classes and then enrolled in Inner Temple with the intention to become a barrister.\n\n",
    "Instruction:\n\nGiven this reference about the Battle of Okinawa during WW2, what was the difference in between the US (77th Infantry Division) and the Japanese casualties and wounded?Context:\n\nThe land battle took place over about 81 days beginning on 1 April 1945. The first Americans ashore were soldiers of the 77th Infantry Division who landed in the Kerama Islands, 15 mi (24 km) west of Okinawa on 26 March. Subsidiary landings followed, and the Kerama group was secured over the next five days. In these preliminary operations, the 77th Infantry Division suffered 27 dead and 81 wounded, while the Japanese dead and captured numbered over 650. The operation provided a protected anchorage for the fleet and eliminated the threat from suicide boats.\n\nAnswer:\n\nThe difference was about 542\n\n",
    "Instruction:\n\nGiven this paragraph about the Last of Us TV Series, who was not cast in the show?Context:\n\nCasting took place virtually through Zoom due to the COVID-19 pandemic. Casting director Victoria Thomas wanted to honor the game without being limited by it. Mazin and Thomas sought high-profile guest stars; Thomas said many of the actors \"don't usually do one-episode guest spots\". On February 10, 2021, Pascal and Ramsey were cast as Joel and Ellie. Earlier that day, it was reported Mahershala Ali was offered the role of Joel after Matthew McConaughey turned it down; The Hollywood Reporter noted Ali \"did circle a role\" in the show, but a deal was never formed. Any actresses considered for Ellie for the canceled film adaptation—such as Maisie Williams and Kaitlyn Dever—had aged out of consideration by the time the series was in production, resulting in a reset of candidates. The producers primarily sought actors who could embody Joel and Ellie individually as well as imitate their relationship.: 14:42  Though both were previously featured on HBO's Game of Thrones, Pascal and Ramsey had not met before the filming of The Last of Us began but found they had instant chemistry, which developed over the course of production.\n\nAnswer:\n\nMatthew McConaughey turned down the role of Joel which was also reportedly offered to and turned down by Mahershala Ali afterwards. Maisie Williams and Kaitlyn Dever were considered for the role of Ellie but aged out of consideration by the time of production.\n\n",
    "Instruction:\n\nwhat is snow skiingContext:\n\nSkiing is the use of skis to glide on snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski Federation (FIS).\n\nAnswer:\n\nskiing is a form of outdoor winter sport. Done in the mountains. You can ski on piste and off piste.\n\n",
    "Instruction:\n\nHow are racial categories used historically?Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nAnswer:\n\nHistorically, oppressive groups use racial categories to discriminate against other groups that are different from them.\n\n",
    "Instruction:\n\nWhat is TSA?Context:\n\nThe Transportation Security Administration (TSA) is an agency of the United States Department of Homeland Security (DHS) that has authority over the security of transportation systems within, and connecting to the United States. It was created as a response to the September 11 attacks to improve airport security procedures and consolidate air travel security under a dedicated federal administrative law enforcement agency.\n\nAnswer:\n\nTSA stands for Transportation Security Administration in the United States. It is the agency that is responsible for the security of transportation systems within United States. They are mainly responsible for airport security.\n\n",
    "Instruction:\n\nGiven this reference paragraph about the history of the 'five whys' technique, what was the original intention of asking the 'five whys'?Context:\n\nThe technique was originally developed by Sakichi Toyoda and was used within the Toyota Motor Corporation during the evolution of its manufacturing methodologies. It is a critical component of problem-solving training, delivered as part of the induction into the Toyota Production System. The architect of the Toyota Production System, Taiichi Ohno, described the five whys method as \"the basis of Toyota's scientific approach by repeating why five times the nature of the problem as well as its solution becomes clear.\" The tool has seen widespread use beyond Toyota, and is now used within Kaizen, lean manufacturing, lean construction and Six Sigma. The five whys were initially developed to understand why new product features or manufacturing techniques were needed, and was not developed for root cause analysis.\n\nAnswer:\n\nThe original intention of asking the 'five whys' was to understand why new product features or manufacturing techniques were needed in Toyota's manufacturing practices.\n\n",
    "Instruction:\n\nGiven this paragraph about Mahatma Gandhi, can you tell me why did he go to London?Context:\n\nGandhi had dropped out of the cheapest college he could afford in Bombay. Mavji Dave Joshiji, a Brahmin priest and family friend, advised Gandhi and his family that he should consider law studies in London. In July 1888, his wife Kasturba gave birth to their first surviving son, Harilal. His mother was not comfortable about Gandhi leaving his wife and family, and going so far from home. Gandhi's uncle Tulsidas also tried to dissuade his nephew. Gandhi wanted to go. To persuade his wife and mother, Gandhi made a vow in front of his mother that he would abstain from meat, alcohol and women. Gandhi's brother Laxmidas, who was already a lawyer, cheered Gandhi's London studies plan and offered to support him. Putlibai gave Gandhi her permission and blessing.\n\nOn 10 August 1888, Gandhi aged 18, left Porbandar for Mumbai, then known as Bombay. Upon arrival, he stayed with the local Modh Bania community whose elders warned him that England would tempt him to compromise his religion, and eat and drink in Western ways. Despite Gandhi informing them of his promise to his mother and her blessings, he was excommunicated from his caste. Gandhi ignored this, and on 4 September, he sailed from Bombay to London, with his brother seeing him off. Gandhi attended University College, London, where he took classes in English literature with Henry Morley in 1888–1889.\n\nHe also enrolled at Inner Temple with the intention of becoming a barrister. His childhood shyness and self-withdrawal had continued through his teens. He retained these traits when he arrived in London, but joined a public speaking practice group and overcame his shyness sufficiently to practise law\n\nAnswer:\n\nGandhi travelled to London in the late 1880s to study law. He first took English literature classes and then enrolled in Inner Temple with the intention to become a barrister.\n\n",
    "Context:\n\nPink Floyd are an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.\n\nPink Floyd were founded in 1965 by Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), and Richard Wright (keyboards, vocals). Under Barrett's leadership, they released two charting singles and the successful debut album The Piper at the Gates of Dawn (1967). The guitarist and vocalist David Gilmour joined in January 1968; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind Pink Floyd's most successful albums, The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977) and The Wall (1979). The musical film based on The Wall, Pink Floyd – The Wall (1982), won two BAFTA Awards. Pink Floyd also composed several film scores.\n\nFollowing personal tensions, Wright left Pink Floyd in 1981, followed by Waters in 1985. Gilmour and Mason continued as Pink Floyd, rejoined later by Wright. They produced the albums A Momentary Lapse of Reason (1987) and The Division Bell (1994), backed by major tours, before entering a long hiatus. In 2005, all but Barrett reunited for a performance at the global awareness event Live 8. Barrett died in 2006, and Wright in 2008. The last Pink Floyd studio album, The Endless River (2014), was based on unreleased material from the Division Bell recording sessions. In 2022, Gilmour and Mason reformed Pink Floyd to release the song \"Hey, Hey, Rise Up!\" in protest of the Russo-Ukrainian War.\n\nBy 2013, Pink Floyd had sold more than 250 million records worldwide, making them one of the best-selling music artists of all time. The Dark Side of the Moon and The Wall were inducted into the Grammy Hall of Fame, and these albums and Wish You Were Here are among the best-selling albums of all time. Four Pink Floyd albums topped the US Billboard 200, and five topped the UK Albums Chart. Pink Floyd's hit singles include \"See Emily Play\" (1967), \"Money\" (1973), \"Another Brick in the Wall, Part 2\" (1979), \"Not Now John\" (1983), \"On the Turning Away\" (1987) and \"High Hopes\" (1994). They were inducted into the US Rock and Roll Hall of Fame in 1996 and the UK Music Hall of Fame in 2005. In 2008, Pink Floyd were awarded the Polar Music Prize in Sweden for their contribution to modern music.\n\nInstruction:\n\nGiven a reference text about the rock band Pink Floy: What was the name of Pink Floyd's last album and when was it released?\n\nAnswer:\n\nThe last album of Pink Floyd was called \"The Endless River\" and was released in 2014.\n\n",
    "Instruction:\n\nWhat is apartheid, and which country experienced it?Context:\n\nPortugal's overseas presence in sub-Saharan Africa (most notably in Angola, Cape Verde, Mozambique, Guinea-Bissau, and São Tomé and Príncipe) lasted from the 16th century to 1975, after the Estado Novo regime was overthrown in a military coup in Lisbon. Rhodesia unilaterally declared independence from the United Kingdom in 1965, under the white minority government of Ian Smith, but was not internationally recognized as an independent state (as Zimbabwe) until 1980, when black nationalists gained power after a bitter guerrilla war. Although South Africa was one of the first African countries to gain independence, the state remained under the control of the country's white minority through a system of racial segregation known as apartheid until 1994.\n\nAnswer:\n\nApartheid is a system of racial segregation in South Africa.\n\n",
    "Context:\n\nKang Se-jung (born January 15, 1982) is a South Korean actress. She made her entertainment debut as a singer for the K-pop girl group Papaya in 2000; the group released two albums before disbanding in 2001. Kang began acting full-time in 2004, and has appeared in television series such as Assorted Gems (2009) and Heartless City (2013). Upon turning to acting, she used the stage name Go Na-eun before reverting to use of her birth name in 2017.\n\nInstruction:\n\nList the television series Kang Se-jung appeared in\n\nAnswer:\n\n- Assorted Gems\n- Heartless City\n\n",
    "Instruction:\n\nWhat was the The McIntosh County Seat WarContext:\n\nThe McIntosh County Seat War was a dispute in Oklahoma over the location of the McIntosh County seat that took place between 1907 and 1909. Following a pair of elections that resulted in the town of Checotah being designated as the new county seat, the people of Eufaula refused to hand over the county records. As a result, a group of heavily armed men from Chectotah attempted to seize the records, but were forced to surrender during the gunbattle that ensued. One year later, after another close election, Eufaula became the permanent county seat.\n\nAnswer:\n\nThe McIntosh County Seat War was a dispute in Oklahoma over the location of the McIntosh County seat that took place between 1907 and 1909. Following a pair of elections that resulted in the town of Checotah being designated as the new county seat, the people of Eufaula refused to hand over the county records. \n\nAs a result, a group of heavily armed men from Chectotah attempted to seize the records, but were forced to surrender during the gunbattle that ensued. One year later, after another close election, Eufaula became the permanent county seat.\n\n",
    "Context:\n\nThe Vietnam War (also known by other names) was a conflict in Vietnam, Laos, and Cambodia from 1 November 1955 to the fall of Saigon on 30 April 1975. It was the second of the Indochina Wars and was officially fought between North Vietnam and South Vietnam\n\nInstruction:\n\nWhen did the Vietnam War Start?\n\nAnswer:\n\nThe Vietnam War started on 1 November 1955\n\n",
    "Instruction:\n\nGiven a reference text about Stevan L. Davies, tell me where he went to college.Context:\n\nStevan L. Davies (born 1948) is an author and Emeritus Professor of Religious Studies at Misericordia University in Dallas, Pennsylvania. His most notable work has been in the analysis of Christian apocrypha, especially the Gospel of Thomas. He is married to Sally Watkins Davies and has two children, Michael L. Davies and Meredith G. Russell.[citation needed]\n\nDavies holds a bachelor's degree from Duke University and a doctorate in philosophy from Temple University.\n\nHe was Professor of Religious Studies at Misericordia University from 1979 to 2015.\n\nAnswer:\n\nStevan L. Davies went to college at Duke University for his bachelor's degree and Temple University for his doctorate in philosophy.\n\n",
    "Instruction:\n\nWhat is an adjacency list?Context:\n\nIn graph theory and computer science, an adjacency list is a collection of unordered lists used to represent a finite graph. Each unordered list within an adjacency list describes the set of neighbors of a particular vertex in the graph. This is one of several commonly used representations of graphs for use in computer programs.\n\nAnswer:\n\nIn graph theory and computer science, an adjacency list is a collection of unordered lists used to represent a finite graph.\n\n",
    "Context:\n\nThe Schauspielhaus Zürich (English: Zürich playhouse) is one of the most prominent and important[citation needed] theatres in the German-speaking world. It is also known as \"Pfauenbühne\" (Peacock Stage). The large theatre has 750 seats. The Schauspielhaus also operates three stages in the Schiffbau in the western part of Zürich, the Schiffbau/Halle (400 seats), the Schiffbau/Box (up to 200 seats) and the Schiffbau/Matchbox (80 seats).\n\nInstruction:\n\nGiven this paragraph, show me how to calculate how many total patrons can be served by all of the Schauspielhaus theaters?\n\nAnswer:\n\n1430 total patrons can be served. There are 750 seats in Schauspielhaus Zürich, 400 in the Schiffbau/Halle, 200 in the Schiffbau/Box and 80 in the Schiffbau/Matchbox. This totals to 750 + 400 + 200 + 80 = 1430 seats. Each patron requires one seat\n\n",
    "Context:\n\nThe 2000 World Series was the championship series of Major League Baseball's (MLB) 2000 season. The 96th edition of the World Series, it was a best-of-seven playoff between crosstown opponents, the two-time defending World Series champions and American League (AL) champion New York Yankees and the National League (NL) champion New York Mets. The Yankees defeated the Mets, four games to one, to win their third consecutive championship and 26th overall. The series was often referred to as the \"Subway Series\", referring to the longstanding matchup between New York baseball teams; it was the first World Series contested between two New York teams since the 1956 World Series and the first since the New York Giants and the Brooklyn Dodgers moved west to California (as the current San Francisco Giants and Los Angeles Dodgers, respectively) in 1958 and the subsequent formation of the Mets in 1962. This World Series that featured teams from the same city or state, was the first of its kind since 1989 between the Oakland Athletics and the San Francisco Giants. Yankees shortstop Derek Jeter was named the World Series Most Valuable Player.\n\nInstruction:\n\nWho won the 2000 World Series?\n\nAnswer:\n\nNew York Yankees defeated the NY Mets 4 games to 1\n\n",
    "Instruction:\n\nWhen did the Vietnam War Start?Context:\n\nThe Vietnam War (also known by other names) was a conflict in Vietnam, Laos, and Cambodia from 1 November 1955 to the fall of Saigon on 30 April 1975. It was the second of the Indochina Wars and was officially fought between North Vietnam and South Vietnam\n\nAnswer:\n\nThe Vietnam War started on 1 November 1955\n\n",
    "Instruction:\n\nBased on this passage about UCLA, tell me the difference between North Campus and South Campus and which residential areas border the campus.Context:\n\nThe new UCLA campus in 1929 had four buildings: Royce Hall and Haines Hall on the north, and Powell Library and Kinsey Hall (now called Renee And David Kaplan Hall) on the south. The Janss Steps were the original 87-step entrance to the university that lead to the quad of these four buildings. Today, the campus includes 163 buildings across 419 acres (1.7 km2) in the western part of Los Angeles, north of the Westwood shopping district and just south of Sunset Boulevard. In terms of acreage, it is the second-smallest of the ten UC campuses. The campus is approximately 1 mile east of I-405 (the San Diego Freeway).\n\nThe campus is in the residential area of Westwood and bordered by Bel-Air to the north, Beverly Hills to the east, and Brentwood to the west. The campus is informally divided into North Campus and South Campus, which are both on the eastern half of the university's land. North Campus is the original campus core; its buildings are more traditional in appearance and clad in imported Italian brick. North Campus is home to the arts, humanities, social sciences, law, history, and business programs and is centered around ficus and sycamore-lined Dickson Court, also known as the \"Sunken Garden\". South Campus is home to the physical sciences, life sciences, engineering, mathematical sciences, health-related fields, and the UCLA Medical Center. The campus includes sculpture gardens, fountains, museums, and a mix of architectural styles.\n\nAckerman Union, the John Wooden Center, the Arthur Ashe Health and Wellness Center, the Student Activities Center, Kerckhoff Hall, the J.D. Morgan Center, the James West Alumni Center, and Pauley Pavilion stand at the center of the campus, bordering Wilson Plaza. The campus is bisected by Bruin Walk, a heavily traveled pathway from the residential hill to the main campus. At the intersection of Bruin Walk and Westwood Plaza is Bruin Plaza, featuring an outdoor performing arts stage and a bronze statue of the Bruin bear.\n\nDuring the 2028 Summer Olympics, wrestling and judo will be held at Pauley Pavilion. The campus will also be the location of the Olympic Village for the Olympic and Paralympic Games.\n\nIn September 2022 UCLA purchased the Palos Verdes (PV) campus of Marymount California University, which had closed its doors that August, after fifty years of classes; the PV campus joins two other locations, in downtown LA, and in Culver City as satellites of the Westwood campus. A faculty and administration task force will review possible applications of the PV campus for UCLA. The Channel Islands will again be visible from a UCLA campus.\n\nAnswer:\n\nAt UCLA, North Campus hosts the arts, humanities, social sciences, law, history, and business programs, while South Campus is home to the physical sciences, life sciences, engineering, mathematical sciences, health-related fields, and the UCLA Medical Center. The UCLA Campus is bordered by Bel Air, Brentwood, and Beverly Hills.\n\n",
    "Context:\n\nListeriosis is an infectious but not contagious disease caused by the bacterium Listeria monocytogenes, far more common in domestics animals (domestic mammals and poultry), especially ruminants, than in human beings. It can also occur in feral animals—among others, game animals—as well as in poultry and other birds.\n\nThe causative bacterium lives in the soil and in poorly made silage, and is acquired by ingestion. It is not contagious; over the course of a 30-year observation period of sheep disease in Morocco, the disease only appeared in the late 2000s (decade) when feeding bag-ensiled corn became common.[better source needed] In Iceland, the disease is called \"silage sickness\".\n\nInstruction:\n\nGiven a reference text about Listeriosis, tell me how how the bacterium is transfered into animals, and people.\n\nAnswer:\n\nListeriosis is most often associated with animals but can also infect people and is primarily transferred by ingestion.\n\n",
    "Instruction:\n\nGiven this paragraph about cat's senses, what light level can domestic house cats see at in comparison to human sight?Context:\n\nCats have excellent night vision and can see at only one-sixth the light level required for human vision.: 43  This is partly the result of cat eyes having a tapetum lucidum, which reflects any light that passes through the retina back into the eye, thereby increasing the eye's sensitivity to dim light. Large pupils are an adaptation to dim light. The domestic cat has slit pupils, which allow it to focus bright light without chromatic aberration. At low light, a cat's pupils expand to cover most of the exposed surface of its eyes. The domestic cat has rather poor color vision and only two types of cone cells, optimized for sensitivity to blue and yellowish green; its ability to distinguish between red and green is limited. A response to middle wavelengths from a system other than the rod cells might be due to a third type of cone. This appears to be an adaptation to low light levels rather than representing true trichromatic vision. Cats also have a nictitating membrane, allowing them to blink without hindering their vision.\n\nAnswer:\n\nDomestic cats are able to see at one-sixth the light level required for human vision.\n\n",
    "Instruction:\n\nWhere did David Houseman go to college?Context:\n\nHousman received his BA in 1966 and MA in 1971 from Brandeis University. As one of the first postdocs in the lab of Harvey Lodish at MIT, Housman showed that all mammalian proteins begin with a methionine residue transferred from a specific met-initiator tRNA. Between 1973 and 1975 he taught at the University of Toronto and was on the staff of the Ontario Cancer Institute. He joined the MIT faculty in 1975. In his lab at MIT, he mentored Jim Gusella and Daniel Haber.\n\nAnswer:\n\nDavid Houseman received his BA and MA in 1966 from Brandeis University.\n\n",
    "Instruction:\n\nGiven this paragraph, show me how to calculate how many total patrons can be served by all of the Schauspielhaus theaters?Context:\n\nThe Schauspielhaus Zürich (English: Zürich playhouse) is one of the most prominent and important[citation needed] theatres in the German-speaking world. It is also known as \"Pfauenbühne\" (Peacock Stage). The large theatre has 750 seats. The Schauspielhaus also operates three stages in the Schiffbau in the western part of Zürich, the Schiffbau/Halle (400 seats), the Schiffbau/Box (up to 200 seats) and the Schiffbau/Matchbox (80 seats).\n\nAnswer:\n\n1430 total patrons can be served. There are 750 seats in Schauspielhaus Zürich, 400 in the Schiffbau/Halle, 200 in the Schiffbau/Box and 80 in the Schiffbau/Matchbox. This totals to 750 + 400 + 200 + 80 = 1430 seats. Each patron requires one seat\n\n",
    "Context:\n\nStevan L. Davies (born 1948) is an author and Emeritus Professor of Religious Studies at Misericordia University in Dallas, Pennsylvania. His most notable work has been in the analysis of Christian apocrypha, especially the Gospel of Thomas. He is married to Sally Watkins Davies and has two children, Michael L. Davies and Meredith G. Russell.[citation needed]\n\nDavies holds a bachelor's degree from Duke University and a doctorate in philosophy from Temple University.\n\nHe was Professor of Religious Studies at Misericordia University from 1979 to 2015.\n\nInstruction:\n\nGiven a reference text about Stevan L. Davies, tell me where he went to college.\n\nAnswer:\n\nStevan L. Davies went to college at Duke University for his bachelor's degree and Temple University for his doctorate in philosophy.\n\n",
    "Instruction:\n\nGiven a reference text about True Corporation Public Company Limited, tell me what country it's in and how it was formed.Context:\n\nTrue Corporation Public Company Limited (TRUE) (Formerly: True Corporation Public Company Limited and Total Access Communication Public Company Limited) is a communications conglomerate in Thailand. It is a joint venture between Charoen Pokphand Group and Telenor, formed by the merger between the original True Corporation and DTAC in the form of equal partnership to create a new telecommunications company that can fully meet the needs of the digital age. True controls Thailand's largest cable TV provider, TrueVisions, Thailand's largest internet service provider True Online,[citation needed] Thailand's largest mobile operators, TrueMove H and DTAC TriNet, which is second and third only to AIS. and entertainment media including television, internet, online games, and mobile phones under the True Digital brand. As of August 2014, True, along with True Telecommunications Growth Infrastructure Fund, had a combined market capitalization of US$10 billion.[citation needed] TrueMove is also a partner of Vodafone Group. Charoen Pokphand Group and Telenor hold equal ownership of 30% of True's shares as of March 2023. It operates fixed-line (as a concessionaire of NT (formerly known as TOT)), wireless, cable TV, IPTV and broadband services.\n\nAnswer:\n\nTrue Corporation Public Company Limited is located in Thailand and was formed by the original True Corporation merging with DTAC.\n\n",
    "Context:\n\nPearl Mill Village Historic District is a national historic district located at Durham, Durham County, North Carolina. The district encompasses 26 contributing residential buildings built by owners of Pearl Cotton Mills. The mill village dwellings are either two-story duplex type built about 1905 or a one-story bungalow constructed about 1924.\n\nInstruction:\n\nGiven this paragraph about the Pearl Mill Village Historic District, tell me where it is located.\n\nAnswer:\n\nThe Pearl Mill Village Historic District is in Durham, North Carolina.\n\n",
    "Instruction:\n\nGiven this reference text, what are column stores used for?Context:\n\nA column-oriented DBMS or columnar DBMS is a database management system (DBMS) that stores data tables by column rather than by row. Benefits include more efficient access to data when only querying a subset of columns (by eliminating the need to read columns that are not relevant), and more options for data compression. However, they are typically less efficient for inserting new data.\n\nPractical use of a column store versus a row store differs little in the relational DBMS world. Both columnar and row databases can use traditional database query languages like SQL to load data and perform queries. Both row and columnar databases can become the backbone in a system to serve data for common extract, transform, load (ETL) and tools.\n\nAnswer:\n\nA column store database stores data as any other database management system. The data itself is stored sequentially to improve the performance of scans on a subset of individual columns.\n\n",
    "Context:\n\nThe McIntosh County Seat War was a dispute in Oklahoma over the location of the McIntosh County seat that took place between 1907 and 1909. Following a pair of elections that resulted in the town of Checotah being designated as the new county seat, the people of Eufaula refused to hand over the county records. As a result, a group of heavily armed men from Chectotah attempted to seize the records, but were forced to surrender during the gunbattle that ensued. One year later, after another close election, Eufaula became the permanent county seat.\n\nInstruction:\n\nWhat was the The McIntosh County Seat War\n\nAnswer:\n\nThe McIntosh County Seat War was a dispute in Oklahoma over the location of the McIntosh County seat that took place between 1907 and 1909. Following a pair of elections that resulted in the town of Checotah being designated as the new county seat, the people of Eufaula refused to hand over the county records. \n\nAs a result, a group of heavily armed men from Chectotah attempted to seize the records, but were forced to surrender during the gunbattle that ensued. One year later, after another close election, Eufaula became the permanent county seat.\n\n",
    "Context:\n\nThe Transportation Security Administration (TSA) is an agency of the United States Department of Homeland Security (DHS) that has authority over the security of transportation systems within, and connecting to the United States. It was created as a response to the September 11 attacks to improve airport security procedures and consolidate air travel security under a dedicated federal administrative law enforcement agency.\n\nInstruction:\n\nWhat is TSA?\n\nAnswer:\n\nTSA stands for Transportation Security Administration in the United States. It is the agency that is responsible for the security of transportation systems within United States. They are mainly responsible for airport security.\n\n",
    "Context:\n\nThe National Gallery of Ireland (Irish: Gailearaí Náisiúnta na hÉireann) houses the national collection of Irish and European art. It is located in the centre of Dublin with one entrance on Merrion Square, beside Leinster House, and another on Clare Street. It was founded in 1854 and opened its doors ten years later. The gallery has an extensive, representative collection of Irish paintings and is also notable for its Italian Baroque and Dutch masters painting. The current director is Caroline Campbell.\n\nInstruction:\n\nBased on the provided text, In what year did the National Gallery of Ireland open its doors to the public and what kind of art is it known for?\n\nAnswer:\n\nThe National Gallery of Ireland opened in 1864 and is known for its Irish, Italian Baroque, and Dutch masters paintings\n\n",
    "Context:\n\nOptimus, also known as Tesla Bot, is a conceptual general-purpose robotic humanoid under development by Tesla, Inc. It was announced at the company's Artificial Intelligence (AI) Day event on August 19, 2021. CEO Elon Musk claimed during the event that Tesla would likely build a prototype by 2022. Musk is on record having said that he thinks Optimus \"has the potential to be more significant than the vehicle business over time.\"\n\nTesla Bot is planned to measure 5 ft 8 in (173 cm) tall and weigh 125 lb (57 kg). According to the presentation made during the first AI Day event, a Tesla Bot will be \"controlled by the same AI system Tesla is developing for the advanced driver-assistance system used in its cars\" and have a carrying capacity of 45 lb (20 kg). Proposed tasks for the product are ones that are \"dangerous, repetitive and boring\", such as providing manufacturing assistance.\n\nhttps://en.wikipedia.org/wiki/Optimus_(robot)\n\nInstruction:\n\nGiven these paragraphs about the Tesla bot, where and when was it announced?\n\nAnswer:\n\nIt was announced at the company's Artificial Intelligence (AI) Day event on August 19, 2021.\n\n",
    "Context:\n\nJustice League Dark is a 2017 American adult animated science fantasy superhero film produced by Warner Bros. Animation and distributed by Warner Home Video. Featuring the DC Comics team of the same name created by Peter Milligan and Mikel Janín, the film is the 27th of the DC Universe Animated Original Movies and the eighth of the DC Animated Movie Universe. Unlike most installments in the DC Animated Universe Movies series, Justice League Dark features an original premise. The film stars Matt Ryan as John Constantine and Jason O'Mara as Batman, reprising their respective roles from previous media. It was released on Digital HD on January 24, 2017, and on DVD and Blu-ray on February 7.\n\nA sequel, Justice League Dark: Apokolips War, was released in May 2020.\n\nInstruction:\n\nGiven a reference text about Justice League Dark, tell me who the main actors are and what roles they played.\n\nAnswer:\n\nThe main actors in Justice League Dark were Matt Ryan and Jason O'Mara. In the film, Matt Ryan is John Constantine and Jason O'Mara is Batman.\n\n",
    "Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nInstruction:\n\nHow was art used for manipulative purpose in racial discuss in the 20th century?\n\nAnswer:\n\nIn the 19th to 20th century, Europeans commonly use artworks to portray prejudice towards Middle Eastern and Asian people.\n\n",
    "Instruction:\n\nAccording to this paragraph, what is UVA's overall ranking among national universities?Context:\n\nU.S. News & World Report ranks UVA tied for 25th among national universities overall, 3rd among public universities and tied for 110th among global universities in its 2022 report, 8th best business program and 3rd best business management program.\n\nAnswer:\n\nUVA tied for 25th among national universities.\n\n",
    "Context:\n\nA large language model (LLM) is a language model consisting of a neural network with many parameters (typically billions of weights or more), trained on large quantities of unlabelled text using self-supervised learning. LLMs emerged around 2018 and perform well at a wide variety of tasks. This has shifted the focus of natural language processing research away from the previous paradigm of training specialized supervised models for specific tasks.\n\nProperties\nThough the term large language model has no formal definition, it often refers to deep learning models having a parameter count on the order of billions or more. LLMs are general purpose models which excel at a wide range of tasks, as opposed to being trained for one specific task (such as sentiment analysis, named entity recognition, or mathematical reasoning). The skill with which they accomplish tasks, and the range of tasks at which they are capable, seems to be a function of the amount of resources (data, parameter-size, computing power) devoted to them, in a way that is not dependent on additional breakthroughs in design.\n\nThough trained on simple tasks along the lines of predicting the next word in a sentence, neural language models with sufficient training and parameter counts are found to capture much of the syntax and semantics of human language. In addition, large language models demonstrate considerable general knowledge about the world, and are able to \"memorize\" a great quantity of facts during training.\n\nHallucinations\nMain article: Hallucination (artificial intelligence)\nIn artificial intelligence in general, and in large language models in particular, a \"hallucination\" is a confident response that does not seem to be justified by the model's training data.\n\nEmergent abilities\n\nOn a number of natural language benchmarks involving tasks such as question answering, models perform no better than random chance until they reach a certain scale (in this case, measured by training computation), at which point their performance sharply increases. These are examples of emergent abilities.\nUnpredictable abilities that have been observed in large language models but that were not present in simpler models (and that were not explicitly designed into the model) are usually called \"emergent abilities\". Researchers note that such abilities \"cannot be predicted simply by extrapolating the performance of smaller models\". These abilities are discovered rather than programmed-in or designed, in some cases only after the LLM has been publicly deployed. Hundreds of emergent abilities have been described. Examples include multi-step arithmetic, taking college-level exams, identifying the intended meaning of a word, chain-of-thought prompting, decoding the International Phonetic Alphabet, unscrambling a word’s letters, identifying offensive content in paragraphs of Hinglish (a combination of Hindi and English), and generating a similar English equivalent of Kiswahili proverbs.\n\nArchitecture and training\nLarge language models have most commonly used the transformer architecture, which, since 2018, has become the standard deep learning technique for sequential data (previously, recurrent architectures such as the LSTM were most common). LLMs are trained in an unsupervised manner on unannotated text. A left-to-right transformer is trained to maximize the probability assigned to the next word in the training data, given the previous context. Alternatively, an LLM may use a bidirectional transformer (as in the example of BERT), which assigns a probability distribution over words given access to both preceding and following context. In addition to the task of predicting the next word or \"filling in the blanks\", LLMs may be trained on auxiliary tasks which test their understanding of the data distribution such as Next Sentence Prediction (NSP), in which pairs of sentences are presented and the model must predict whether they appear side-by-side in the training corpus.\n\nThe earliest LLMs were trained on corpora having on the order of billions of words. The first model in OpenAI's GPT series was trained in 2018 on BookCorpus, consisting of 985 million words. In the same year, BERT was trained on a combination of BookCorpus and English Wikipedia, totalling 3.3 billion words. In the years since then, training corpora for LLMs have increased by orders of magnitude, reaching up to hundreds of billions or trillions of tokens.\n\nLLMs are computationally expensive to train. A 2020 study estimated the cost of training a 1.5 billion parameter model (1-2 orders of magnitude smaller than the state of the art at the time) at $1.6 million.\n\nA 2020 analysis found that neural language models' capability (as measured by training loss) increased smoothly in a power law relationship with number of parameters, quantity of training data, and computation used for training. These relationships were tested over a wide range of values (up to seven orders of magnitude) and no attenuation of the relationship was observed at the highest end of the range (including for network sizes up to trillions of parameters).\n\nApplication to downstream tasks\nBetween 2018 and 2020, the standard method for harnessing an LLM for a specific natural language processing (NLP) task was to fine tune the model with additional task-specific training. It has subsequently been found that more powerful LLMs such as GPT-3 can solve tasks without additional training via \"prompting\" techniques, in which the problem to be solved is presented to the model as a text prompt, possibly with some textual examples of similar problems and their solutions.\n\nFine-tuning\nMain article: Fine-tuning (machine learning)\nFine-tuning is the practice of modifying an existing pretrained language model by training it (in a supervised fashion) on a specific task (e.g. sentiment analysis, named entity recognition, or part-of-speech tagging). It is a form of transfer learning. It generally involves the introduction of a new set of weights connecting the final layer of the language model to the output of the downstream task. The original weights of the language model may be \"frozen\", such that only the new layer of weights connecting them to the output are learned during training. Alternatively, the original weights may receive small updates (possibly with earlier layers frozen).\n\nPrompting\nSee also: Prompt engineering and Few-shot learning (natural language processing)\nIn the prompting paradigm, popularized by GPT-3, the problem to be solved is formulated via a text prompt, which the model must solve by providing a completion (via inference). In \"few-shot prompting\", the prompt includes a small number of examples of similar (problem, solution) pairs. For example, a sentiment analysis task of labelling the sentiment of a movie review could be prompted as follows:\n\nReview: This movie stinks.\nSentiment: negative\n\nReview: This movie is fantastic!\nSentiment:\n\nIf the model outputs \"positive\", then it has correctly solved the task. In zero-shot prompting, no solve examples are provided. An example of a zero-shot prompt for the same sentiment analysis task would be \"The sentiment associated with the movie review 'This movie is fantastic!' is\".\n\nFew-shot performance of LLMs has been shown to achieve competitive results on NLP tasks, sometimes surpassing prior state-of-the-art fine-tuning approaches. Examples of such NLP tasks are translation, question answering, cloze tasks, unscrambling words, and using a novel word in a sentence. The creation and optimisation of such prompts is called prompt engineering.\n\nInstruction tuning\nInstruction tuning is a form of fine-tuning designed to facilitate more natural and accurate zero-shot prompting interactions. Given a text input, a pretrained language model will generate a completion which matches the distribution of text on which it was trained. A naive language model given the prompt \"Write an essay about the main themes of Hamlet.\" might provide a completion such as \"A late penalty of 10% per day will be applied to submissions received after March 17.\" In instruction tuning, the language model is trained on many examples of tasks formulated as natural language instructions, along with appropriate responses. Various techniques for instruction tuning have been applied in practice. OpenAI's InstructGPT protocol involves supervised fine-tuning on a dataset of human-generated (prompt, response) pairs, followed by reinforcement learning from human feedback (RLHF), in which a reward function was learned based on a dataset of human preferences. Another technique, \"self-instruct\", fine-tunes the language model on a training set of examples which are themselves generated by an LLM (bootstrapped from a small initial set of human-generated examples).\n\nhttps://en.wikipedia.org/wiki/Large_language_model\n\nInstruction:\n\nGiven these paragraphs about Large language models, when did LLMs emerge?\n\nAnswer:\n\nAround 2018.\n\n",
    "Instruction:\n\nHow many times does Fred Allison try to escape captivity?Context:\n\nBritish Captain Fred Allison bids farewell to his new wife, Monica, whom he has only known for six days, and sets out to serve in World War I. He ends up a prisoner of war (POW), tortured by the fact that his wife has not written to him since the early days of his two year captivity.\n\nWhen a fellow inmate shoots a guard, the prisoners make an impromptu unsuccessful dash for freedom, resulting in much bloodshed on both sides. As punishment, they are locked in a crowded cell for about a month. Finally, a new commandant, Oberst Carl Ehrlich, takes charge of the camp. Allison persuades Ehrlich (a fellow Oxford alumnus) to rescind the punishment.\n\nOne day, a fresh batch of POWs arrives. Allison is delighted to find his oldest and best friend among them, Royal Flying Corps Lieutenant Jack \"Dig\" Digby. For some reason though, Dig is not as pleased to see him. However, Allison attributes that to their situation. Dig is determined to escape, regardless of the consequences to his fellow prisoners. He does manage to break free, stealing an aircraft from the nearby airfield.\n\nAnswer:\n\nIt seems from the text that Fred Allison tried to escape one time.\n\nThe prisoners made an impromptu unsuccessful dash for freedom when a fellow inmate shot a guard. We don't know for sure, but we can assume that Fred Allison was one of the prisoners that attempted to escape. Dig, Allison's oldest and best friend, managed to break free by stealing an aircraft from a nearby airfield, but it does not appear that Allison was involved.\n\n",
    "Context:\n\nA column-oriented DBMS or columnar DBMS is a database management system (DBMS) that stores data tables by column rather than by row. Benefits include more efficient access to data when only querying a subset of columns (by eliminating the need to read columns that are not relevant), and more options for data compression. However, they are typically less efficient for inserting new data.\n\nPractical use of a column store versus a row store differs little in the relational DBMS world. Both columnar and row databases can use traditional database query languages like SQL to load data and perform queries. Both row and columnar databases can become the backbone in a system to serve data for common extract, transform, load (ETL) and tools.\n\nInstruction:\n\nGiven this reference text, what are column stores used for?\n\nAnswer:\n\nA column store database stores data as any other database management system. The data itself is stored sequentially to improve the performance of scans on a subset of individual columns.\n\n",
    "Context:\n\nThe Ottoman Empire, historically and colloquially the Turkish Empire, was an empire that controlled much of Southeast Europe, Western Asia, and Northern Africa between the 14th and early 20th centuries. It was founded at the end of the 13th century in northwestern Anatolia in the town of Söğüt (modern-day Bilecik Province) by the Turkoman tribal leader Osman I. After 1354, the Ottomans crossed into Europe and, with the conquest of the Balkans, the Ottoman beylik was transformed into a transcontinental empire. The Ottomans ended the Byzantine Empire with the conquest of Constantinople in 1453 by Mehmed the Conqueror.\n\nInstruction:\n\nWho were the Ottomans?\n\nAnswer:\n\nThe Ottomans belonged to the Ottoman empire which was founded in Anatolia, a region in Turkey and over the centuries spread more vastly to become a transcontinental empire.\n\n",
    "Instruction:\n\nGiven this reference text about Jimmy John's, where was the original Jimmy John's located?Context:\n\nAfter Jimmy John Liautaud graduated second to last in his class at Elgin Academy in 1982, his father gave him a choice to either join the Army or start a business. Although his father wanted him to enlist, the younger Liautaud chose the latter, and his father agreed to loan him $25,000 in exchange for a 48% stake in the business. Initially Jimmy John wanted to open a hot dog stand, but after visiting numerous such stands throughout the summer of 1982, he realized the $25,000 would not be enough for such a venture. After a chance encounter at a sandwich shop, Jimmy John realized that he could open a sandwich shop within his available budget by purchasing premium meats at a neighborhood market and baking his own bread. With the help of his family as tasters, he decided to put four sandwiches on his original menu. Paying $200 a month in rent, Liautaud could only afford used equipment consisting of a refrigerator, a chest freezer, an oven, and a meat slicer.\n\nOn January 13, 1983, Jimmy John's Gourmet Sandwiches opened in Charleston, Illinois. Due to the poor location of his first store, Liautaud decided to include delivery of his sandwiches to boost sales. He began by bringing samples door-to-door to the dorms of nearby Eastern Illinois University, which he had attended for one semester.\n\nAnswer:\n\nThe original Jimmy John's was located in Charleston, Illinois.\n\n",
    "Instruction:\n\nWho were the Ottomans?Context:\n\nThe Ottoman Empire, historically and colloquially the Turkish Empire, was an empire that controlled much of Southeast Europe, Western Asia, and Northern Africa between the 14th and early 20th centuries. It was founded at the end of the 13th century in northwestern Anatolia in the town of Söğüt (modern-day Bilecik Province) by the Turkoman tribal leader Osman I. After 1354, the Ottomans crossed into Europe and, with the conquest of the Balkans, the Ottoman beylik was transformed into a transcontinental empire. The Ottomans ended the Byzantine Empire with the conquest of Constantinople in 1453 by Mehmed the Conqueror.\n\nAnswer:\n\nThe Ottomans belonged to the Ottoman empire which was founded in Anatolia, a region in Turkey and over the centuries spread more vastly to become a transcontinental empire.\n\n",
    "Instruction:\n\nWho won the 2000 World Series?Context:\n\nThe 2000 World Series was the championship series of Major League Baseball's (MLB) 2000 season. The 96th edition of the World Series, it was a best-of-seven playoff between crosstown opponents, the two-time defending World Series champions and American League (AL) champion New York Yankees and the National League (NL) champion New York Mets. The Yankees defeated the Mets, four games to one, to win their third consecutive championship and 26th overall. The series was often referred to as the \"Subway Series\", referring to the longstanding matchup between New York baseball teams; it was the first World Series contested between two New York teams since the 1956 World Series and the first since the New York Giants and the Brooklyn Dodgers moved west to California (as the current San Francisco Giants and Los Angeles Dodgers, respectively) in 1958 and the subsequent formation of the Mets in 1962. This World Series that featured teams from the same city or state, was the first of its kind since 1989 between the Oakland Athletics and the San Francisco Giants. Yankees shortstop Derek Jeter was named the World Series Most Valuable Player.\n\nAnswer:\n\nNew York Yankees defeated the NY Mets 4 games to 1\n\n",
    "Context:\n\nIn graph theory and computer science, an adjacency list is a collection of unordered lists used to represent a finite graph. Each unordered list within an adjacency list describes the set of neighbors of a particular vertex in the graph. This is one of several commonly used representations of graphs for use in computer programs.\n\nInstruction:\n\nWhat is an adjacency list?\n\nAnswer:\n\nIn graph theory and computer science, an adjacency list is a collection of unordered lists used to represent a finite graph.\n\n",
    "Context:\n\nQuicksand, also known as sinking sand, is a colloid consisting of fine granular material (such as sand, silt or clay) and water. It forms in saturated loose sand when the sand is suddenly agitated. When water in the sand cannot escape, it creates a liquefied soil that loses strength and cannot support weight. Quicksand can form in standing water or in upward flowing water (as from an artesian spring). In the case of upward flowing water, forces oppose the force of gravity and suspend the soil particles.\n\nInstruction:\n\nWhat is Sinking Sand?\n\nAnswer:\n\nSinking Sand is most commonly known as Quicksand.\n\n",
    "Context:\n\nThe new UCLA campus in 1929 had four buildings: Royce Hall and Haines Hall on the north, and Powell Library and Kinsey Hall (now called Renee And David Kaplan Hall) on the south. The Janss Steps were the original 87-step entrance to the university that lead to the quad of these four buildings. Today, the campus includes 163 buildings across 419 acres (1.7 km2) in the western part of Los Angeles, north of the Westwood shopping district and just south of Sunset Boulevard. In terms of acreage, it is the second-smallest of the ten UC campuses. The campus is approximately 1 mile east of I-405 (the San Diego Freeway).\n\nThe campus is in the residential area of Westwood and bordered by Bel-Air to the north, Beverly Hills to the east, and Brentwood to the west. The campus is informally divided into North Campus and South Campus, which are both on the eastern half of the university's land. North Campus is the original campus core; its buildings are more traditional in appearance and clad in imported Italian brick. North Campus is home to the arts, humanities, social sciences, law, history, and business programs and is centered around ficus and sycamore-lined Dickson Court, also known as the \"Sunken Garden\". South Campus is home to the physical sciences, life sciences, engineering, mathematical sciences, health-related fields, and the UCLA Medical Center. The campus includes sculpture gardens, fountains, museums, and a mix of architectural styles.\n\nAckerman Union, the John Wooden Center, the Arthur Ashe Health and Wellness Center, the Student Activities Center, Kerckhoff Hall, the J.D. Morgan Center, the James West Alumni Center, and Pauley Pavilion stand at the center of the campus, bordering Wilson Plaza. The campus is bisected by Bruin Walk, a heavily traveled pathway from the residential hill to the main campus. At the intersection of Bruin Walk and Westwood Plaza is Bruin Plaza, featuring an outdoor performing arts stage and a bronze statue of the Bruin bear.\n\nDuring the 2028 Summer Olympics, wrestling and judo will be held at Pauley Pavilion. The campus will also be the location of the Olympic Village for the Olympic and Paralympic Games.\n\nIn September 2022 UCLA purchased the Palos Verdes (PV) campus of Marymount California University, which had closed its doors that August, after fifty years of classes; the PV campus joins two other locations, in downtown LA, and in Culver City as satellites of the Westwood campus. A faculty and administration task force will review possible applications of the PV campus for UCLA. The Channel Islands will again be visible from a UCLA campus.\n\nInstruction:\n\nBased on this passage about UCLA, tell me the difference between North Campus and South Campus and which residential areas border the campus.\n\nAnswer:\n\nAt UCLA, North Campus hosts the arts, humanities, social sciences, law, history, and business programs, while South Campus is home to the physical sciences, life sciences, engineering, mathematical sciences, health-related fields, and the UCLA Medical Center. The UCLA Campus is bordered by Bel Air, Brentwood, and Beverly Hills.\n\n",
    "Instruction:\n\nGiven this paragraph about Hydrogen Storage, what is the hydrogen boiling point?Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nAnswer:\n\nIt boils around 20.268 K (−252.882 °C or −423.188 °F).\n\n",
    "Instruction:\n\nDoes Indermaur work as CTO, CEO, or CFO?Context:\n\nIndermaur works as a marketing specialist for her husband's technical trading company and is the chief executive officer of Comate, a marketing agency.\n\nAnswer:\n\nCEO\n\n",
    "Instruction:\n\nBased on this article, considerations of what time zone is used for determining what land is in the dead man zone?Context:\n\nThe dead man zone is the area directly around a bushfire that is likely to burn within five minutes given the current wind conditions or an anticipated change in wind direction. The distance this zone extends from the firefront is highly dependent on terrain, windspeed, fuel type and composition, relative humidity and ambient temperature, and can range from under 100 metres (330 ft) to well over 1 kilometre (3,300 ft).\n\nAnswer:\n\nA five minute period in the future is used for creating the dead man zone.\n\n",
    "Instruction:\n\nGiven this reference text, what sport other than baseball did David Ortiz play growing up, how many children did his parents have, and what age is he today?Context:\n\nOrtiz was born on November 18, 1975, in Santo Domingo, Dominican Republic, as the oldest of four children of Enrique (Leo) Ortiz and Ángela Rosa Arias. As a boy, he followed the careers of standout pitcher Ramón Martinez and his younger brother Pedro, attending games whenever he could and building a friendship with Pedro that would only grow over the years. Ortiz graduated from Estudia Espaillat High School in the Dominican Republic, and was a standout baseball and basketball player there.\nhttps://en.wikipedia.org/wiki/David_Ortiz\n\nAnswer:\n\nDavid Ortiz played basketball in addition to baseball. His parents had five total children, and today (on April 5, 2023) he is 47 years old.\n\n",
    "Context:\n\nOn Wednesday, September 25, 1974, the race started. It began with a run of a 4.8 km (3 mi) loop, followed by biking twice around Fiesta Island for a total of 8.0 km (5 mi). Entrants would then get off the bikes, take their shoes off and run into the water to swim to the mainland. That was followed by running in bare feet, then swimming again along the bay, then one last swim up to the entrance of Fiesta Island, and a final crawl up a steep dirt bank to finish. Most participants were not skilled swimmers, so Johnstone recruited his 13-year-old son to float on his surfboard and act as lifeguard. Some participants took longer than expected, and it began to get dark as they finished their swims. Shanahan recalls they pulled up a few cars and turned on the headlights so the athletes could see. Johnstone and Shanahan were surprised by the large number of entrants (46), mainly coming from local running clubs. Two notable entrants, Judy and John Collins, would four years later found the event which brought international attention to the new sport: the Hawaii Ironman\n\nInstruction:\n\nGiven this paragraph about triathlon, who founded ironman\n\nAnswer:\n\nIronman was founded by Judy and John Collins four years after the first known modern day triathlon on Wednesday, September 25th, 1974.\n\n",
    "Instruction:\n\nGiven a reference text about Justice League Dark, tell me who the main actors are and what roles they played.Context:\n\nJustice League Dark is a 2017 American adult animated science fantasy superhero film produced by Warner Bros. Animation and distributed by Warner Home Video. Featuring the DC Comics team of the same name created by Peter Milligan and Mikel Janín, the film is the 27th of the DC Universe Animated Original Movies and the eighth of the DC Animated Movie Universe. Unlike most installments in the DC Animated Universe Movies series, Justice League Dark features an original premise. The film stars Matt Ryan as John Constantine and Jason O'Mara as Batman, reprising their respective roles from previous media. It was released on Digital HD on January 24, 2017, and on DVD and Blu-ray on February 7.\n\nA sequel, Justice League Dark: Apokolips War, was released in May 2020.\n\nAnswer:\n\nThe main actors in Justice League Dark were Matt Ryan and Jason O'Mara. In the film, Matt Ryan is John Constantine and Jason O'Mara is Batman.\n\n",
    "Context:\n\nCats have excellent night vision and can see at only one-sixth the light level required for human vision.: 43  This is partly the result of cat eyes having a tapetum lucidum, which reflects any light that passes through the retina back into the eye, thereby increasing the eye's sensitivity to dim light. Large pupils are an adaptation to dim light. The domestic cat has slit pupils, which allow it to focus bright light without chromatic aberration. At low light, a cat's pupils expand to cover most of the exposed surface of its eyes. The domestic cat has rather poor color vision and only two types of cone cells, optimized for sensitivity to blue and yellowish green; its ability to distinguish between red and green is limited. A response to middle wavelengths from a system other than the rod cells might be due to a third type of cone. This appears to be an adaptation to low light levels rather than representing true trichromatic vision. Cats also have a nictitating membrane, allowing them to blink without hindering their vision.\n\nInstruction:\n\nGiven this paragraph about cat's senses, what light level can domestic house cats see at in comparison to human sight?\n\nAnswer:\n\nDomestic cats are able to see at one-sixth the light level required for human vision.\n\n",
    "Context:\n\nU.S. News & World Report ranks UVA tied for 25th among national universities overall, 3rd among public universities and tied for 110th among global universities in its 2022 report, 8th best business program and 3rd best business management program.\n\nInstruction:\n\nAccording to this paragraph, what is UVA's overall ranking among national universities?\n\nAnswer:\n\nUVA tied for 25th among national universities.\n\n",
    "Instruction:\n\nHow was art used for manipulative purpose in racial discuss in the 20th century?Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nAnswer:\n\nIn the 19th to 20th century, Europeans commonly use artworks to portray prejudice towards Middle Eastern and Asian people.\n\n",
    "Context:\n\nA year after getting his philosophy baccalaureate in his native town Sfax, Mohamed Fourati moved to Lille (France) to pursue his graduate education in the medical school of Lille. In order to validate his studies, he became an intern in the Farhat-Hachad Hospital of Sousse. Traveling between the two continents, he secured, in 1959, a medical doctorate at the medical school of Lille. He performed his military service, the following year, in the region of El Kef (in north-eastern Tunisia) and in Kébili (southern Tunisia). He continued to specialize in thoracic and cardiovascular surgery at the Saint-Joseph Hospital of Paris. He got assigned to the general surgery unit of doctors Saïd Mestiri and Zouhair Essafi at the Habib-Thameur Hospital in Tunis. In 1961, over the month of July, he worked as a surgeon in the battle of Bizerte, performing surgery on patients 20 hours a day for many days. He got appointed as hospital assistant in 1966, then earned the title of chief physician of the surgical ward in the Habib-Thameur Hospital in May 1968 and became, at the age of 35, the youngest chief physician in Tunisia. In November of the same year, he performed the first open-heart surgery, favored by a delegation of doctors of the IFTHD (led by Charles Hahn of the Cantonal hospital of Geneva (Switzerland) ).\n\nInstruction:\n\nGiven this paragraph about Mohamed Fourati, at what age was he appointed as hospital assistant?\n\nAnswer:\n\nHe was appointed hospital assistant in 1966. In 1968, he was 35 years old. So in 1966, he was 33 years old.\n\n",
    "Context:\n\nRacial categories have historically been used as a way to enable an oppressive figure or group to discriminate against other groups or individuals which were seen as different from that of the oppressor. In nineteenth and early twentieth century Europe, artwork was a common form of racialization which targeted countries in the Middle East and Asia. The artwork, predominantly paintings, were portrayed in order to instill prejudice in the Western populations through sexualizing and manipulating images. One of the most prominent examples of Orientalist work in art is a piece by Eugène Delacroix titled Women of Algiers in their Apartment. Dating back to 1834, it portrays three women resting in a harem in exotic clothing while an African woman is dressed in plain clothing, depicting her role as a servant. Fine textiles, hookahs, and other paraphernalia adorn the room, which represents a European fantasy of an exotic scene. Attempts to portray these cultures as strange, foreign and exotic through Orientalism led to intolerance towards the Arab and Asian communities in Europe and the United States. Others argue that Delacroix, who travelled in North Africa sketching extensively, was depicting a realistic scene of the era based on his first-hand knowledge and experience. In such an interpretation the clothing, for example, is consistent with the times, as Arab North Africans dressed differently from Europeans, and kept black slaves who would not have been treated as equals.\n\nInstruction:\n\nHow are racial categories used historically?\n\nAnswer:\n\nHistorically, oppressive groups use racial categories to discriminate against other groups that are different from them.\n\n",
    "Instruction:\n\nWhen did the new building open?Context:\n\nThe new building opened on November 13, 2001, with a dedication ceremony held on November 17. The opening of the Fairview branch marked the first of many mixed use buildings in the county system. The library, with a floor area of 4,000 square feet (370 m2), is on the ground floor, and four apartments are on the upper floor.\n\nAnswer:\n\nThe new building opened on November 13, 2001.\n\n",
    "Instruction:\n\nGiven this paragraph about Mohamed Fourati, at what age was he appointed as hospital assistant?Context:\n\nA year after getting his philosophy baccalaureate in his native town Sfax, Mohamed Fourati moved to Lille (France) to pursue his graduate education in the medical school of Lille. In order to validate his studies, he became an intern in the Farhat-Hachad Hospital of Sousse. Traveling between the two continents, he secured, in 1959, a medical doctorate at the medical school of Lille. He performed his military service, the following year, in the region of El Kef (in north-eastern Tunisia) and in Kébili (southern Tunisia). He continued to specialize in thoracic and cardiovascular surgery at the Saint-Joseph Hospital of Paris. He got assigned to the general surgery unit of doctors Saïd Mestiri and Zouhair Essafi at the Habib-Thameur Hospital in Tunis. In 1961, over the month of July, he worked as a surgeon in the battle of Bizerte, performing surgery on patients 20 hours a day for many days. He got appointed as hospital assistant in 1966, then earned the title of chief physician of the surgical ward in the Habib-Thameur Hospital in May 1968 and became, at the age of 35, the youngest chief physician in Tunisia. In November of the same year, he performed the first open-heart surgery, favored by a delegation of doctors of the IFTHD (led by Charles Hahn of the Cantonal hospital of Geneva (Switzerland) ).\n\nAnswer:\n\nHe was appointed hospital assistant in 1966. In 1968, he was 35 years old. So in 1966, he was 33 years old.\n\n",
    "Instruction:\n\nGiven a reference text about Gaya Island, how many hiking trails and 5 star resorts are on the island?Context:\n\nGaya Island (Malay: Pulau Gaya) is a sizeable Malaysian island of 1,465 ha, just 10 minutes off Kota Kinabalu, Sabah and forms part of the Tunku Abdul Rahman National Park. Gaya Island derived its name from the Bajau word \"Gayo\" which means big and occupies an area of 15 km2 (3,700 acres) with an elevation of up to 300 metres. Several ridges rise more than 600 feet (180 m), peaking at 1,000 feet (300 m), along the backbone of Gaya Island.\n\nGaya is the largest island in the Tunku Abdul Rahman National Park, closest to downtown Kota Kinabalu (KK) and is covered with dense virgin, tropical forest. It has been a forest reserve since 1923. The island has 20 km of hiking trails and three 5 star resorts named Gayana Marine Resort, home to the Marine Ecology Research Centre, the neighboring Gaya Island Resort (by YTL Hotel Group), the Bunga Raya Island Resort on the north-east part of the island. Historically, Gaya Island was also the site of the English colonialist's British North Borneo Company's harbour, razed by the folk hero Mat Salleh on 9 July 1897.\n\nIn recent years, there has been a plan to turn Gaya Island into a city island and tourism hub. A cable car line has also been proposed before to connect with the city centre.\n\nAnswer:\n\nGaya Island has 20km of hiking trails and three 5 star resorts.\n\n",
    "Context:\n\nGaya Island (Malay: Pulau Gaya) is a sizeable Malaysian island of 1,465 ha, just 10 minutes off Kota Kinabalu, Sabah and forms part of the Tunku Abdul Rahman National Park. Gaya Island derived its name from the Bajau word \"Gayo\" which means big and occupies an area of 15 km2 (3,700 acres) with an elevation of up to 300 metres. Several ridges rise more than 600 feet (180 m), peaking at 1,000 feet (300 m), along the backbone of Gaya Island.\n\nGaya is the largest island in the Tunku Abdul Rahman National Park, closest to downtown Kota Kinabalu (KK) and is covered with dense virgin, tropical forest. It has been a forest reserve since 1923. The island has 20 km of hiking trails and three 5 star resorts named Gayana Marine Resort, home to the Marine Ecology Research Centre, the neighboring Gaya Island Resort (by YTL Hotel Group), the Bunga Raya Island Resort on the north-east part of the island. Historically, Gaya Island was also the site of the English colonialist's British North Borneo Company's harbour, razed by the folk hero Mat Salleh on 9 July 1897.\n\nIn recent years, there has been a plan to turn Gaya Island into a city island and tourism hub. A cable car line has also been proposed before to connect with the city centre.\n\nInstruction:\n\nGiven a reference text about Gaya Island, how many hiking trails and 5 star resorts are on the island?\n\nAnswer:\n\nGaya Island has 20km of hiking trails and three 5 star resorts.\n\n",
    "Context:\n\nHousman received his BA in 1966 and MA in 1971 from Brandeis University. As one of the first postdocs in the lab of Harvey Lodish at MIT, Housman showed that all mammalian proteins begin with a methionine residue transferred from a specific met-initiator tRNA. Between 1973 and 1975 he taught at the University of Toronto and was on the staff of the Ontario Cancer Institute. He joined the MIT faculty in 1975. In his lab at MIT, he mentored Jim Gusella and Daniel Haber.\n\nInstruction:\n\nWhere did David Houseman go to college?\n\nAnswer:\n\nDavid Houseman received his BA and MA in 1966 from Brandeis University.\n\n",
    "Instruction:\n\nWho is the protagonist in CyberPunk 2077?Context:\n\nCyberpunk 2077 is a 2020 action role-playing video game developed by CD Projekt Red and published by CD Projekt. Set in Night City, an open world set in the Cyberpunk universe, players assume the role of a customisable mercenary known as V, who can acquire skills in hacking and machinery with options for melee and ranged combat. The main story follows V's struggle as they deal with a mysterious cybernetic implant that threatens to overwrite their body with the personality and memories of a deceased celebrity only perceived by V; the two must work together to be separated and save V's life.\n\nAnswer:\n\nThe main story revolves around the protagonist V, as they deal with a mysterious cybernetic implant that threatens to overwrite their body with another person's memories.\n\n",
    "Context:\n\nSkiing is the use of skis to glide on snow. Variations of purpose include basic transport, a recreational activity, or a competitive winter sport. Many types of competitive skiing events are recognized by the International Olympic Committee (IOC), and the International Ski Federation (FIS).\n\nInstruction:\n\nwhat is snow skiing\n\nAnswer:\n\nskiing is a form of outdoor winter sport. Done in the mountains. You can ski on piste and off piste.\n\n",
    "Context:\n\nThe land battle took place over about 81 days beginning on 1 April 1945. The first Americans ashore were soldiers of the 77th Infantry Division who landed in the Kerama Islands, 15 mi (24 km) west of Okinawa on 26 March. Subsidiary landings followed, and the Kerama group was secured over the next five days. In these preliminary operations, the 77th Infantry Division suffered 27 dead and 81 wounded, while the Japanese dead and captured numbered over 650. The operation provided a protected anchorage for the fleet and eliminated the threat from suicide boats.\n\nInstruction:\n\nGiven this reference about the Battle of Okinawa during WW2, what was the difference in between the US (77th Infantry Division) and the Japanese casualties and wounded?\n\nAnswer:\n\nThe difference was about 542\n\n",
    "Instruction:\n\nList the television series Kang Se-jung appeared inContext:\n\nKang Se-jung (born January 15, 1982) is a South Korean actress. She made her entertainment debut as a singer for the K-pop girl group Papaya in 2000; the group released two albums before disbanding in 2001. Kang began acting full-time in 2004, and has appeared in television series such as Assorted Gems (2009) and Heartless City (2013). Upon turning to acting, she used the stage name Go Na-eun before reverting to use of her birth name in 2017.\n\nAnswer:\n\n- Assorted Gems\n- Heartless City\n\n",
    "Context:\n\nTrue Corporation Public Company Limited (TRUE) (Formerly: True Corporation Public Company Limited and Total Access Communication Public Company Limited) is a communications conglomerate in Thailand. It is a joint venture between Charoen Pokphand Group and Telenor, formed by the merger between the original True Corporation and DTAC in the form of equal partnership to create a new telecommunications company that can fully meet the needs of the digital age. True controls Thailand's largest cable TV provider, TrueVisions, Thailand's largest internet service provider True Online,[citation needed] Thailand's largest mobile operators, TrueMove H and DTAC TriNet, which is second and third only to AIS. and entertainment media including television, internet, online games, and mobile phones under the True Digital brand. As of August 2014, True, along with True Telecommunications Growth Infrastructure Fund, had a combined market capitalization of US$10 billion.[citation needed] TrueMove is also a partner of Vodafone Group. Charoen Pokphand Group and Telenor hold equal ownership of 30% of True's shares as of March 2023. It operates fixed-line (as a concessionaire of NT (formerly known as TOT)), wireless, cable TV, IPTV and broadband services.\n\nInstruction:\n\nGiven a reference text about True Corporation Public Company Limited, tell me what country it's in and how it was formed.\n\nAnswer:\n\nTrue Corporation Public Company Limited is located in Thailand and was formed by the original True Corporation merging with DTAC.\n\n",
    "Instruction:\n\nGiven this paragraph about the Pearl Mill Village Historic District, tell me where it is located.Context:\n\nPearl Mill Village Historic District is a national historic district located at Durham, Durham County, North Carolina. The district encompasses 26 contributing residential buildings built by owners of Pearl Cotton Mills. The mill village dwellings are either two-story duplex type built about 1905 or a one-story bungalow constructed about 1924.\n\nAnswer:\n\nThe Pearl Mill Village Historic District is in Durham, North Carolina.\n\n",
    "Context:\n\nThe 1932 Australian Grand Prix was a motor race held at the Phillip Island circuit in Victoria, Australia on 14 March 1932. It was the fifth Australian Grand Prix and the fifth to be held at Phillip Island.\n\nThe race was organized by the Light Car Club of Australia, formerly known as the Victorian Light Car Club, and was limited to cars having an engine with a piston displacement of 2000cc or less. It was the first Australian Grand Prix to be decided on a straight handicap basis, with the winner being the first car to complete the 31 laps. The two \"scratch\" competitors had to concede starts ranging up to 29 minutes, equating to an advantage of four laps. The previous practice of cars contesting four classes was discontinued. Weather conditions were reported to be \"ideal\".\n\nThe race, in which there were 18 starters, was won by Bill Thompson driving a Bugatti. Thompson was also awarded the Herald Trophy for recording the fastest time of the race.\n\nInstruction:\n\nWhat kind of grand prix is the 1932 Australian Grand Prix\n\nAnswer:\n\nThe 1932 Australian Grand Prix was a motor race held at the Phillip Island circuit in Victoria, Australia on 14 March 1932. It was the fifth Australian Grand Prix and the fifth to be held at Phillip Island.\n\nThe race was organized by the Light Car Club of Australia, formerly known as the Victorian Light Car Club, and was limited to cars having an engine with a piston displacement of 2000cc or less. It was the first Australian Grand Prix to be decided on a straight handicap basis, with the winner being the first car to complete the 31 laps. The two \"scratch\" competitors had to concede starts ranging up to 29 minutes, equating to an advantage of four laps. The previous practice of cars contesting four classes was discontinued. Weather conditions were reported to be \"ideal\".\n\nThe race, in which there were 18 starters, was won by Bill Thompson driving a Bugatti. Thompson was also awarded the Herald Trophy for recording the fastest time of the race.\n\n",
    "Context:\n\nThe dead man zone is the area directly around a bushfire that is likely to burn within five minutes given the current wind conditions or an anticipated change in wind direction. The distance this zone extends from the firefront is highly dependent on terrain, windspeed, fuel type and composition, relative humidity and ambient temperature, and can range from under 100 metres (330 ft) to well over 1 kilometre (3,300 ft).\n\nInstruction:\n\nBased on this article, considerations of what time zone is used for determining what land is in the dead man zone?\n\nAnswer:\n\nA five minute period in the future is used for creating the dead man zone.\n\n",
    "Context:\n\nThe commercial and geopolitical importance of rivers is not ranked here. As a transportation artery, a river may unite a region commercially and economically, but major rivers, as barriers to travel, may also form political boundaries between states. The Danube, the second longest river in Europe, is notable for flowing through or past ten countries; the Rhine through or past six. The Volga, the longest river in Europe, unites a huge region of European Russia; eleven of the twenty largest cities in Russia lie on its banks. The Loire and the Po unite important regions within France and Italy respectively. The most important rivers in Europe include Rhone, Elbe, Oder, Tagus, Thames, Don and Dnieper, among others.\n\nInstruction:\n\nGiven this paragraph about rivers in Europe, tell me what are the two longest rivers in Europe.\n\nAnswer:\n\nThe two longest rivers in Europe are the Volga and the Danube.\n\n",
    "Context:\n\nSeveral methods exist for storing hydrogen. These include mechanical approaches such as using high pressures and low temperatures, or employing chemical compounds that release H2 upon demand. While large amounts of hydrogen are produced by various industries, it is mostly consumed at the site of production, notably for the synthesis of ammonia. For many years hydrogen has been stored as compressed gas or cryogenic liquid, and transported as such in cylinders, tubes, and cryogenic tanks for use in industry or as propellant in space programs. Interest in using hydrogen for on-board storage of energy in zero-emissions vehicles is motivating the development of new methods of storage, more adapted to this new application. The overarching challenge is the very low boiling point of H2: it boils around 20.268 K (−252.882 °C or −423.188 °F). Achieving such low temperatures requires expending significant energy.\n\nhttps://en.wikipedia.org/wiki/Hydrogen_storage\n\nInstruction:\n\nGiven this paragraph about Hydrogen Storage, what is the hydrogen boiling point?\n\nAnswer:\n\nIt boils around 20.268 K (−252.882 °C or −423.188 °F).\n\n",
    "Context:\n\nAfter an ice storm in December 2015, the 13-year-old dome collapsed. It housed several events for indoor track athletes, including practices and meets, practice room for all winter sports teams, physical education classes, and various community events.\n\nThe dome was designed by Air Structures American Technologies Inc. and cost $3 million at the time of its construction in 2002. It was meant to last 15–20 years.\n\nInstruction:\n\nDid the dome last as long as it was designed for?\n\nAnswer:\n\nNo, it did not. The dome only lasted 13 years, but it was designed to last 15-20 years.\n\n",
    "Context:\n\nThe new building opened on November 13, 2001, with a dedication ceremony held on November 17. The opening of the Fairview branch marked the first of many mixed use buildings in the county system. The library, with a floor area of 4,000 square feet (370 m2), is on the ground floor, and four apartments are on the upper floor.\n\nInstruction:\n\nWhen did the new building open?\n\nAnswer:\n\nThe new building opened on November 13, 2001.\n\n",
    "Instruction:\n\nWhich English football club has won the most FA Cup trophies?Context:\n\nThey hold the highest number of FA Cup trophies, with 14. The club is one of only six clubs to have won the FA Cup twice in succession, in 2002 and 2003, and 2014 and 2015. Arsenal have achieved three League and FA Cup \"Doubles\" (in 1971, 1998 and 2002), a feat only previously achieved by Manchester United (in 1994, 1996 and 1999). They were the first side in English football to complete the FA Cup and League Cup double, in 1993. Arsenal were also the first London club to reach the final of the UEFA Champions League, in 2006, losing the final 2–1 to Barcelona.\n\nAnswer:\n\nArsenal - 14\n\n",
    "Context:\n\nOrtiz was born on November 18, 1975, in Santo Domingo, Dominican Republic, as the oldest of four children of Enrique (Leo) Ortiz and Ángela Rosa Arias. As a boy, he followed the careers of standout pitcher Ramón Martinez and his younger brother Pedro, attending games whenever he could and building a friendship with Pedro that would only grow over the years. Ortiz graduated from Estudia Espaillat High School in the Dominican Republic, and was a standout baseball and basketball player there.\nhttps://en.wikipedia.org/wiki/David_Ortiz\n\nInstruction:\n\nGiven this reference text, what sport other than baseball did David Ortiz play growing up, how many children did his parents have, and what age is he today?\n\nAnswer:\n\nDavid Ortiz played basketball in addition to baseball. His parents had five total children, and today (on April 5, 2023) he is 47 years old.\n\n",
    "Instruction:\n\nGiven a reference text about Scrub Daddy, tell me the details on the deal the founder made on Shark Tank.Context:\n\nScrub Daddy is a cleaning product company best known for an eponymous sponge it manufactures in the shape of a smiley face. The product is made of a polymer which changes texture – firm in cold water and soft in warm water. As of 2019, Scrub Daddy had the highest revenue of any product successfully pitched on the ABC reality show Shark Tank.\n\nHistory\nAfter damaging the exterior of a vehicle when cleaning the outside, detailer Aaron Krause invented a line of buffing and polishing pads. The company was acquired by 3M in August 2008. 3M did not purchase a line of sponges Krause had invented, leaving them to sit in his factory. Five years later, Krause used the remaining sponges to clean his dishes and lawn furniture. According to Krause, this is when he \"realized his multi-million dollar idea.\"\n\nAccording to the company's website, Scrub Daddy, Inc. was founded in 2012 with grassroots marketing. On the Shark Tank episode originally airing in October 2012, Lori Greiner made a 20% equity stake deal with Krause for $200,000. The following day, Greiner and Krause sold out of 42,000 sponges in under seven minutes on QVC. Greiner then helped Scrub Daddy to be sold in retail stores such as Bed, Bath & Beyond. In January 2017, Scrub Daddy's total revenues surpassed $100 million – the highest of any Shark Tank product. As of October 2019, the company's lifetime sales were $209 million. In Season 14 Episode 13, it was reported that Scrub Daddy in 10 years has 273 employees, 160 products, sold in 257,000 retail locations, top 5 grossing company in shark tank history, doing over $670m in retail sales since launch.\n\nAnswer:\n\nAaron Krause, the founder of Scrub Daddy, made a deal with Lori Greiner on Shark Tank, giving her 20% equity in the company for $200,000.\n\n",
    "Context:\n\nHouse is a music genre characterized by a repetitive four-on-the-floor beat and a typical tempo of 120 beats per minute. It was created by DJs and music producers from Chicago's underground club culture in the early/mid 1980s, as DJs began altering disco songs to give them a more mechanical beat.\n\nHouse was pioneered by African American DJs and producers in Chicago such as Frankie Knuckles, Ron Hardy, Jesse Saunders, Chip E., Joe Smooth, Steve \"Silk\" Hurley, Farley \"Jackmaster\" Funk, Marshall Jefferson, Phuture, and others. House music expanded to other cities such as London, then New York City and became a worldwide phenomenon.\n\nInstruction:\n\nGiven the following paragraph, where did House music originate?\n\nAnswer:\n\nHouse music originated in Chicago, Illinois in the United States of America by producers/DJs such as Frankie Knuckles, Ron Hardy, and Jesse Saunders.\n\n",
    "Context:\n\nThe technique was originally developed by Sakichi Toyoda and was used within the Toyota Motor Corporation during the evolution of its manufacturing methodologies. It is a critical component of problem-solving training, delivered as part of the induction into the Toyota Production System. The architect of the Toyota Production System, Taiichi Ohno, described the five whys method as \"the basis of Toyota's scientific approach by repeating why five times the nature of the problem as well as its solution becomes clear.\" The tool has seen widespread use beyond Toyota, and is now used within Kaizen, lean manufacturing, lean construction and Six Sigma. The five whys were initially developed to understand why new product features or manufacturing techniques were needed, and was not developed for root cause analysis.\n\nInstruction:\n\nGiven this reference paragraph about the history of the 'five whys' technique, what was the original intention of asking the 'five whys'?\n\nAnswer:\n\nThe original intention of asking the 'five whys' was to understand why new product features or manufacturing techniques were needed in Toyota's manufacturing practices.\n\n",
    "Instruction:\n\nGiven a reference text about Listeriosis, tell me how how the bacterium is transfered into animals, and people.Context:\n\nListeriosis is an infectious but not contagious disease caused by the bacterium Listeria monocytogenes, far more common in domestics animals (domestic mammals and poultry), especially ruminants, than in human beings. It can also occur in feral animals—among others, game animals—as well as in poultry and other birds.\n\nThe causative bacterium lives in the soil and in poorly made silage, and is acquired by ingestion. It is not contagious; over the course of a 30-year observation period of sheep disease in Morocco, the disease only appeared in the late 2000s (decade) when feeding bag-ensiled corn became common.[better source needed] In Iceland, the disease is called \"silage sickness\".\n\nAnswer:\n\nListeriosis is most often associated with animals but can also infect people and is primarily transferred by ingestion.\n\n",
    "Context:\n\nPortugal's overseas presence in sub-Saharan Africa (most notably in Angola, Cape Verde, Mozambique, Guinea-Bissau, and São Tomé and Príncipe) lasted from the 16th century to 1975, after the Estado Novo regime was overthrown in a military coup in Lisbon. Rhodesia unilaterally declared independence from the United Kingdom in 1965, under the white minority government of Ian Smith, but was not internationally recognized as an independent state (as Zimbabwe) until 1980, when black nationalists gained power after a bitter guerrilla war. Although South Africa was one of the first African countries to gain independence, the state remained under the control of the country's white minority through a system of racial segregation known as apartheid until 1994.\n\nInstruction:\n\nWhat is apartheid, and which country experienced it?\n\nAnswer:\n\nApartheid is a system of racial segregation in South Africa.\n\n",
    "Context:\n\nBritish Captain Fred Allison bids farewell to his new wife, Monica, whom he has only known for six days, and sets out to serve in World War I. He ends up a prisoner of war (POW), tortured by the fact that his wife has not written to him since the early days of his two year captivity.\n\nWhen a fellow inmate shoots a guard, the prisoners make an impromptu unsuccessful dash for freedom, resulting in much bloodshed on both sides. As punishment, they are locked in a crowded cell for about a month. Finally, a new commandant, Oberst Carl Ehrlich, takes charge of the camp. Allison persuades Ehrlich (a fellow Oxford alumnus) to rescind the punishment.\n\nOne day, a fresh batch of POWs arrives. Allison is delighted to find his oldest and best friend among them, Royal Flying Corps Lieutenant Jack \"Dig\" Digby. For some reason though, Dig is not as pleased to see him. However, Allison attributes that to their situation. Dig is determined to escape, regardless of the consequences to his fellow prisoners. He does manage to break free, stealing an aircraft from the nearby airfield.\n\nInstruction:\n\nHow many times does Fred Allison try to escape captivity?\n\nAnswer:\n\nIt seems from the text that Fred Allison tried to escape one time.\n\nThe prisoners made an impromptu unsuccessful dash for freedom when a fellow inmate shot a guard. We don't know for sure, but we can assume that Fred Allison was one of the prisoners that attempted to escape. Dig, Allison's oldest and best friend, managed to break free by stealing an aircraft from a nearby airfield, but it does not appear that Allison was involved.\n\n",
    "Instruction:\n\nGiven this paragraph about rivers in Europe, tell me what are the two longest rivers in Europe.Context:\n\nThe commercial and geopolitical importance of rivers is not ranked here. As a transportation artery, a river may unite a region commercially and economically, but major rivers, as barriers to travel, may also form political boundaries between states. The Danube, the second longest river in Europe, is notable for flowing through or past ten countries; the Rhine through or past six. The Volga, the longest river in Europe, unites a huge region of European Russia; eleven of the twenty largest cities in Russia lie on its banks. The Loire and the Po unite important regions within France and Italy respectively. The most important rivers in Europe include Rhone, Elbe, Oder, Tagus, Thames, Don and Dnieper, among others.\n\nAnswer:\n\nThe two longest rivers in Europe are the Volga and the Danube.\n\n",
    "Context:\n\nIndermaur works as a marketing specialist for her husband's technical trading company and is the chief executive officer of Comate, a marketing agency.\n\nInstruction:\n\nDoes Indermaur work as CTO, CEO, or CFO?\n\nAnswer:\n\nCEO\n\n"
]