[
    "Context:\n\nLamb Air Ltd. was a Canadian airline that began operations in 1934 in The Pas, Manitoba, and went out of business in 1981.\n\nHistory\nTom Lamb was the son of Thomas Henry Peacock (THP) Lamb, who had emigrated from England in the late 19th century. THP Lamb turned from school teacher to fur trader and in 1900, started Lamb's Store in Moose Lake, Manitoba. Tom and his brothers and sisters grew up in northern Manitoba and worked for their father.\n\nTom Lamb left school before finishing grade 3. Later in life, he would make the comment, while giving his acceptance speech when receiving his honorary Doctorate of law from the University of Manitoba, \"If I had only gotten to grade 4\". At the age of 10, Tom, who had his own team of horses and sleigh, was competing with grown men in the fish hauling business. He would have to use fish boxes to step up on to be able to load his sleigh.\n\nOne of the Lamb family's businesses was \"logistics and transportation\". Fish, lumber, trees, fur and supplies needed to be hauled by any and all means. Dog teams, horses, boats, trucks and tractors were used. In the 1930s there was a transportation revolution happening. The aircraft was making its way into northern Canada. The first time Tom Lamb saw an aircraft he realized its potential. In 1930, Tom bought his first aircraft - a Stinson SR8. In 1930, Tom Lamb travelled to Winnipeg to learn to fly. To keep costs to a minimum, he lived in a tent behind the Winnipeg Flying Club. When he returned to The Pas and checked himself out on the Stinson.\n\nIn 1935, Tom incorporated Lamb Airways Limited. The airline had some name changes throughout the years and Tom became one of the best known Manitobans, if not Canadians, in the world. His adventures have been documented in books, a television documentary and even a song.\n\nInstruction:\n\nWhen was Lamb Air operating\n\nAnswer:\n\nLamb Air Ltd. was a Canadian airline that began operations in 1934 in The Pas, Manitoba, and went out of business in 1981.\n\nHistory\nTom Lamb was the son of Thomas Henry Peacock (THP) Lamb, who had emigrated from England in the late 19th century. THP Lamb turned from school teacher to fur trader and in 1900, started Lamb's Store in Moose Lake, Manitoba. Tom and his brothers and sisters grew up in northern Manitoba and worked for their father.\n\nTom Lamb left school before finishing grade 3. Later in life, he would make the comment, while giving his acceptance speech when receiving his honorary Doctorate of law from the University of Manitoba, \"If I had only gotten to grade 4\". At the age of 10, Tom, who had his own team of horses and sleigh, was competing with grown men in the fish hauling business. He would have to use fish boxes to step up on to be able to load his sleigh.\n\nOne of the Lamb family's businesses was \"logistics and transportation\". Fish, lumber, trees, fur and supplies needed to be hauled by any and all means. Dog teams, horses, boats, trucks and tractors were used. In the 1930s there was a transportation revolution happening. The aircraft was making its way into northern Canada. The first time Tom Lamb saw an aircraft he realized its potential. In 1930, Tom bought his first aircraft - a Stinson SR8. In 1930, Tom Lamb travelled to Winnipeg to learn to fly. To keep costs to a minimum, he lived in a tent behind the Winnipeg Flying Club. When he returned to The Pas and checked himself out on the Stinson.\n\nIn 1935, Tom incorporated Lamb Airways Limited. The airline had some name changes throughout the years and Tom became one of the best known Manitobans, if not Canadians, in the world. His adventures have been documented in books, a television documentary and even a song.\n\n",
    "Context:\n\nMichał Rozenfeld (born 1916, died September 2, 1943, in Krawcowizna) – a Jewish resistance activist during the Second World War, participant of the Warsaw Ghetto uprising, partisan of the Mordechai Anielewicz Unit of the People's Guard.\n\nBefore the outbreak of the war, he studied psychology with, among others, Tadeusz Kotarbiński. After the outbreak of World War II, Rozenfeld was sent to the Warsaw Ghetto, where he worked as a teacher. He belonged to the Polish Workers' Party and was a member of the Main Command of the Jewish Combat Organization. He stayed in a bunker with Mordechai Anielewicz at 18 Miła Street. On May 18, 1943, together with a group of Jewish fighters, he got through the sewers to Prosta Street.\n\nAfter the fall of the uprising, Rozenfeld took refuge in forests near Wyszków, where he fought in a unit of the People's Guard. Together with his companions he was handed over to the Germans by a forest ranger from Krawcowizna. Twelve partisans, including Michał Rozenfeld, were killed at that time.\n\nIn 1945 he was posthumously awarded the Silver Cross of the Order of Virtuti Militari.\n\nRozenfeld is buried in a mass grave of the People's Guard partisans in the Jewish cemetery on Okopowa Street in Warsaw (quarter 31, row 3).\n\nInstruction:\n\nGiven a reference text about Michał Rozenfeld, tell me what he did before the war and where he's buried.\n\nAnswer:\n\nMichał Rozenfeld studied psychology before being sent to the Warsaw Ghetto during the war. He is buried at the Jewish Cemetery on Okopowa Street in Warsaw.\n\n",
    "Context:\n\nThe 5' 11\" (1.80 m), 165 lb (75 kg) point guard, began his professional career in 1989 when he was selected in the first round of the NBA draft by the Seattle SuperSonics with the 16th pick. Most of his time spent in Seattle was as a backup to point guard Gary Payton, who was considered to be a much more competent ball handler and defender, as Barros was deemed more usable at shooting guard. Prior to the 1993–94 season, the Sonics traded Barros to the Charlotte Hornets in exchange for Kendall Gill. Two days later, Charlotte traded Barros, Sidney Green, and their 1993 draft choice, Greg Graham, to the Philadelphia 76ers for Hersey Hawkins. Barros became a free agent at the end of the 1994-95 NBA season. He signed with his hometown Boston Celtics, and remained for five seasons as a role player alongside David Wesley and Dee Brown and mentor to younger players such as Antoine Walker and Paul Pierce. In the offseason of 2000, Barros was traded to the Dallas Mavericks as part of a four-team deal that also involved the Utah Jazz and Golden State Warriors. By the time the 2000–01 season had commenced, the Mavs had traded Barros to the Detroit Pistons, where he played 89 games over two seasons, averaging 7.5 points per game, until waiving him in 2002.\n\nInstruction:\n\nBased on this paragraph, how many times was Barros traded during his professional basketball career?\n\nAnswer:\n\nBased on this paragraph, Barros was traded four times while in the NBA (from Seattle to Charlotte; from Charlotte to Philadelphia; from Boston to Dallas; from Dallas to Detroit).\n\n",
    "Context:\n\nUSS Rachel Seaman was a wooden schooner purchased by the Union Navy during the American Civil War.\n\nInstruction:\n\nIs the USS Rachel Seaman made of metal?\n\nAnswer:\n\nNo, it is made of wood.\n\n",
    "Context:\n\nTrump ordered a travel ban on citizens from several Muslim-majority countries, diverted military funding towards building a wall on the U.S.–Mexico border, and implemented a policy of family separations for apprehended migrants. He rolled back more than 100 environmental policies and regulations in an aggressive attempt to weaken environmental protections. Trump signed the Tax Cuts and Jobs Act of 2017, which cut taxes for individuals and businesses and rescinded the individual health insurance mandate penalty of the Affordable Care Act. He appointed 54 federal appellate judges and three U.S. Supreme Court justices. Trump initiated a trade war with China and withdrew the U.S. from the proposed Trans-Pacific Partnership trade agreement, the Paris Agreement on climate change, and the Iran nuclear deal. Trump met with North Korean leader Kim Jong-un three times, but made no progress on denuclearization. He reacted slowly to the COVID-19 pandemic, ignored or contradicted many recommendations from health officials in his messaging, and promoted misinformation about unproven treatments and the need for testing.\n\nInstruction:\n\nHow many judges did President Trump apoint?\n\nAnswer:\n\nHe appointed 57 judges, 54 federal appellate judges and three U.S. Supreme Court justices.\n\n",
    "Context:\n\nIn the United States between 1973 and 1999, September 16 is the most common birthday in the United States and December 25 the least common birthday (other than February 29, because of leap years). In 2011, October 5 and 6 were reported as the most frequently occurring birthdays.\n\nInstruction:\n\nWhat is the least common birthday in the US other than Feb 29?\n\nAnswer:\n\nThe least common birthday in the United States between 1973 and 1999, excluding February 29, is December 25.\n\n",
    "Context:\n\nBrazilian jiu-jitsu was initially developed in 1925 by Brazilian brothers Carlos, Oswaldo, Gastão Jr., George, and Hélio Gracie, after Carlos was taught jiu-jitsu by a travelling Japanese judoka, Mitsuyo Maeda, who himself mastered his ground fighting while interacting with Taro Miyake (Tanabe student), Sadakazu Uyenishi (Handa, Tanabe) and Yukio Tani (Tenjin Shinyo-ryu) and catch wrestlers in Europe.\n\nInstruction:\n\nGiven this paragraph about Jiu-Jitsu, who taught Carlos Gracie.\n\nAnswer:\n\nMitsuyo Maeda\n\n",
    "Context:\n\nThe Wagner Group (Russian: Группа Вагнера, tr. Gruppa Vagnera), also known as PMC Wagner (Russian: ЧВК «Вагнер», tr. ChVK «Vagner»; lit. 'Wagner Private Military Company'), is a Russian paramilitary organization. It is variously described as a private military company (PMC), a network of mercenaries, or a de facto private army of Russian President Vladimir Putin. The group operates beyond the law in Russia, where private military contractors are officially forbidden\n\nInstruction:\n\nWho are the Wagner group\n\nAnswer:\n\nThey are a private military organization that is endorsed by Russian President Vladimir Putin and is being used in the ongoing war against Ukraine.\n\n",
    "Context:\n\nDrake Maye was born on August 30, 2002, in Charlotte, North Carolina. He attended and played high school football for Myers Park High School in Charlotte, where he was named MaxPreps North Carolina player of the year. He was a four-star prospect and originally committed to Alabama before flipping to North Carolina.\n\nInstruction:\n\nGiven this paragraph, which highs school did Drake Maye attend?\n\nAnswer:\n\nBased on this text, Drake Maye attended Myers Park High School in Charlotte, North Carolina.\n\n",
    "Context:\n\nArlington Public Schools operates the county's public K-12 education system of 22 elementary schools; 6 middle schools (Dorothy Hamm Middle School, Gunston Middle School, Kenmore Middle School, Swanson Middle School, Thomas Jefferson Middle School, and Williamsburg Middle School); and 3 public high schools (Wakefield High School, Washington-Liberty High School, and Yorktown High School). H-B Woodlawn and Arlington Tech are alternative public schools. Arlington County spends about half of its local revenues on education. For the FY2013 budget, 83 percent of funding was from local revenues, and 12 percent from the state. Per pupil expenditures are expected to average $18,700, well above its neighbors, Fairfax County ($13,600) and Montgomery County ($14,900).\n\nInstruction:\n\nGiven this paragraph about Arlington, Virginia, what are the 3 public high schools in Arlington?\n\nAnswer:\n\nThe 3 public high schools in Arlington, Va are Wakefield High School, Washington-Liberty High School, and Yorktown High School.\n\n",
    "Context:\n\nShah starred on the reality television series The Real Housewives of Salt Lake City, which premiered in November 2020. In March 2021, she was criminally charged with conspiracy to commit money laundering and wire fraud, pleading not guilty to both charges days later. Her legal case was chronicled in the documentary film Housewife and the Shah Shocker, which premiered on Hulu in November that same year. In July 2022, Shah pleaded guilty to conspiracy to commit wire fraud. In January 2023, Shah was sentenced to six-and-a-half years in prison. Shah began her prison sentence the following month.\n\nInstruction:\n\nGiven a reference text about Jen Shah, what is she famous from, when was she criminally charged, what was the verdict, and when was she sentenced.\n\nAnswer:\n\nJen Shah came into the spotlight in November 2020 when The Real Housewives of Salt Lake City aired. In March 2021 she was charged with conspiracy to commit money laundering as well as wire fraud. She pled not guilty, but then come July 2022 she plead guilty to commit wire fraud. January of 2023 she was sentenced to 6.5 years in prison and her sentence began in February.\n\n",
    "Context:\n\nKubernetes (/ˌk(j)uːbərˈnɛtɪs, -ˈneɪtɪs, -ˈneɪtiːz, -ˈnɛtiːz/, commonly abbreviated K8s) is an open-source container orchestration system for automating software deployment, scaling, and management. Originally designed by Google, the project is now maintained by the Cloud Native Computing Foundation.\n\nThe name Kubernetes originates from Greek, meaning 'helmsman' or 'pilot'. Kubernetes is often abbreviated as K8s, counting the eight letters between the K and the s (a numeronym).\n\nKubernetes works with containerd and CRI-O. Its suitability for running and managing large cloud-native workloads has led to widespread adoption of it in the data center. There are multiple distributions of this platform – from ISVs as well as hosted-on cloud offerings from all the major public cloud vendors.\n\nInstruction:\n\nBased on this paragraph from Wikipedia, what's the origin of the word Kubernetes?\n\nAnswer:\n\nKubernetes originates from the Greek word for Helmsman.\n\n",
    "Context:\n\nIn 208, Cao Cao marched south with his army hoping to quickly unify the empire. Liu Biao's son Liu Cong surrendered Jing Province and Cao was able to capture a sizable fleet at Jiangling. Sun Quan, the successor to Sun Ce in the lower Yangtze, continued to resist. His advisor Lu Su secured an alliance with Liu Bei, himself a recent refugee from the north, and Zhou Yu was placed in command of Sun Quan's navy, along with a veteran general who served the Sun family, Cheng Pu. Their combined armies of 50,000 met Cao Cao's fleet and 200,000-strong force at Red Cliffs that winter. Cao Cao had to cross the mighty Yangtze River. So when he along with his fleet sailed down the river, many of his men fell to exhaustion, disease and the northerners were not very comfortable on ships and the marshy terrain. So when the two sides met for war at Wulin, Cao Cao wasn’t able to inflict any defeat on the Allied Force. On the other hand, General Huang Gai of Sun Quan’s army came up with a sneaky plan. He sent a forged letter to Cao Cao, stating that he and others wanted to inflict to his side and they would also bring some of the finest ships of the allies. But little did Cao know that the ships were full of flammable reeds. So when they sailed and approached his fleet, they were set alight and they destroyed Cao Cao’s fleet and camps. Seeing the hopeless situation, Cao Cao ordered his army for a difficult retreat through the Marshlands, during which more of his men fell to disease and exhaustion. The allied victory at Red Cliffs ensured the survival of Liu Bei and Sun Quan, and provided the basis for the states of Shu and Wu.\n\nInstruction:\n\nCould you tell me how Cao Cao's fleet got destroyed during the battle of Red Cliffs based on this paragraph?\n\nAnswer:\n\nCao Cao's fleet got set on fire by the General Huang Gai. Huang Gai initially informed Cao Cao that he'd betray the Allied Force formed by Liu Bei and Sun Quan. But Huang Gai was actually trying to take this chance to send ships loaded with flammable reeds to Cao Cao's fleet. Cao Cao took the bait and accepted the offer from Huang Gai. Then, when Huang Gai's ships arrived, the Allied Force set Cao Cao's fleet and camps on fire and essentially destroyed Cao Cao's army.\n\n",
    "Context:\n\nGyebangsan is a mountain of Gyeongsangnam-do, located in southeastern South Korea.\n\nInstruction:\n\nWhat is Gyebangsan?\n\nAnswer:\n\nGyebangsan is a mountain, located in southeastern South Korea.\n\n",
    "Context:\n\nRiot Games' founders Brandon \"Ryze\" Beck and Marc \"Tryndamere\" Merrill became friends while roommates at the University of Southern California, where the two studied business. Beck and Merrill believed too many video game developers diverted their focus from game to game too often, distinguishing Defense of the Ancients as an indication that games could be supported and monetized long-term. They also drew inspiration from Asian video game designers who released their games for no up-front cost and instead charged for additional perks.\n\nInstruction:\n\nGiven this paragraph about Riot Games' history, which game was used an indication that games could be supported and monetized long-term?\n\nAnswer:\n\nDefense of the Ancients (DotA)\n\n",
    "Context:\n\nTheodor Seuss Geisel (/suːs ˈɡaɪzəl, zɔɪs -/ (listen); March 2, 1904 – September 24, 1991) was an American children's author and cartoonist. He is known for his work writing and illustrating more than 60 books under the pen name Dr. Seuss (/suːs, zuːs/). His work includes many of the most popular children's books of all time, selling over 600 million copies and being translated into more than 20 languages by the time of his death.\n\nInstruction:\n\nHow many books did Dr Seuss write?\n\nAnswer:\n\nDr Seuss is known for his work writing and illustrating more than 60 books under the pen name Dr. Seuss\n\n",
    "Context:\n\nTornadoes kill an average of 179 people per year in Bangladesh, the most in the world.Reasons for this include the region's high population density, poor construction quality, and lack of tornado safety knowledge.Other areas of the world that have frequent tornadoes include South Africa, the La Plata Basin area, portions of Europe, Australia and New Zealand, and far eastern Asia.\n\nTornadoes are most common in spring and least common in winter, but tornadoes can occur any time of year that favorable conditions occur.Spring and fall experience peaks of activity as those are the seasons when stronger winds, wind shear, and atmospheric instability are present.Tornadoes are focused in the right front quadrant of landfalling tropical cyclones, which tend to occur in the late summer and autumn. Tornadoes can also be spawned as a result of eyewall mesovortices, which persist until landfall.\nsource : https://en.wikipedia.org/wiki/Tornado\n\nInstruction:\n\nThe United States has the most tornadoes of any country, nearly four times more than estimated in all of Europe then why does most death related to tornadoes occur in Bangladesh\n\nAnswer:\n\nReasons for this include Bangladesh high population density, poor construction quality, and lack of tornado safety knowledge.\n\n",
    "Context:\n\nThe 2018 UCI Track Cycling World Championships were the World Championships for track cycling in 2018. They took place in the Netherlands at the Omnisport Apeldoorn from 28 February to 4 March 2018.\n\nInstruction:\n\nWhere was the 2018 UCI Track Cycling World Championships held?\n\nAnswer:\n\nThe UCI Track Cycling World Championships were held in Omnisport Apeldoorn velodrome, in the Netherlands.\n\n",
    "Context:\n\nBritney Jean Spears (born December 2, 1981) is an American singer, actress, and dancer. Often referred to as the \"Princess of Pop\", she is credited with influencing the revival of teen pop during the late 1990s and early 2000s. After appearing in stage productions and television series, Spears signed with Jive Records in 1997 at age fifteen. Her first two studio albums, ...Baby One More Time (1999) and Oops!... I Did It Again (2000), are among the best-selling albums of all time and made Spears the best-selling teenage artist of all time. With first-week sales of over 1.3 million copies, Oops!... I Did It Again held the record for the fastest-selling album by a female artist in the United States for fifteen years. Spears adopted a more mature and provocative style for her albums Britney (2001) and In the Zone (2003), and starred in the 2002 film Crossroads.\n\nInstruction:\n\nGiven a reference text about Britney Spears, tell me when they were born and why they are famous.\n\nAnswer:\n\nBritney Spears was born December 2, 1981 she is famous for being the \"princess of pop\" and being the best selling teenage artist of all time.\n\n",
    "Context:\n\nOctavia Estelle Butler (June 22, 1947 – February 24, 2006) was an American science fiction author and a multiple recipient of the Hugo and Nebula awards. In 1995, Butler became the first science-fiction writer to receive a MacArthur Fellowship. Born in Pasadena, California, Butler was raised by her widowed mother. Extremely shy as a child, Butler found an outlet at the library reading fantasy, and in writing. She began writing science fiction as a teenager. She attended community college during the Black Power movement. While participating in a local writer's workshop, she was encouraged to attend the Clarion Workshop, then held in Pennsylvania, which focused on science fiction.\n\nInstruction:\n\nHow old was Octavia Butler when she died?\n\nAnswer:\n\nAt the time of her death in 2006, Octavia Butler was 58 years old.\n\n",
    "Context:\n\nChristoph Karl von Piacsek was a Hungarian officer in Habsburg military service during the French Revolutionary Wars. He was born in 1749 in Klobusics (Hungarian: Klobusic; Czech: Klobušice), in the commune of Trencsén, in the Kingdom of Hungary. As a Rittmeister, or captain of cavalry, in the 9th Hussar Regiment, he received the Knight's Cross of the Military Order of Maria Theresa in 1789, after combat in Tabor during Austria's wars with the Ottoman Empire, and, as a colonel, commanded the 9th Hussars, 1793–1797. In 1793, during the War of the First Coalition, the 9th Hussars were part of the Army of the Rhine (Austrian), and participated in the skirmishes at Offenbach, Knittelsbach, and Otterheim, and, later, at the storming of the Wissembourg line at Lauffenberg. Following this action, Piacsek, Major Baron von Szoreyny, and several other officers were honored.\n\nInstruction:\n\nWhen did Christoph Karl von Piacsek serve as a Hungarian officer?\n\nAnswer:\n\nChristoph Karl von Piacsek served as a Hungarian officer in Habsburg military service during the French Revolutionary Wars.\n\n",
    "Context:\n\nFlesh from these animals is often commercially sold in restaurants as \"langostino\" or sometimes dishonestly called \"lobster\" when incorporated in seafood dishes. As well as being used for human consumption, there is demand for squat lobster meat to be used as feed in fish farms and shrimp or prawn farms. This is in part because they contain astaxanthin, a pigment that helps to colour the meat of farmed salmon and trout.\nDespite their worldwide distribution and great abundance, there are few functioning fisheries for squat lobsters. Experimental fisheries have occurred in several countries, including Argentina, Mexico, and New Zealand, but commercial exploitation is currently restricted to Latin America, and chiefly to Chile. The main target species are Pleuroncodes monodon, P. planipes, and Cervimunida johni.\nIn Central America, the primary species of squat lobster targeted by fisheries is a species of Pleuroncodes. There is a great deal of confusion over both scientific names and common names, and the exact species is often unknown. In El Salvador, for instance, the commercial catch is generally referred to as \"P. planipes\", but is in fact P. monodon. Commercial fishing for squat lobsters in El Salvador began in the early 1980s; production increased markedly in the 2001 season, and has continued to grow, now making up 98% of the demersal resources landed in El Salvador, with annual catches peaking at 13,708 t in 2005. In Costa Rica, aggregations of squat lobsters are avoided, as the fishermen fear the squat lobsters will clog their nets. In Nicaragua, squat lobsters are heavily exploited, especially following a large increase in fishing effort in the 2007 season. In Panama, production reached 492 t in 2008. Chilean squat lobster fisheries initially targeted Cervimunida johni, beginning in 1953. By the mid-1960s, effort had largely switched to P. monodon. In an effort to conserve stocks, the Chilean government instituted quotas for squat lobsters, and the fishery is closely monitored. In New Zealand, Munida gregaria has been considered as a potential fisheries resource, particularly to feed farmed Chinook salmon (Oncorhynchus tshawytscha).\n\nInstruction:\n\nBased on the following paragraph on squat lobster fisheries, where do such fisheries exist today?\n\nAnswer:\n\nCommercial fisheries for squat lobsters currently exist only in Latin America, mainly in Chile due to the restriction on commercial exploitation of these animals. There are, however, a number of experimental fisheries in countries such as Argentina, Mexico, and New Zealand.\n\n",
    "Context:\n\n\"House of Love\" is a song by Australian duo Vika and Linda. It was released as the second single from her debut studio album Vika and Linda (1994). It peaked at number 98 in Australia and 32 in New Zealand.\n\nInstruction:\n\nWho wrote the song House of Love\n\nAnswer:\n\nHouse of Love is a song by Australian duo Vika and Linda. It was released as the second single from her debut studio album Vika and Linda (1994). It peaked at number 98 in Australia and 32 in New Zealand.\n\n",
    "Context:\n\nAustin FC played their first MLS match against LAFC at Banc of California Stadium on April 17, 2021, losing 0–2. The club secured its first victory the following week against the Colorado Rapids, winning 3–1. Diego Fagúndez scored the club's first goal and the following two were scored by the club's first Designated Player, Cecilio Dominguez. Their home opener was held on June 19, 2021, against the San Jose Earthquakes, a match which ended in a scoreless draw. The team secured its first ever home victory on July 1, 2021, defeating the Portland Timbers 4–1. Jon Gallagher scored the team's first home goal and the first MLS goal at Q2 Stadium.\n\nInstruction:\n\nWho scored first in Austin FC's first victory in a home game in the 2021 MLS season?\n\nAnswer:\n\nJon Gallagher scored the first goal in Austin FC's first win at home, over the Portland Timbers.\n\n",
    "Context:\n\nScarlett Ingrid Johansson (/dʒoʊˈhænsən/; born November 22, 1984) is an American actress. The world's highest-paid actress in 2018 and 2019, she has featured multiple times on the Forbes Celebrity 100 list. Time named her one of the 100 most influential people in the world in 2021. Her films have grossed over $14.3 billion worldwide, making Johansson the highest-grossing box office star of all time. She has received various accolades, including a Tony Award and a British Academy Film Award, in addition to nominations for two Academy Awards and five Golden Globe Awards.\n\nInstruction:\n\nWhen was Scarlett Johansson born?\n\nAnswer:\n\nScarlett Johansson was born November 22, 1984.\n\n"
]