[
    "Context:\n\nIn September 1998, the Fraunhofer Institute sent a letter to several developers of MP3 software stating that a license was required to \"distribute and/or sell decoders and/or encoders\". The letter claimed that unlicensed products \"infringe the patent rights of Fraunhofer and Thomson. To make, sell and/or distribute products using the [MPEG Layer-3] standard and thus our patents, you need to obtain a license under these patents from us.\"\n\nInstruction:\n\nWhat does selling unlicensed products mean that the seller is doing?\n\nAnswer:\n\ninfringe the patent rights of Fraunhofer and Thomson\n\n",
    "Context:\n\nSolar energy is radiant light and heat from the Sun harnessed using a range of ever-evolving technologies such as solar heating, photovoltaics, solar thermal energy, solar architecture and artificial photosynthesis.\n\nInstruction:\n\nWhat kind of energy consists of the light and heat provided by the Sun?\n\nAnswer:\n\nSolar energy\n\n",
    "Context:\n\nThe International Criminal Tribunal for Rwanda (ICTR) is a court under the auspices of the United Nations for the prosecution of offenses committed in Rwanda during the genocide which occurred there during April 1994, commencing on 6 April. The ICTR was created on 8 November 1994 by the Security Council of the United Nations in order to judge those people responsible for the acts of genocide and other serious violations of the international law performed in the territory of Rwanda, or by Rwandan citizens in nearby states, between 1 January and 31 December 1994.\n\nInstruction:\n\nWhat court was established to prosecute genocidal crimes in the United Nations?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nDuring the mid-2000s, the city witnessed its largest real estate boom since the Florida land boom of the 1920s. During this period, the city had well over a hundred approved high-rise construction projects in which 50 were actually built. In 2007, however, the housing market crashed causing lots of foreclosures on houses. This rapid high-rise construction, has led to fast population growth in the city's inner neighborhoods, primarily in Downtown, Brickell and Edgewater, with these neighborhoods becoming the fastest-growing areas in the city. The Miami area ranks 8th in the nation in foreclosures. In 2011, Forbes magazine named Miami the second-most miserable city in the United States due to its high foreclosure rate and past decade of corruption among public officials. In 2012, Forbes magazine named Miami the most miserable city in the United States because of a crippling housing crisis that has cost multitudes of residents their homes and jobs. The metro area has one of the highest violent crime rates in the country and workers face lengthy daily commutes.\n\nInstruction:\n\nWhen did the Florida land bust occur?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe book aroused international interest and a widespread debate, with no sharp line between scientific issues and ideological, social and religious implications. Much of the initial reaction was hostile, but Darwin had to be taken seriously as a prominent and respected name in science. There was much less controversy than had greeted the 1844 publication Vestiges of Creation, which had been rejected by scientists, but had influenced a wide public readership into believing that nature and human society were governed by natural laws. The Origin of Species as a book of wide general interest became associated with ideas of social reform. Its proponents made full use of a surge in the publication of review journals, and it was given more popular attention than almost any other scientific work, though it failed to match the continuing sales of Vestiges. Darwin's book legitimised scientific discussion of evolutionary mechanisms, and the newly coined term Darwinism was used to cover the whole range of evolutionism, not just his own ideas. By the mid-1870s, evolutionism was triumphant.\n\nInstruction:\n\nWhy did On the Origin of Species likely raise so much interest and debate?\n\nAnswer:\n\nno sharp line between scientific issues and ideological, social and religious implications\n\n",
    "Context:\n\nThe total number of Greeks living outside Greece and Cyprus today is a contentious issue. Where Census figures are available, they show around 3 million Greeks outside Greece and Cyprus. Estimates provided by the SAE - World Council of Hellenes Abroad put the figure at around 7 million worldwide. According to George Prevelakis of Sorbonne University, the number is closer to just below 5 million. Integration, intermarriage, and loss of the Greek language influence the self-identification of the Omogeneia. Important centres of the New Greek Diaspora today are London, New York, Melbourne and Toronto. In 2010, the Hellenic Parliament introduced a law that enables Diaspora Greeks in Greece to vote in the elections of the Greek state. This law was later repealed in early 2014.\n\nInstruction:\n\nWho provided the contradictory  population numbers for Greeks abroad ?\n\nAnswer:\n\nWorld Council of Hellenes Abroad\n\n",
    "Context:\n\nWide-ringed wood is often called \"second-growth\", because the growth of the young timber in open stands after the old trees have been removed is more rapid than in trees in a closed forest, and in the manufacture of articles where strength is an important consideration such \"second-growth\" hardwood material is preferred. This is particularly the case in the choice of hickory for handles and spokes. Here not only strength, but toughness and resilience are important. The results of a series of tests on hickory by the U.S. Forest Service show that:\n\nInstruction:\n\nWhat property is important to manufacturers who use \"second-growth\" hardwood?\n\nAnswer:\n\nstrength\n\n",
    "Context:\n\nDuring the Hellenistic period, many different schools of thought developed. Athens, with its multiple philosophical schools, continued to remain the center of philosophical thought. However Athens had now lost her political freedom and Hellenistic philosophy is a reflection of this new difficult period. In this political climate, Hellenistic philosophers went in search of goals such as ataraxia (un-disturbedness), autarky (self-sufficiency) and apatheia (freedom from suffering), which would allow them to wrest well-being or eudaimonia out of the most difficult turns of fortune. This occupation with the inner life, with personal inner liberty and with the pursuit of eudaimonia is what all Hellenistic philosophical schools have in common.\n\nInstruction:\n\nWhat city remained the center of philosophical thought?\n\nAnswer:\n\nAthens\n\n",
    "Context:\n\nIn 1564 a group of Norman Huguenots under the leadership of Jean Ribault established the small colony of Fort Caroline on the banks of the St. Johns River in what is today Jacksonville, Florida. The effort was the first at any permanent European settlement in the present-day continental United States, but survived only a short time. A September 1565 French naval attack against the new Spanish colony at St. Augustine failed when its ships were hit by a hurricane on their way to the Spanish encampment at Fort Matanzas. Hundreds of French soldiers were stranded and surrendered to the numerically inferior Spanish forces led by Pedro Menendez. Menendez proceeded to massacre the defenseless Huguenots, after which he wiped out the Fort Caroline garrison.\n\nInstruction:\n\nWhich army attacked and destroyed this colony?\n\nAnswer:\n\nSpanish\n\n",
    "Context:\n\nFor over a century, New Haven citizens had fought in the colonial militia alongside regular British forces, as in the French and Indian War. As the American Revolution approached, General David Wooster and other influential residents hoped that the conflict with the government in Britain could be resolved short of rebellion. On 23 April 1775, which is still celebrated in New Haven as Powder House Day, the Second Company, Governor's Foot Guard, of New Haven entered the struggle against the governing British parliament. Under Captain Benedict Arnold, they broke into the powder house to arm themselves and began a three-day march to Cambridge, Massachusetts. Other New Haven militia members were on hand to escort George Washington from his overnight stay in New Haven on his way to Cambridge. Contemporary reports, from both sides, remark on the New Haven volunteers' professional military bearing, including uniforms.\n\nInstruction:\n\nWhat is the name of the New Haven Militia that fought on during Powder House Day?\n\nAnswer:\n\nGovernor's Foot Guard\n\n",
    "Context:\n\nThe province of France has produced a large number of preachers. The conferences of Notre-Dame-de-Paris were inaugurated by Père Lacordaire. The Dominicans of the province of France furnished Lacordaire (1835–1836, 1843–1851), Jacques Monsabré (1869–1870, 1872–1890), Joseph Ollivier (1871, 1897), Thomas Etourneau (1898–1902).[citation needed] Since 1903 the pulpit of Notre Dame has been occupied by a succession of Dominicans. Père Henri Didon (d. 1900) was a Dominican. The house of studies of the province of France publishes L'Année Dominicaine (founded 1859), La Revue des Sciences Philosophiques et Theologiques (1907), and La Revue de la Jeunesse (1909). French Dominicans founded and administer the École Biblique et Archéologique française de Jérusalem founded in 1890 by Père Marie-Joseph Lagrange O.P. (1855–1938), one of the leading international centres for Biblical research. It is at the École Biblique that the famed Jerusalem Bible (both editions) was prepared.\n\nInstruction:\n\nWhat is the name of another French Dominican friar during this time?\n\nAnswer:\n\nThomas Etourneau\n\n",
    "Context:\n\n\"The most widespread form of interspecies bonding occurs between humans and dogs\" and the keeping of dogs as companions, particularly by elites, has a long history. (As a possible example, at the Natufian culture site of Ain Mallaha in Israel, dated to 12,000 BC, the remains of an elderly human and a four-to-five-month-old puppy were found buried together). However, pet dog populations grew significantly after World War II as suburbanization increased. In the 1950s and 1960s, dogs were kept outside more often than they tend to be today (using the expression \"in the doghouse\" to describe exclusion from the group signifies the distance between the doghouse and the home) and were still primarily functional, acting as a guard, children's playmate, or walking companion. From the 1980s, there have been changes in the role of the pet dog, such as the increased role of dogs in the emotional support of their human guardians. People and dogs have become increasingly integrated and implicated in each other's lives, to the point where pet dogs actively shape the way a family and home are experienced.\n\nInstruction:\n\nWhat two species have the most widespread bonding?\n\nAnswer:\n\nhumans and dogs\n\n",
    "Context:\n\nHindu philosophy also includes several sub-schools of theistic philosophies that integrate ideas from two or more of the six orthodox philosophies, such as the realism of the Nyāya, the naturalism of the Vaiśeṣika, the dualism of the Sāṅkhya, the monism and knowledge of Self as essential to liberation of Advaita, the self-discipline of yoga and the asceticism and elements of theistic ideas. Examples of such schools include Pāśupata Śaiva, Śaiva siddhānta, Pratyabhijña, Raseśvara and Vaiṣṇava. Some sub-schools share Tantric ideas with those found in some Buddhist traditions. The ideas of these sub-schools are found in the Puranas and Āgamas.\n\nInstruction:\n\nWhich orthodox Hindu philosophy concerns realism?\n\nAnswer:\n\nNyāya\n\n",
    "Context:\n\nMost analyses place Kerry's voting record on the left within the Senate Democratic caucus. During the 2004 presidential election he was portrayed as a staunch liberal by conservative groups and the Bush campaign, who often noted that in 2003 Kerry was rated the National Journal's top Senate liberal. However, that rating was based only upon voting on legislation within that past year. In fact, in terms of career voting records, the National Journal found that Kerry is the 11th most liberal member of the Senate. Most analyses find that Kerry is at least slightly more liberal than the typical Democratic Senator. Kerry has stated that he opposes privatizing Social Security, supports abortion rights for adult women and minors, supports same-sex marriage, opposes capital punishment except for terrorists, supports most gun control laws, and is generally a supporter of trade agreements. Kerry supported the North American Free Trade Agreement and Most Favored Nation status for China, but opposed the Central American Free Trade Agreement.[citation needed]\n\nInstruction:\n\nWho said Kerry was the 'top Senate liberal'?\n\nAnswer:\n\nthe National Journal\n\n",
    "Context:\n\nThe Soviets also helped Germany to avoid British naval blockades by providing a submarine base, Basis Nord, in the northern Soviet Union near Murmansk. This also provided a refueling and maintenance location, and a takeoff point for raids and attacks on shipping. In addition, the Soviets provided Germany with access to the Northern Sea Route for both cargo ships and raiders (though only the commerce raider Komet used the route before the German invasion), which forced Britain to protect sea lanes in both the Atlantic and the Pacific.\n\nInstruction:\n\nWhat did the Germans use to avoid British blockades?\n\nAnswer:\n\na submarine base\n\n",
    "Context:\n\nBy 1960 African Americans comprised 16.45% of the state's population. It was not until after the mid-1960s and passage of the Voting Rights Act of 1965 that they were able to vote in full again, but new devices, such as at-large commission city governments, had been adopted in several jurisdictions to limit their political participation. Former Gov. Winfield Dunn and former U.S. Sen. Bill Brock wins in 1970 helped make the Republican Party competitive among whites for the statewide victory. Tennessee has selected governors from different parties since 1970. Increasingly the Republican Party has become the party of white conservatives.\n\nInstruction:\n\nIn 1960, what group made up 16.45% of Tennessee's population?\n\nAnswer:\n\nAfrican Americans\n\n",
    "Context:\n\nIn Islam, dogs are viewed as unclean because they are viewed as scavengers. In 2015 city councillor Hasan Küçük of The Hague called for dog ownership to be made illegal in that city. Islamic activists in Lérida, Spain, lobbied for dogs to be kept out of Muslim neighborhoods, saying their presence violated Muslims' religious freedom. In Britain, police sniffer dogs are carefully used, and are not permitted to contact passengers, only their luggage. They are required to wear leather dog booties when searching mosques or Muslim homes.\n\nInstruction:\n\nWhat are sniffer dogs used by British police allowed to touch instead of a passenger?\n\nAnswer:\n\ntheir luggage\n\n",
    "Context:\n\nThe '98 season would begin on a somber note with the death of legendary broadcaster Harry Caray. After the retirement of Sandberg and the trade of Dunston, the Cubs had holes to fill and the signing of Henry Rodríguez, known affectionately as \"H-Rod\" to bat cleanup provided protection for Sammy Sosa in the lineup, as Rodriguez slugged 31 round-trippers in his first season in Chicago. Kevin Tapani led the club with a career high 19 wins, Rod Beck anchored a strong bullpen and Mark Grace turned in one of his best seasons. The Cubs were swamped by media attention in 1998, and the team's two biggest headliners were Sosa and rookie flamethrower Kerry Wood. Wood's signature performance was one-hitting the Houston Astros, a game in which he tied the major league record of 20 strikeouts in nine innings. His torrid strikeout numbers earned Wood the nickname \"Kid K,\" and ultimately earned him the 1998 NL Rookie of the Year award. Sosa caught fire in June, hitting a major league record 20 home runs in the month, and his home run race with Cardinals slugger Mark McGwire transformed the pair into international superstars in a matter of weeks. McGwire finished the season with a new major league record of 70 home runs, but Sosa's .308 average and 66 homers earned him the National League MVP Award. After a down-to-the-wire Wild Card chase with the San Francisco Giants, Chicago and San Francisco ended the regular season tied, and thus squared off in a one-game playoff at Wrigley Field in which third baseman Gary Gaetti hit the eventual game winning homer. The win propelled the Cubs into the postseason once again with a 90–73 regular season tally. Unfortunately, the bats went cold in October, as manager Jim Riggleman's club batted .183 and scored only four runs en route to being swept by Atlanta. On a positive note, the home run chase between Sosa, McGwire and Ken Griffey, Jr. helped professional baseball to bring in a new crop of fans as well as bringing back some fans who had been disillusioned by the 1994 strike. The Cubs retained many players who experienced career years in '98, and after a fast start in 1999, they collapsed again (starting with being swept at the hands of the cross-town White Sox in mid-June) and finished in the bottom of the division for the next two seasons.\n\nInstruction:\n\nWhat legendary broadcaster died in the '98 season?\n\nAnswer:\n\nHarry Caray\n\n",
    "Context:\n\nThe scale of humanitarian aid to the poor and unstable regions of the world grows, but it is highly vulnerable to corruption, with food aid, construction and other highly valued assistance as the most at risk. Food aid can be directly and physically diverted from its intended destination, or indirectly through the manipulation of assessments, targeting, registration and distributions to favor certain groups or individuals.\n\nInstruction:\n\nAlong with food aid, what is most at risk in these countries?\n\nAnswer:\n\nconstruction\n\n",
    "Context:\n\nMusic, photos and videos can be played from standard USB mass storage devices, Xbox 360 proprietary storage devices (such as memory cards or Xbox 360 hard drives), and servers or computers with Windows Media Center or Windows XP with Service pack 2 or higher within the local-area network in streaming mode. As the Xbox 360 uses a modified version of the UPnP AV protocol, some alternative UPnP servers such as uShare (part of the GeeXboX project) and MythTV can also stream media to the Xbox 360, allowing for similar functionality from non-Windows servers. This is possible with video files up to HD-resolution and with several codecs (MPEG-2, MPEG-4, WMV) and container formats (WMV, MOV, TS).\n\nInstruction:\n\nWhat PC operating system is required to stream content to a 360?\n\nAnswer:\n\nWindows XP with Service pack 2 or higher\n\n",
    "Context:\n\nThe terms 'federalism' and 'confederalism' both have a root in the Latin word foedus, meaning treaty, pact or covenant. Their common meaning until the late eighteenth century was a simple league or inter-governmental relationship among sovereign states based upon a treaty. They were therefore initially synonyms. It was in this sense that James Madison in Federalist 39 had referred to the new United States as 'neither a national nor a federal Constitution, but a composition of both' (ie. neither a single large unitary state nor a league/confederation among several small states, but a hybrid of the two). In the course of the nineteenth century the meaning of federalism would come to shift, strengthening to refer uniquely to the novel compound political form, while the meaning of confederalism would remain at a league of states. Thus, this article relates to the modern usage of the word 'federalism'.\n\nInstruction:\n\nWhat did James Madison referred to the new United Nations as? \n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nTextual criticism is a branch of textual scholarship, philology, and literary criticism that is concerned with the identification of textual variants in either manuscripts or printed books. Ancient scribes made alterations when copying manuscripts by hand. Given a manuscript copy, several or many copies, but not the original document, the textual critic might seek to reconstruct the original text (the archetype or autograph) as closely as possible. The same processes can be used to attempt to reconstruct intermediate versions, or recensions, of a document's transcription history. The ultimate objective of the textual critic's work is the production of a \"critical edition\" containing a scholarly curated text.\n\nInstruction:\n\nWhy are there differences in modern copies of the same text?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe United Nations Organization and its children's agency UNICEF withdrew their staff, saying that it wasn't sure the event would help its mission of raising awareness of conditions for children and amid concerns that the relay would be used as a propaganda stunt. \"It was unconscionable,\" said a UN official who was briefed on the arguments. North Korea is frequently listed among the world’s worst offenders against human rights.\n\nInstruction:\n\nBoth organizations withdrew what?\n\nAnswer:\n\ntheir staff\n\n",
    "Context:\n\nHowever, since the end of the Cold War, as the North Atlantic Treaty Organization (NATO) has moved much of its defence focus \"out of area\", the Canadian military has also become more deeply engaged in international security operations in various other parts of the world – most notably in Afghanistan since 2002.\n\nInstruction:\n\nWhat Treaty is the CAF not part of?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nRemodelling of the structure began in 1762. After his accession to the throne in 1820, King George IV continued the renovation with the idea in mind of a small, comfortable home. While the work was in progress, in 1826, the King decided to modify the house into a palace with the help of his architect John Nash. Some furnishings were transferred from Carlton House, and others had been bought in France after the French Revolution. The external façade was designed keeping in mind the French neo-classical influence preferred by George IV. The cost of the renovations grew dramatically, and by 1829 the extravagance of Nash's designs resulted in his removal as architect. On the death of George IV in 1830, his younger brother King William IV hired Edward Blore to finish the work. At one stage, William considered converting the palace into the new Houses of Parliament, after the destruction of the Palace of Westminster by fire in 1834.\n\nInstruction:\n\nWho did King William IV hired to finish the work after Nash was fired?\n\nAnswer:\n\nEdward Blore\n\n",
    "Context:\n\nThe Americo-Liberian settlers did not identify with the indigenous peoples they encountered, especially those in communities of the more isolated \"bush.\" They knew nothing of their cultures, languages or animist religion. Encounters with tribal Africans in the bush often developed as violent confrontations. The colonial settlements were raided by the Kru and Grebo people from their inland chiefdoms. Because of feeling set apart and superior by their culture and education to the indigenous peoples, the Americo-Liberians developed as a small elite that held on to political power. It excluded the indigenous tribesmen from birthright citizenship in their own lands until 1904, in a repetition of the United States' treatment of Native Americans. Because of the cultural gap between the groups and assumption of superiority of western culture, the Americo-Liberians envisioned creating a western-style state to which the tribesmen should assimilate. They encouraged religious organizations to set up missions and schools to educate the indigenous peoples.\n\nInstruction:\n\nWhat were americo-liberians encounters like with tribal Africans\"\n\nAnswer:\n\nviolent confrontations.\n\n",
    "Context:\n\nMany hunter-gatherers consciously manipulate the landscape through cutting or burning undesirable plants while encouraging desirable ones, some even going to the extent of slash-and-burn to create habitat for game animals. These activities are on an entirely different scale to those associated with agriculture, but they are nevertheless domestication on some level. Today, almost all hunter-gatherers depend to some extent upon domesticated food sources either produced part-time or traded for products acquired in the wild.\n\nInstruction:\n\nWhat technique do they use to make animal habitats?\n\nAnswer:\n\nslash-and-burn\n\n",
    "Context:\n\nWeinrich et al. (1993) and Weinberg et al. (1994) criticized the scale for lumping individuals who are different based on different dimensions of sexuality into the same categories. When applying the scale, Kinsey considered two dimensions of sexual orientation: overt sexual experience and psychosexual reactions. Valuable information was lost by collapsing the two values into one final score. A person who has only predominantly same sex reactions is different from someone with relatively little reaction but lots of same sex experience. It would have been quite simple for Kinsey to have measured the two dimensions separately and report scores independently to avoid loss of information. Furthermore, there are more than two dimensions of sexuality to be considered. Beyond behavior and reactions, one could also assess attraction, identification, lifestyle etc. This is addressed by the Klein Sexual Orientation Grid.\n\nInstruction:\n\nWhat did both Weinrich and Weinberg critisize the KInsey scale for?\n\nAnswer:\n\nlumping individuals who are different based on different dimensions of sexuality into the same categories.\n\n",
    "Context:\n\nFormer members Heather and Gary Botting compare the cultural paradigms of the religion to George Orwell's Nineteen Eighty-four, and Alan Rogerson describes the religion's leadership as totalitarian. Other critics charge that by disparaging individual decision-making, the religion's leaders cultivate a system of unquestioning obedience in which Witnesses abrogate all responsibility and rights over their personal lives. Critics also accuse the religion's leaders of exercising \"intellectual dominance\" over Witnesses, controlling information and creating \"mental isolation\", which former Governing Body member Raymond Franz argued were all elements of mind control.\n\nInstruction:\n\nWho between Heather and Gary Botting first wanted out of the Witnesses?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nA generation later, the Irish Anglican bishop, George Berkeley (1685–1753), determined that Locke's view immediately opened a door that would lead to eventual atheism. In response to Locke, he put forth in his Treatise Concerning the Principles of Human Knowledge (1710) an important challenge to empiricism in which things only exist either as a result of their being perceived, or by virtue of the fact that they are an entity doing the perceiving. (For Berkeley, God fills in for humans by doing the perceiving whenever humans are not around to do it.) In his text Alciphron, Berkeley maintained that any order humans may see in nature is the language or handwriting of God. Berkeley's approach to empiricism would later come to be called subjective idealism.\n\nInstruction:\n\nWhom did Locke claim created order?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nHighbury could hold more than 60,000 spectators at its peak, and had a capacity of 57,000 until the early 1990s. The Taylor Report and Premier League regulations obliged Arsenal to convert Highbury to an all-seater stadium in time for the 1993–94 season, thus reducing the capacity to 38,419 seated spectators. This capacity had to be reduced further during Champions League matches to accommodate additional advertising boards, so much so that for two seasons, from 1998 to 2000, Arsenal played Champions League home matches at Wembley, which could house more than 70,000 spectators.\n\nInstruction:\n\nHow many advertising board does Wembley have?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nHigh-power LEDs (HP-LEDs) or high-output LEDs (HO-LEDs) can be driven at currents from hundreds of mA to more than an ampere, compared with the tens of mA for other LEDs. Some can emit over a thousand lumens. LED power densities up to 300 W/cm2 have been achieved. Since overheating is destructive, the HP-LEDs must be mounted on a heat sink to allow for heat dissipation. If the heat from a HP-LED is not removed, the device will fail in seconds. One HP-LED can often replace an incandescent bulb in a flashlight, or be set in an array to form a powerful LED lamp.\n\nInstruction:\n\nWhy must High-power LEDs be mounted on a heat sink?\n\nAnswer:\n\nto allow for heat dissipation\n\n",
    "Context:\n\nThe Augustan settlement built upon a cultural shift in Roman society. In the middle Republican era, even Scipio's tentative hints that he might be Jupiter's special protege sat ill with his colleagues. Politicians of the later Republic were less equivocal; both Sulla and Pompey claimed special relationships with Venus. Julius Caesar went further, and claimed her as his ancestress. Such claims suggested personal character and policy as divinely inspired; an appointment to priesthood offered divine validation. In 63 BC, Julius Caesar's appointment as pontifex maximus \"signaled his emergence as a major player in Roman politics\". Likewise, political candidates could sponsor temples, priesthoods and the immensely popular, spectacular public ludi and munera whose provision became increasingly indispensable to the factional politics of the Late Republic. Under the principate, such opportunities were limited by law; priestly and political power were consolidated in the person of the princeps (\"first citizen\").\n\nInstruction:\n\nIn what year was Cesar made pontifex maximus?\n\nAnswer:\n\n63 BC\n\n",
    "Context:\n\nSpain is a unitary state with a high level of decentralisation, often regarded as a federal system in all but name or a \"federation without federalism\". The country has been quoted as being \"an extraordinarily decentralized country\", with the central government accounting for just 18% of public spending, 38% for the regional governments, 13% for the local councils, and the remaining 31% for the social security system. The current Spanish constitution has been implemented in such a way that, in many respects, Spain can be compared to countries which are undeniably federal.\n\nInstruction:\n\nWhat type of state isn't Spain?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe Aeneid appears to have been a great success. Virgil is said to have recited Books 2, 4, and 6 to Augustus; and Book 6 apparently caused Augustus' sister Octavia to faint. Although the truth of this claim is subject to scholarly scepticism, it has served as a basis for later art, such as Jean-Baptiste Wicar's Virgil Reading the Aeneid.\n\nInstruction:\n\nWhat was the name of a scholar that doubted claims that Augustus' sister fainted when Virgil recited the Aeneid?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nCéloron's expedition force consisted of about 200 Troupes de la marine and 30 Indians. The expedition covered about 3,000 miles (4,800 km) between June and November 1749. It went up the St. Lawrence, continued along the northern shore of Lake Ontario, crossed the portage at Niagara, and followed the southern shore of Lake Erie. At the Chautauqua Portage (near present-day Barcelona, New York), the expedition moved inland to the Allegheny River, which it followed to the site of present-day Pittsburgh. There Céloron buried lead plates engraved with the French claim to the Ohio Country. Whenever he encountered British merchants or fur-traders, Céloron informed them of the French claims on the territory and told them to leave.\n\nInstruction:\n\nWhat wasn't extent of Celeron's expedition?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nMilton Winternitz led the Yale Medical School as its dean from 1920 to 1935. Dedicated to the new scientific medicine established in Germany, he was equally fervent about \"social medicine\" and the study of humans in their culture and environment. He established the \"Yale System\" of teaching, with few lectures and fewer exams, and strengthened the full-time faculty system; he also created the graduate-level Yale School of Nursing and the Psychiatry Department, and built numerous new buildings. Progress toward his plans for an Institute of Human Relations, envisioned as a refuge where social scientists would collaborate with biological scientists in a holistic study of humankind, unfortunately lasted for only a few years before the opposition of resentful anti-Semitic colleagues drove him to resign.\n\nInstruction:\n\nWho was dean of Yale Medical School from 1920 to 1935?\n\nAnswer:\n\nMilton Winternitz\n\n",
    "Context:\n\nWinters are cold and damp, and prevailing wind patterns that blow offshore minimize the moderating effects of the Atlantic Ocean; yet the Atlantic and the partial shielding from colder air by the Appalachians keep the city warmer in the winter than inland North American cities at similar or lesser latitudes such as Pittsburgh, Cincinnati, and Indianapolis. The daily mean temperature in January, the area's coldest month, is 32.6 °F (0.3 °C); however, temperatures usually drop to 10 °F (−12 °C) several times per winter, and reach 50 °F (10 °C) several days each winter month. Spring and autumn are unpredictable and can range from chilly to warm, although they are usually mild with low humidity. Summers are typically warm to hot and humid, with a daily mean temperature of 76.5 °F (24.7 °C) in July and an average humidity level of 72%. Nighttime conditions are often exacerbated by the urban heat island phenomenon, while daytime temperatures exceed 90 °F (32 °C) on average of 17 days each summer and in some years exceed 100 °F (38 °C). In the warmer months, the dew point, a measure of atmospheric moisture, ranges from 57.3 °F (14.1 °C) in June to 62.0 °F (16.7 °C) in August. Extreme temperatures have ranged from −15 °F (−26 °C), recorded on February 9, 1934, up to 106 °F (41 °C) on July 9, 1936.\n\nInstruction:\n\nWhat is New York City's daily January mean temperature in degrees celsius?\n\nAnswer:\n\n0.3\n\n",
    "Context:\n\nAt the time structures such as Lie algebras and hyperbolic quaternions drew attention to the need to expand algebraic structures beyond the associatively multiplicative class. In a review Alexander Macfarlane wrote: \"The main idea of the work is not unification of the several methods, nor generalization of ordinary algebra so as to include them, but rather the comparative study of their several structures.\" In a separate review, G. B. Mathews wrote, \"It possesses a unity of design which is really remarkable, considering the variety of its themes.\"\n\nInstruction:\n\nWhat did reviewer GB Mathews say algebraic structures possessed? \n\nAnswer:\n\nunity of design\n\n",
    "Context:\n\nPtolemy's family ruled Egypt until the Roman conquest of 30 BC. All the male rulers of the dynasty took the name Ptolemy. Ptolemaic queens, some of whom were the sisters of their husbands, were usually called Cleopatra, Arsinoe or Berenice. The most famous member of the line was the last queen, Cleopatra VII, known for her role in the Roman political battles between Julius Caesar and Pompey, and later between Octavian and Mark Antony. Her suicide at the conquest by Rome marked the end of Ptolemaic rule in Egypt though Hellenistic culture continued to thrive in Egypt throughout the Roman and Byzantine periods until the Muslim conquest.\n\nInstruction:\n\nCleopatra, Arsinoe or Berenice were common names for whom?\n\nAnswer:\n\nPtolemaic queens\n\n",
    "Context:\n\nIn 1939, c. 1,300,000 people lived in Warsaw, but in 1945 – only 420,000. During the first years after the war, the population growth was c. 6%, so shortly the city started to suffer from the lack of flats and of areas for new houses. The first remedial measure was the Warsaw area enlargement (1951) – but the city authorities were still forced to introduce residency registration limitations: only the spouses and children of the permanent residents as well as some persons of public importance (like renowned specialists) were allowed to get the registration, hence halving the population growth in the following years. It also bolstered some kind of conviction among Poles that Varsovians thought of themselves as better only because they lived in the capital. Unfortunately this belief still lives on in Poland (although not as much as it used to be) – even though since 1990 there are no limitations to residency registration anymore.\n\nInstruction:\n\nWhat are there no longer limitations on since 1945?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe Theater District is a 17-block area in the center of downtown Houston that is home to the Bayou Place entertainment complex, restaurants, movies, plazas, and parks. Bayou Place is a large multilevel building containing full-service restaurants, bars, live music, billiards, and Sundance Cinema. The Bayou Music Center stages live concerts, stage plays, and stand-up comedy. Space Center Houston is the official visitors' center of NASA's Lyndon B. Johnson Space Center. The Space Center has many interactive exhibits including moon rocks, a shuttle simulator, and presentations about the history of NASA's manned space flight program. Other tourist attractions include the Galleria (Texas's largest shopping mall, located in the Uptown District), Old Market Square, the Downtown Aquarium, and Sam Houston Race Park.\n\nInstruction:\n\nWhat is the Galleria the largest of in Texas?\n\nAnswer:\n\nshopping mall\n\n",
    "Context:\n\nFor temperature studies, subjects must remain awake but calm and semi-reclined in near darkness while their rectal temperatures are taken continuously. Though variation is great among normal chronotypes, the average human adult's temperature reaches its minimum at about 05:00 (5 a.m.), about two hours before habitual wake time. Baehr et al. found that, in young adults, the daily body temperature minimum occurred at about 04:00 (4 a.m.) for morning types but at about 06:00 (6 a.m.) for evening types. This minimum occurred at approximately the middle of the eight hour sleep period for morning types, but closer to waking in evening types.\n\nInstruction:\n\nAt what time does the average adult human reach his lowest temperature?\n\nAnswer:\n\n05:00\n\n",
    "Context:\n\nThe Crusades brought a shift in European trade routes that accelerated the decline of Kievan Rus'. In 1204 the forces of the Fourth Crusade sacked Constantinople, making the Dnieper trade route marginal. At the same time the Teutonic Knights (of the Northern Crusades) were conquering the Baltic region and threatening the Lands of Novgorod. Concurrently with it the Ruthenian Federation of Kievan Rus' started to disintegrate into smaller principalities as the Rurik dynasty grew. The local Orthodox Christianity of Kievan Rus', while struggling to establish itself in the predominantly pagan state and losing its main base in Constantinople was on the brink of extinction. Some of the main regional centres that developed later were Novgorod, Chernigov, Galich, Kiev, Ryazan, Vladimir-upon-Klyazma, Vladimir of Volyn and Polotsk.\n\nInstruction:\n\nWhat helped speed up the decline of the Kievan Rus?\n\nAnswer:\n\nThe Crusades\n\n",
    "Context:\n\nWhile Nasser was in Syria, King Saud planned to have him assassinated on his return flight to Cairo. On 4 March, Nasser addressed the masses in Damascus and waved before them the Saudi check given to Syrian security chief and Nasser supporter Abdel Hamid Sarraj to shoot down Nasser's plane. As a consequence of Saud's scheme, he was forced by senior members of the Saudi royal family to informally cede most of his powers to his brother, King Faisal, a major opponent of Nasser and advocate for pan-Islamic unity over pan-Arabism.\n\nInstruction:\n\nWho tried to assassinate Nasser?\n\nAnswer:\n\nKing Saud\n\n",
    "Context:\n\nFrance took control of Algeria in 1830 but began in earnest to rebuild its worldwide empire after 1850, concentrating chiefly in North and West Africa, as well as South-East Asia, with other conquests in Central and East Africa, as well as the South Pacific. Republicans, at first hostile to empire, only became supportive when Germany started to build her own colonial empire. As it developed, the new empire took on roles of trade with France, supplying raw materials and purchasing manufactured items, as well as lending prestige to the motherland and spreading French civilization and language as well as Catholicism. It also provided crucial manpower in both World Wars.\n\nInstruction:\n\nWhen did France begin in earnest to rebuild its global empire?\n\nAnswer:\n\n1850\n\n",
    "Context:\n\nInformation had been kept on digital tape for five years, with Kahle occasionally allowing researchers and scientists to tap into the clunky database. When the archive reached its fifth anniversary, it was unveiled and opened to the public in a ceremony at the University of California, Berkeley.\n\nInstruction:\n\nAt what milestone was the archive made clunky?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nInitially, the vocalists consisted of artists such as Frank Sinatra, Doris Day, Johnny Mathis, Connie Francis, Nat King Cole, Perry Como, and others. The custom recordings were usually instrumental versions of current or recent rock and roll or pop hit songs, a move intended to give the stations more mass appeal without selling out. Some stations would also occasionally play earlier big band-era recordings from the 1940s and early 1950s.\n\nInstruction:\n\nWhat type of covers of pop and rock songs were usually played on adult contemporary?\n\nAnswer:\n\ninstrumental\n\n",
    "Context:\n\nOther local colleges and universities include Concordia University Ann Arbor, a Lutheran liberal-arts institution; a campus of the University of Phoenix; and Cleary University, a private business school. Washtenaw Community College is located in neighboring Ann Arbor Township. In 2000, the Ave Maria School of Law, a Roman Catholic law school established by Domino's Pizza founder Tom Monaghan, opened in northeastern Ann Arbor, but the school moved to Ave Maria, Florida in 2009, and the Thomas M. Cooley Law School acquired the former Ave Maria buildings for use as a branch campus.\n\nInstruction:\n\nWhat community college is located in Ann Arbor?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nFreedom of the press is ostensibly officially guaranteed by the government, but independent press outlets remain restricted, as does a substantial amount of web content. According to the Institute for War & Peace Reporting, access is blocked to local and foreign websites including avesta.tj, Tjknews.com, ferghana.ru, centrasia.ru and journalists are often obstructed from reporting on controversial events. In practice, no public criticism of the regime is tolerated and all direct protest is severely suppressed and does not receive coverage in the local media.\n\nInstruction:\n\nAccess is granted to local and foreign what?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe Ministry of Defence and the Defence Forces have been working on a cyberwarfare and defence formation for some years now. In 2007, a military doctrine of an e-military of Estonia was officially introduced as the country was under massive cyberattacks in 2007. The proposed aim of the e-military is to secure the vital infrastructure and e-infrastructure of Estonia. The main cyber warfare facility is the Computer Emergency Response Team of Estonia (CERT), founded in 2006. The organisation operates on security issues in local networks.\n\nInstruction:\n\nWhen was the Computer Emergency Response Team of Estonia established?\n\nAnswer:\n\n2006\n\n",
    "Context:\n\nIn psychology, memory is the process in which information is encoded, stored, and retrieved. Encoding allows information from the outside world to be sensed in the form of chemical and physical stimuli. In the first stage the information must be changed so that it may be put into the encoding process. Storage is the second memory stage or process. This entails that information is maintained over short periods of time. Finally the third process is the retrieval of information that has been stored. Such information must be located and returned to the consciousness. Some retrieval attempts may be effortless due to the type of information, and other attempts to remember stored information may be more demanding for various reasons.\n\nInstruction:\n\nWhat is the third process that happens during the psychology process?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe spectrum emitted by a blackbody radiator at temperatures of incandescent bulbs does not match the sensitivity characteristics of the human eye; the light emitted does not appear white, and most is not in the range of wavelengths at which the eye is most sensitive. Tungsten filaments radiate mostly infrared radiation at temperatures where they remain solid – below 3,695 K (3,422 °C; 6,191 °F). Donald L. Klipstein explains it this way: \"An ideal thermal radiator produces visible light most efficiently at temperatures around 6,300 °C (6,600 K; 11,400 °F). Even at this high temperature, a lot of the radiation is either infrared or ultraviolet, and the theoretical luminous efficacy (LER) is 95 lumens per watt.\" No known material can be used as a filament at this ideal temperature, which is hotter than the sun's surface. An upper limit for incandescent lamp luminous efficacy (LER) is around 52 lumens per watt, the theoretical value emitted by tungsten at its melting point.\n\nInstruction:\n\nWhat appears white to the human eye when it is emitted?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nGreeks in pre-Roman Gaul were mostly limited to the Mediterranean coast of Provence. The first Greek colony in the region was Massalia, which became one of the largest trading ports of Mediterranean by the 4th century BCE with 6,000 inhabitants. Massalia was also the local hegemon, controlling various coastal Greek cities like Nice and Agde. The coins minted in Massalia have been found in all parts of Ligurian-Celtic Gaul. Celtic coinage was influenced by Greek designs, and Greek letters can be found on various Celtic coins, especially those of Southern France. Traders from Massalia ventured inland deep into France on the Rivers Durance and Rhône, and established overland trade routes deep into Gaul, and to Switzerland and Burgundy. The Hellenistic period saw the Greek alphabet spread into southern Gaul from Massalia (3rd and 2nd centuries BCE) and according to Strabo, Massalia was also a center of education, where Celts went to learn Greek. A staunch ally of Rome, Massalia retained its independence until it sided with Pompey in 49 BCE and was then taken by Caesar's forces.\n\nInstruction:\n\nHow many inhabitants were in Massalia?\n\nAnswer:\n\n6,000\n\n",
    "Context:\n\nThus, while the rest of Europe saw revolutionary uprisings, the Swiss drew up a constitution which provided for a federal layout, much of it inspired by the American example. This constitution provided for a central authority while leaving the cantons the right to self-government on local issues. Giving credit to those who favoured the power of the cantons (the Sonderbund Kantone), the national assembly was divided between an upper house (the Council of States, two representatives per canton) and a lower house (the National Council, with representatives elected from across the country). Referenda were made mandatory for any amendment of this constitution.\n\nInstruction:\n\nWhat example inspired much of a new Swiss constitution providing for a federal layout?\n\nAnswer:\n\nAmerican\n\n",
    "Context:\n\nIn 1870, after France attacked Prussia, Prussia and its new allies in Southern Germany (among them Bavaria) were victorious in the Franco-Prussian War. It created the German Empire in 1871 as a German nation-state, effectively excluding the multi-ethnic Austrian Habsburg monarchy and Liechtenstein. Integrating the Austrians nevertheless remained a strong desire for many people of Germany and Austria, especially among the liberals, the social democrats and also the Catholics who were a minority within the Protestant Germany.\n\nInstruction:\n\nWho did the Catholics want to exclude from the German Empire?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAnother occasionally used criterion for discriminating dialects from languages is that of linguistic authority, a more sociolinguistic notion. According to this definition, two varieties are considered dialects of the same language if (under at least some circumstances) they would defer to the same authority regarding some questions about their language. For instance, to learn the name of a new invention, or an obscure foreign species of plant, speakers of Bavarian German and East Franconian German might each consult a German dictionary or ask a German-speaking expert in the subject. By way of contrast, although Yiddish is classified by linguists as a language in the \"Middle High German\" group of languages, a Yiddish speaker would not consult a German dictionary to determine the word to use in such a case.\n\nInstruction:\n\nWhy is Yiddish not a dialect of German?\n\nAnswer:\n\na Yiddish speaker would not consult a German dictionary\n\n",
    "Context:\n\nThe Twelve Tables forbade any harmful incantation (malum carmen, or 'noisome metrical charm'); this included the \"charming of crops from one field to another\" (excantatio frugum) and any rite that sought harm or death to others. Chthonic deities functioned at the margins of Rome's divine and human communities; although sometimes the recipients of public rites, these were conducted outside the sacred boundary of the pomerium. Individuals seeking their aid did so away from the public gaze, during the hours of darkness. Burial grounds and isolated crossroads were among the likely portals. The barrier between private religious practices and \"magic\" is permeable, and Ovid gives a vivid account of rites at the fringes of the public Feralia festival that are indistinguishable from magic: an old woman squats among a circle of younger women, sews up a fish-head, smears it with pitch, then pierces and roasts it to \"bind hostile tongues to silence\". By this she invokes Tacita, the \"Silent One\" of the underworld.\n\nInstruction:\n\nWhat forbid harmful  incantations?\n\nAnswer:\n\nTwelve Tables\n\n",
    "Context:\n\nSocieties tend to come and go, of course, depending on the special enthusiasms of the masters and boys in the school at the time, but some have been in existence many years. Those in existence at present include: Aeronautical, African, Alexander Cozens (Art), Amnesty, Archeological, Architectural, Astronomy, Banks (conservation), Caledonian, Cheese, Classical, Comedy, Cosmopolitan, Debating, Design, Entrepreneurship, Geographical, Henry Fielding, Hispanic, History, Keynes (economics), Law, Literary, Mathematical, Medical, Middle Eastern, Model United Nations, Modern Languages, Oriental, Orwell (left-wing), Simeon (Christian), Parry (music), Photographic, Political, Praed (poetry), Rock (music), Rous (equestrian), Salisbury (diplomatic), Savile (Rare Books and Manuscripts), Shelley, Scientific, Sports, Tech Club, Theatre, Wellington (military), Wine and Wotton’s (philosophy).\n\nInstruction:\n\nWhat is the interest of the Savile club at Eton?\n\nAnswer:\n\nRare Books and Manuscripts\n\n",
    "Context:\n\nPresbyterianism first officially arrived in Colonial America in 1703 with the establishment of the first Presbytery in Philadelphia. In time, the presbytery would be joined by two more to form a synod (1717) and would eventually evolve into the Presbyterian Church in the United States of America in 1789. The nation's largest Presbyterian denomination, the Presbyterian Church (U.S.A.) – PC (USA) – can trace their heritage back to the original PCUSA, as can the Presbyterian Church in America (PCA), the Orthodox Presbyterian Church (OPC), the Bible Presbyterian Church (BPC), the Cumberland Presbyterian Church (CPC), the Cumberland Presbyterian Church in America the Evangelical Presbyterian Church (EPC) and the Evangelical Covenant Order of Presbyterians (ECO).\n\nInstruction:\n\nIn what year was the presbytery joined by 3 more to form a synod?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nInstructions are also embedded in fonts to tell the operating system how to properly output different character sequences. A simple solution to the placement of combining marks or diacritics is assigning the marks a width of zero and placing the glyph itself to the left or right of the left sidebearing (depending on the direction of the script they are intended to be used with). A mark handled this way will appear over whatever character precedes it, but will not adjust its position relative to the width or height of the base glyph; it may be visually awkward and it may overlap some glyphs. Real stacking is impossible, but can be approximated in limited cases (for example, Thai top-combining vowels and tone marks can just be at different heights to start with). Generally this approach is only effective in monospaced fonts, but may be used as a fallback rendering method when more complex methods fail.\n\nInstruction:\n\nWhat is a mark adjust its position relative to?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAs an important railroad and road junction and production center, Hanover was a major target for strategic bombing during World War II, including the Oil Campaign. Targets included the AFA (Stöcken), the Deurag-Nerag refinery (Misburg), the Continental plants (Vahrenwald and Limmer), the United light metal works (VLW) in Ricklingen and Laatzen (today Hanover fairground), the Hanover/Limmer rubber reclamation plant, the Hanomag factory (Linden) and the tank factory M.N.H. Maschinenfabrik Niedersachsen (Badenstedt). Forced labourers were sometimes used from the Hannover-Misburg subcamp of the Neuengamme concentration camp. Residential areas were also targeted, and more than 6,000 civilians were killed by the Allied bombing raids. More than 90% of the city center was destroyed in a total of 88 bombing raids. After the war, the Aegidienkirche was not rebuilt and its ruins were left as a war memorial.\n\nInstruction:\n\nHow many bombing raids destroyed 40% of the city?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAssociation football is the country's most popular and most televised franchised sport. Its important venues in Mexico City include the Azteca Stadium, home to the Mexico national football team and giants América, which can seat 91,653 fans, making it the biggest stadium in Latin America. The Olympic Stadium in Ciudad Universitaria is home to the football club giants Universidad Nacional, with a seating capacity of over 52,000. The Estadio Azul, which seats 33,042 fans, is near the World Trade Center Mexico City in the Nochebuena neighborhood, and is home to the giants Cruz Azul. The three teams are based in Mexico City and play in the First Division; they are also part, with Guadalajara-based giants Club Deportivo Guadalajara, of Mexico's traditional \"Big Four\" (though recent years have tended to erode the teams' leading status at least in standings). The country hosted the FIFA World Cup in 1970 and 1986, and Azteca Stadium is the first stadium in World Cup history to host the final twice.\n\nInstruction:\n\nHow many fans does Azteca Stadium hold?\n\nAnswer:\n\n91,653\n\n",
    "Context:\n\nThe social identity of the children was strongly determined by the tribe's kinship system. Among the matrilineal tribes of the Southeast, the mixed-race children generally were accepted as and identified as Indian, as they gained their social status from their mother's clans and tribes, and often grew up with their mothers and their male relatives. By contrast, among the patrilineal Omaha, for example, the child of a white man and Omaha woman was considered \"white\"; such mixed-race children and their mothers would be protected, but the children could formally belong to the tribe as members only if adopted by a man.\n\nInstruction:\n\nWhat was the child of a white woman and a Omaha man considered?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThere were several other kingdoms which ruled over parts of India in the later medieval period prior to the British occupation. However, most of them were bound to pay regular tribute to the Marathas. The rule of Wodeyar dynasty which established the Kingdom of Mysore in southern India in around 1400 CE by was interrupted by Hyder Ali and his son Tipu Sultan in the later half of the 18th century. Under their rule, Mysore fought a series of wars sometimes against the combined forces of the British and Marathas, but mostly against the British, with Mysore receiving some aid or promise of aid from the French.\n\nInstruction:\n\nWhat kingdom was founded in Mysore in 1400 CE?\n\nAnswer:\n\nWodeyar\n\n",
    "Context:\n\nThe rule of law has been considered as one of the key dimensions that determine the quality and good governance of a country. Research, like the Worldwide Governance Indicators, defines the rule of law as: \"the extent to which agents have confidence and abide by the rules of society, and in particular the quality of contract enforcement, the police and the courts, as well as the likelihood of crime or violence.\" Based on this definition the Worldwide Governance Indicators project has developed aggregate measurements for the rule of law in more than 200 countries, as seen in the map below. A government based on the rule of law can be called a \"nomocracy\", from the Greek nomos (law) and kratos (power or rule).\n\nInstruction:\n\nWhat is the term that described a government based on the rule of law?\n\nAnswer:\n\nnomocracy\n\n",
    "Context:\n\nIn the United States, new pharmaceutical products must be approved by the Food and Drug Administration (FDA) as being both safe and effective. This process generally involves submission of an Investigational New Drug filing with sufficient pre-clinical data to support proceeding with human trials. Following IND approval, three phases of progressively larger human clinical trials may be conducted. Phase I generally studies toxicity using healthy volunteers. Phase II can include pharmacokinetics and dosing in patients, and Phase III is a very large study of efficacy in the intended patient population. Following the successful completion of phase III testing, a New Drug Application is submitted to the FDA. The FDA review the data and if the product is seen as having a positive benefit-risk assessment, approval to market the product in the US is granted.\n\nInstruction:\n\nWhat type of application is filed after completing three phases of products?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn 1965, at the instigation of Warner Sinback, a data network based on this voice-phone network was designed to connect GE's four computer sales and service centers (Schenectady, Phoenix, Chicago, and Phoenix) to facilitate a computer time-sharing service, apparently the world's first commercial online service. (In addition to selling GE computers, the centers were computer service bureaus, offering batch processing services. They lost money from the beginning, and Sinback, a high-level marketing manager, was given the job of turning the business around. He decided that a time-sharing system, based on Kemney's work at Dartmouth—which used a computer on loan from GE—could be profitable. Warner was right.)\n\nInstruction:\n\nWho lost money?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nMuch of mandolin development revolved around the soundboard (the top). Pre-mandolin instruments were quiet instruments, strung with as many as six courses of gut strings, and were plucked with the fingers or with a quill. However, modern instruments are louder—using four courses of metal strings, which exert more pressure than the gut strings. The modern soundboard is designed to withstand the pressure of metal strings that would break earlier instruments. The soundboard comes in many shapes—but generally round or teardrop-shaped, sometimes with scrolls or other projections. There is usually one or more sound holes in the soundboard, either round, oval, or shaped like a calligraphic F (f-hole). A round or oval sound hole may be covered or bordered with decorative rosettes or purfling.\n\nInstruction:\n\n Were postmandolins quiet or loud instruments?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn the 19th century, the city was transformed by development relating to its status as a trading center, as well as by European immigration. The city adopted the Commissioners' Plan of 1811, which expanded the city street grid to encompass all of Manhattan. The 1825 completion of the Erie Canal through central New York connected the Atlantic port to the agricultural markets and commodities of the North American interior via the Hudson River and the Great Lakes. Local politics became dominated by Tammany Hall, a political machine supported by Irish and German immigrants.\n\nInstruction:\n\nWhat plan of 1811 spread a grid of streets across Manhattan?\n\nAnswer:\n\nCommissioners' Plan\n\n",
    "Context:\n\nDespite the small land mass, place names are repeated; there are, for example, two islands named Long Island, three bays named Long Bay (on Somerset, Main, and Cooper's islands), two Horseshoe Bays (one in Southampton, on the Main Island, the other at Morgan's Point, formerly Tucker's Island), there are two roads through cuttings called Khyber Pass (one in Warwick, the other in St. George's Parish), and St George's Town is located on St George's Island within St George's Parish (each known as St George's). There is a Hamilton Parish in addition to the City of Hamilton (which is in Pembroke Parish).\n\nInstruction:\n\nHow many islands are named Bay Island?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nSince the university's establishment in the city in 1837, the histories of the University of Michigan and Ann Arbor have been closely linked. The town became a regional transportation hub in 1839 with the arrival of the Michigan Central Railroad, and a north—south railway connecting Ann Arbor to Toledo and other markets to the south was established in 1878. Throughout the 1840s and the 1850s settlers continued to come to Ann Arbor. While the earlier settlers were primarily of British ancestry, the newer settlers also consisted of Germans, Irish, and African-Americans. In 1851, Ann Arbor was chartered as a city, though the city showed a drop in population during the Depression of 1873. It was not until the early 1880s that Ann Arbor again saw robust growth, with new immigrants coming from Greece, Italy, Russia, and Poland. Ann Arbor saw increased growth in manufacturing, particularly in milling. Ann Arbor's Jewish community also grew after the turn of the 20th century, and its first and oldest synagogue, Beth Israel Congregation, was established in 1916.\n\nInstruction:\n\nIn which year was Ann Arbor chartered as a city?\n\nAnswer:\n\n1851\n\n",
    "Context:\n\nHunting big game typically requires a \"tag\" for each animal harvested. Tags must be purchased in addition to the hunting license, and the number of tags issued to an individual is typically limited. In cases where there are more prospective hunters than the quota for that species, tags are usually assigned by lottery. Tags may be further restricted to a specific area, or wildlife management unit. Hunting migratory waterfowl requires a duck stamp from the Fish and Wildlife Service in addition to the appropriate state hunting license.\n\nInstruction:\n\nWhat is required of hunting migratory waterfowl?\n\nAnswer:\n\nduck stamp\n\n",
    "Context:\n\nVowel length is not always considered a distinctive feature in Dutch phonology, because it normally co-occurs with changes in vowel quality. One feature or the other may be considered redundant, and some phonemic analyses prefer to treat it as an opposition of tenseness. However, even if not considered part of the phonemic opposition, the long/tense vowels are still realised as phonetically longer than their short counterparts. The changes in vowel quality are also not always the same in all dialects, and in some there may be little difference at all, with length remaining the primary distinguishing feature. And while it is true that older words always pair vowel length with a change in vowel quality, new loanwords have reintroduced phonemic oppositions of length. Compare zonne(n) [ˈzɔnə] (\"suns\") versus zone [ˈzɔːnə] (\"zone\") versus zonen [ˈzoːnə(n)] (\"sons\"), or kroes [krus] (\"mug\") versus cruise [kruːs] (\"cruise\").\n\nInstruction:\n\nHow would you say \"sons\" in Dutch?\n\nAnswer:\n\nzonen\n\n",
    "Context:\n\nFrance used the right moment and occupied Alger in 1830. In 1831 Muhammad Ali of Egypt, who was the most powerful vassal of the Ottoman Empire, claimed independence. Ottoman forces were defeated in a number of battles, and Egyptians were ready to capture Constantinople, which forced the sultan Mahmud II to seek for Russian military aid. 10 000 Russian army corps landed on the Bosphorus shores in 1833 and helped to prevent the capture of Constantinople, thus the possible disappearance of the Ottoman Empire was prevented.\n\nInstruction:\n\nIn 1831, who was the strongest vassal of the Ottoman Empire?\n\nAnswer:\n\nMuhammad Ali of Egypt\n\n",
    "Context:\n\nDouglas's business grew astronomically with the onset of World War II, employing as many as 44,000 people in 1943. To defend against air attack set designers from the Warner Brothers Studios prepared elaborate camouflage that disguised the factory and airfield. The RAND Corporation began as a project of the Douglas Company in 1945, and spun off into an independent think tank on May 14, 1948. RAND eventually acquired a 15-acre (61,000 m²) campus centrally located between the Civic Center and the pier entrance.\n\nInstruction:\n\nThe company used camouflage from what designers?\n\nAnswer:\n\nWarner Brothers Studios\n\n",
    "Context:\n\nThere is a close connection between machine learning and compression: a system that predicts the posterior probabilities of a sequence given its entire history can be used for optimal data compression (by using arithmetic coding on the output distribution) while an optimal compressor can be used for prediction (by finding the symbol that compresses best, given the previous history). This equivalence has been used as a justification for using data compression as a benchmark for \"general intelligence.\"\n\nInstruction:\n\nWhat has a close connection to machine equivalence?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nPeople of all ages and social statuses were depicted in the art of the Hellenistic age. Artists such as Peiraikos chose mundane and lower class subjects for his paintings. According to Pliny, \"He painted barbers' shops, cobblers' stalls, asses, eatables and similar subjects, earning for himself the name of rhyparographos [painter of dirt/low things]. In these subjects he could give consummate pleasure, selling them for more than other artists received for their large pictures\" (Natural History, Book XXXV.112). Even barbarians, such as the Galatians, were depicted in heroic form, prefiguring the artistic theme of the noble savage. The image of Alexander the Great was also an important artistic theme, and all of the diadochi had themselves depicted imitating Alexander's youthful look. A number of the best-known works of Greek sculpture belong to the Hellenistic period, including Laocoön and his Sons, Venus de Milo, and the Winged Victory of Samothrace.\n\nInstruction:\n\nAll of the diadochi painted themselves to look like what leader?\n\nAnswer:\n\nAlexander the Great\n\n",
    "Context:\n\nThe 5th Dalai Lama is known for unifying the Tibetan heartland under the control of the Gelug school of Tibetan Buddhism, after defeating the rival Kagyu and Jonang sects and the secular ruler, the Tsangpa prince, in a prolonged civil war. His efforts were successful in part because of aid from Güshi Khan, the Oirat leader of the Khoshut Khanate. With Güshi Khan as a largely uninvolved overlord, the 5th Dalai Lama and his intimates established a civil administration which is referred to by historians as the Lhasa state. This Tibetan regime or government is also referred to as the Ganden Phodrang.\n\nInstruction:\n\nWhat is the Tibetan goverment referred to as?\n\nAnswer:\n\nGanden Phodrang\n\n",
    "Context:\n\nSome of these estimates also take into account the opportunity cost of investing capital many years before revenues are realized (see Time-value of money). Because of the very long time needed for discovery, development, and approval of pharmaceuticals, these costs can accumulate to nearly half the total expense. A direct consequence within the pharmaceutical industry value chain is that major pharmaceutical multinationals tend to increasingly outsource risks related to fundamental research, which somewhat reshapes the industry ecosystem with biotechnology companies playing an increasingly important role, and overall strategies being redefined accordingly. Some approved drugs, such as those based on re-formulation of an existing active ingredient (also referred to as Line-extensions) are much less expensive to develop.\n\nInstruction:\n\nWhat is re-formulations of approved drugs referred to?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nLeibniz describes a space that exists only as a relation between objects, and which has no existence apart from the existence of those objects. Motion exists only as a relation between those objects. Newtonian space provided the absolute frame of reference within which objects can have motion. In Newton's system, the frame of reference exists independently of the objects contained within it. These objects can be described as moving in relation to space itself. For many centuries, the evidence of a concave water surface held authority.\n\nInstruction:\n\nWhat exists as a relationship between space and objects?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn the Netherlands, the Supreme Court of the Netherlands is the highest. Its decisions, known as \"arresten\", are absolutely final. The court is banned from testing legislation against the constitution, pursuant to the principle of the sovereignty of the States-General; the court can, however, test legislation against some treaties. Also, the ordinary courts in the Netherlands, including the Hoge Raad, do not deal with administrative law, which is dealt with in separate administrative courts, the highest of which is the Council of State (Raad van State)\n\nInstruction:\n\nThe Supreme Court of the Netherlands cannot interpret what?\n\nAnswer:\n\nlegislation against the constitution\n\n",
    "Context:\n\nOriginally known as Buckingham House, the building at the core of today's palace was a large townhouse built for the Duke of Buckingham in 1703 on a site that had been in private ownership for at least 150 years. It was acquired by King George III in 1761 as a private residence for Queen Charlotte and became known as \"The Queen's House\". During the 19th century it was enlarged, principally by architects John Nash and Edward Blore, who constructed three wings around a central courtyard. Buckingham Palace became the London residence of the British monarch on the accession of Queen Victoria in 1837.\n\nInstruction:\n\nWhen did the palace become the London residence for the monarchs?\n\nAnswer:\n\n1837\n\n",
    "Context:\n\nThe colloquialism \"buck\"(s) (much like the British word \"quid\"(s, pl) for the pound sterling) is often used to refer to dollars of various nations, including the U.S. dollar. This term, dating to the 18th century, may have originated with the colonial leather trade. It may also have originated from a poker term. \"Greenback\" is another nickname originally applied specifically to the 19th century Demand Note dollars created by Abraham Lincoln to finance the costs of the Civil War for the North. The original note was printed in black and green on the back side. It is still used to refer to the U.S. dollar (but not to the dollars of other countries). Other well-known names of the dollar as a whole in denominations include \"greenmail\", \"green\" and \"dead presidents\" (the last because deceased presidents are pictured on most bills).\n\nInstruction:\n\nIn which century can the term \"whole\" be traced back to?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn business, notable alumni include Microsoft CEO Satya Nadella, Oracle Corporation founder and the third richest man in America Larry Ellison, Goldman Sachs and MF Global CEO as well as former Governor of New Jersey Jon Corzine, McKinsey & Company founder and author of the first management accounting textbook James O. McKinsey, Arley D. Cathey, Bloomberg L.P. CEO Daniel Doctoroff, Credit Suisse CEO Brady Dougan, Morningstar, Inc. founder and CEO Joe Mansueto, Chicago Cubs owner and chairman Thomas S. Ricketts, and NBA commissioner Adam Silver.\n\nInstruction:\n\nWhat Goldman Sachs CEO is also an alumni of the University of Chicago?\n\nAnswer:\n\nJon Corzine\n\n",
    "Context:\n\nAlthough the initial focus of the humanist scholars in the university was the discovery, exposition and insertion of ancient texts and languages into the university, and the ideas of those texts into society generally, their influence was ultimately quite progressive. The emergence of classical texts brought new ideas and led to a more creative university climate (as the notable list of scholars above attests to). A focus on knowledge coming from self, from the human, has a direct implication for new forms of scholarship and instruction, and was the foundation for what is commonly known as the humanities. This disposition toward knowledge manifested in not simply the translation and propagation of ancient texts, but also their adaptation and expansion. For instance, Vesalius was imperative for advocating the use of Galen, but he also invigorated this text with experimentation, disagreements and further research. The propagation of these texts, especially within the universities, was greatly aided by the emergence of the printing press and the beginning of the use of the vernacular, which allowed for the printing of relatively large texts at reasonable prices.\n\nInstruction:\n\nDiscovery and exposition were examples of the focus of what type of university scholar?\n\nAnswer:\n\nhumanist\n\n",
    "Context:\n\nNorfolk Island was colonised by East Polynesians but was long unpeopled when it was settled by Great Britain as part of its settlement of Australia from 1788. The island served as a convict penal settlement from 6 March 1788 until 5 May 1855, except for an 11-year hiatus between 15 February 1814 and 6 June 1825, when it lay abandoned. On 8 June 1856, permanent civilian residence on the island began when it was settled from Pitcairn Island. In 1913, the UK handed Norfolk over to Australia to administer as an external territory.\n\nInstruction:\n\nWhat purpose did Norfolk Island avoid for the majority of the time from 1788 until 1855?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAs of 2014, the wind industry in the USA is able to produce more power at lower cost by using taller wind turbines with longer blades, capturing the faster winds at higher elevations. This has opened up new opportunities and in Indiana, Michigan, and Ohio, the price of power from wind turbines built 300 feet to 400 feet above the ground can now compete with conventional fossil fuels like coal. Prices have fallen to about 4 cents per kilowatt-hour in some cases and utilities have been increasing the amount of wind energy in their portfolio, saying it is their cheapest option.\n\nInstruction:\n\nWind turbines in the UK can now compete with what type of fuel?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe bank is based in Frankfurt, the largest financial centre in the Eurozone. Its location in the city is fixed by the Amsterdam Treaty. The bank moved to new purpose-built headquarters in 2014 which were designed a Vienna-based architectural office named Coop Himmelbau. The building is approximately 180 metres (591 ft) tall and will be accompanied with other secondary buildings on a landscaped site on the site of the former wholesale market in the eastern part of Frankfurt am Main. The main construction began in October 2008, and it was expected that the building will become an architectural symbol for Europe. While it was designed to accommodate double the number of staff who operate in the former Eurotower, that building has been retained since the ECB took responsibility for banking supervision and more space was hence required.\n\nInstruction:\n\nWhat decided where the bank was to be bombed?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nRichmond is located at the fall line of the James River, 44 miles (71 km) west of Williamsburg, 66 miles (106 km) east of Charlottesville, and 98 miles (158 km) south of Washington, D.C. Surrounded by Henrico and Chesterfield counties, the city is located at the intersections of Interstate 95 and Interstate 64, and encircled by Interstate 295 and Virginia State Route 288. Major suburbs include Midlothian to the southwest, Glen Allen to the north and west, Short Pump to the west and Mechanicsville to the northeast.\n\nInstruction:\n\nHow many kilometers west of Charlottesville is Richmond?\n\nAnswer:\n\n106\n\n",
    "Context:\n\nIn October 2010, the open-access scientific journal PLoS Pathogens published a paper by a multinational team who undertook a new investigation into the role of Yersinia pestis in the Black Death following the disputed identification by Drancourt and Raoult in 1998. They assessed the presence of DNA/RNA with Polymerase Chain Reaction (PCR) techniques for Y. pestis from the tooth sockets in human skeletons from mass graves in northern, central and southern Europe that were associated archaeologically with the Black Death and subsequent resurgences. The authors concluded that this new research, together with prior analyses from the south of France and Germany, \". . . ends the debate about the etiology of the Black Death, and unambiguously demonstrates that Y. pestis was the causative agent of the epidemic plague that devastated Europe during the Middle Ages\".\n\nInstruction:\n\nIn what country is PloS Pathogens headquartered?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAmong Seattle's prominent annual fairs and festivals are the 24-day Seattle International Film Festival, Northwest Folklife over the Memorial Day weekend, numerous Seafair events throughout July and August (ranging from a Bon Odori celebration to the Seafair Cup hydroplane races), the Bite of Seattle, one of the largest Gay Pride festivals in the United States, and the art and music festival Bumbershoot, which programs music as well as other art and entertainment over the Labor Day weekend. All are typically attended by 100,000 people annually, as are the Seattle Hempfest and two separate Independence Day celebrations.\n\nInstruction:\n\nWhat is Seattle's gay pride parade called?\n\nAnswer:\n\nBite of Seattle\n\n",
    "Context:\n\nThe two finalists were Kris Allen and Adam Lambert, both of whom had previously landed in the bottom three at the top five. Allen won the contest in the most controversial voting result since season two. It was claimed, later retracted, that 38 million of the 100 million votes cast on the night came from Allen's home state of Arkansas alone, and that AT&T employees unfairly influenced the votes by giving lessons on power-texting at viewing parties in Arkansas.\n\nInstruction:\n\nWho won season eight of American Idol?\n\nAnswer:\n\nKris Allen\n\n",
    "Context:\n\nHimachal Pradesh is famous for its abundant natural beauty. After the war between Nepal and Britain, also known as the Anglo-Gorkha War (1814–1816), the British colonial government came into power and the land now comprising Himachal Pradesh became part of the Punjab Province of British India. In 1950, Himachal was declared a union territory, but after the State of Himachal Pradesh Act 1971, Himachal emerged as the 18th state of the Republic of India. Hima means snow in Sanskrit, and the literal meaning of the state's name is \"In the lap of Himalayas\". It was named by Acharya Diwakar Datt Sharma, one of the great Sanskrit scholars of Himachal Pradesh.\n\nInstruction:\n\nWho was responsible for naming the Punjab Province of British India?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nHowever, the crisis did not exist in a void; it came after a long series of diplomatic clashes between the Great Powers over European and colonial issues in the decade prior to 1914 which had left tensions high. The diplomatic clashes can be traced to changes in the balance of power in Europe since 1870. An example is the Baghdad Railway which was planned to connect the Ottoman Empire cities of Konya and Baghdad with a line through modern-day Turkey, Syria and Iraq. The railway became a source of international disputes during the years immediately preceding World War I. Although it has been argued that they were resolved in 1914 before the war began, it has also been argued that the railroad was a cause of the First World War. Fundamentally the war was sparked by tensions over territory in the Balkans. Austria-Hungary competed with Serbia and Russia for territory and influence in the region and they pulled the rest of the great powers into the conflict through their various alliances and treaties. The Balkan Wars were two wars in South-eastern Europe in 1912–1913 in the course of which the Balkan League (Bulgaria, Montenegro, Greece, and Serbia) first captured Ottoman-held remaining part of Thessaly, Macedonia, Epirus, Albania and most of Thrace and then fell out over the division of the spoils, with incorporation of Romania this time.\n\nInstruction:\n\nWhy did Albania fall out with Thessaly, Macedonia and Epirus?\n\nAnswer:\n\nover the division of the spoils\n\n",
    "Context:\n\nQin armies finished their conquest of the kingdoms of Shu and Ba by 316 BC. Any written records and civil achievements of earlier kingdoms were destroyed. Qin administrators introduced improved agricultural technology. Li Bing, engineered the Dujiangyan irrigation system to control the Min River, a major tributary of the Yangtze. This innovative hydraulic system was composed of movable weirs which could be adjusted for high or low water flow according to the season, to either provide irrigation or prevent floods. The increased agricultural output and taxes made the area a source of provisions and men for Qin's unification of China.\n\nInstruction:\n\nWho engineered the Dujangyan irrigation sytem to control China?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nJosip Broz Tito (Cyrillic: Јосип Броз Тито, pronounced [jǒsip brôːz tîto]; born Josip Broz; 7 May 1892[nb 1] – 4 May 1980) was a Yugoslav revolutionary and statesman, serving in various roles from 1943 until his death in 1980. During World War II he was the leader of the Partisans, often regarded as the most effective resistance movement in occupied Europe. While his presidency has been criticized as authoritarian, and concerns about the repression of political opponents have been raised, Tito was \"seen by most as a benevolent dictator\" due to his economic and diplomatic policies. He was a popular public figure both in Yugoslavia and abroad. Viewed as a unifying symbol, his internal policies maintained the peaceful coexistence of the nations of the Yugoslav federation. He gained further international attention as the chief leader of the Non-Aligned Movement, working with Jawaharlal Nehru of India, Gamal Abdel Nasser of Egypt and Sukarno of Indonesia.\n\nInstruction:\n\nIn what year did Josip Broz Tito die?\n\nAnswer:\n\n1980\n\n",
    "Context:\n\nUntil the 1990s further replays would be played until one team was victorious. Some ties took as many as six matches to settle; in their 1975 campaign, Fulham played a total of 12 games over six rounds, which remains the most games played by a team to reach a final. Replays were traditionally played three or four days after the original game, but from 1991–92 they were staged at least 10 days later on police advice. This led to penalty shoot-outs being introduced, the first of which came on 26 November 1991 when Rotherham United eliminated Scunthorpe United.\n\nInstruction:\n\nHow much did clubs replay each other after the 1990s?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIf a party has materially violated or breached its treaty obligations, the other parties may invoke this breach as grounds for temporarily suspending their obligations to that party under the treaty. A material breach may also be invoked as grounds for permanently terminating the treaty itself.\n\nInstruction:\n\nWhat temporary actions can parties of a treaty take in response to a material violation of a party's obligations?\n\nAnswer:\n\nsuspending their obligations to that party\n\n",
    "Context:\n\nXbox Live Arcade is an online service operated by Microsoft that is used to distribute downloadable video games to Xbox and Xbox 360 owners. In addition to classic arcade games such as Ms. Pac-Man, the service offers some new original games like Assault Heroes. The Xbox Live Arcade also features games from other consoles, such as the PlayStation game Castlevania: Symphony of the Night and PC games such as Zuma. The service was first launched on November 3, 2004, using a DVD to load, and offered games for about US$5 to $15. Items are purchased using Microsoft Points, a proprietary currency used to reduce credit card transaction charges. On November 22, 2005, Xbox Live Arcade was re-launched with the release of the Xbox 360, in which it was now integrated with the Xbox 360's dashboard. The games are generally aimed toward more casual gamers; examples of the more popular titles are Geometry Wars, Street Fighter II' Hyper Fighting, and Uno. On March 24, 2010, Microsoft introduced the Game Room to Xbox Live. Game Room is a gaming service for Xbox 360 and Microsoft Windows that lets players compete in classic arcade and console games in a virtual arcade.\n\nInstruction:\n\nWhat date did the Xbox Live Arcade launch on?\n\nAnswer:\n\nNovember 3, 2004\n\n",
    "Context:\n\nThe timing of migration seems to be controlled primarily by changes in day length. Migrating birds navigate using celestial cues from the sun and stars, the earth's magnetic field, and probably also mental maps.\n\nInstruction:\n\nHow do migrating birds navigate?\n\nAnswer:\n\ncelestial cues from the sun and stars\n\n",
    "Context:\n\nA standard adult football match consists of two periods of 45 minutes each, known as halves. Each half runs continuously, meaning that the clock is not stopped when the ball is out of play. There is usually a 15-minute half-time break between halves. The end of the match is known as full-time. The referee is the official timekeeper for the match, and may make an allowance for time lost through substitutions, injured players requiring attention, or other stoppages. This added time is called additional time in FIFA documents, but is most commonly referred to as stoppage time or injury time, while loss time can also be used as a synonym. The duration of stoppage time is at the sole discretion of the referee. The referee alone signals the end of the match. In matches where a fourth official is appointed, toward the end of the half the referee signals how many minutes of stoppage time he intends to add. The fourth official then informs the players and spectators by holding up a board showing this number. The signalled stoppage time may be further extended by the referee. Added time was introduced because of an incident which happened in 1891 during a match between Stoke and Aston Villa. Trailing 1–0 and with just two minutes remaining, Stoke were awarded a penalty. Villa's goalkeeper kicked the ball out of the ground, and by the time the ball had been recovered, the 90 minutes had elapsed and the game was over. The same law also states that the duration of either half is extended until the penalty kick to be taken or retaken is completed, thus no game shall end with a penalty to be taken.\n\nInstruction:\n\nHow many periods are in a non-standard football match?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nWhen considering computational problems, a problem instance is a string over an alphabet. Usually, the alphabet is taken to be the binary alphabet (i.e., the set {0,1}), and thus the strings are bitstrings. As in a real-world computer, mathematical objects other than bitstrings must be suitably encoded. For example, integers can be represented in binary notation, and graphs can be encoded directly via their adjacency matrices, or by encoding their adjacency lists in binary.\n\nInstruction:\n\nIn a computational problem, what can be described as a string over an alphabet?\n\nAnswer:\n\nproblem instance\n\n",
    "Context:\n\nThe university houses the following public broadcasting stations: KJHK, a student-run campus radio station, KUJH-LP, an independent station that primarily broadcasts public affairs programs, and KANU, the NPR-affiliated radio station. Kansas Public Radio station KANU was one of the first public radio stations in the nation. KJHK, the campus radio has roots back to 1952 and is completely run by students.\n\nInstruction:\n\nWhat is the name of the station operated by KU students?\n\nAnswer:\n\nKJHK\n\n",
    "Context:\n\nThe only indigenous mammals of Bermuda are five species of bats, all of which are also found in the eastern United States: Lasionycteris noctivagans, Lasiurus borealis, Lasiurus cinereus, Lasiurus seminolus and Perimyotis subflavus. Other commonly known fauna of Bermuda include its national bird, the Bermuda petrel or cahow. It was rediscovered in 1951 after having been thought extinct since the 1620s. It is important as an example of a Lazarus species. The government has a programme to protect it, including restoration of a habitat area. The Bermuda rock skink was long thought to have been the only indigenous land vertebrate of Bermuda, discounting the marine turtles that lay their eggs on its beaches. Recently through genetic DNA studies, scientists have discovered that a species of turtle, the diamondback terrapin, previously thought to have been introduced, pre-dated the arrival of humans in the archipelago. As this species spends most of its time in brackish ponds, some question whether it should be classified as a land vertebrate to compete with the skink's unique status.\n\nInstruction:\n\nWhat went extinct in 1620?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nSouthern California contains a Mediterranean climate, with infrequent rain and many sunny days. Summers are hot and dry, while winters are a bit warm or mild and wet. Serious rain can occur unusually. In the summers, temperature ranges are 90-60's while as winters are 70-50's, usually all of Southern California have Mediterranean climate. But snow is very rare in the Southwest of the state, it occurs on the Southeast of the state.\n\nInstruction:\n\nHow frequent is snow in the Southwest of the state?\n\nAnswer:\n\nvery rare\n\n",
    "Context:\n\nThe city slopes gently from the northwest to southeast on a till plain composed largely of glacial and lake clay. The most notable topographical feature in the city is the Detroit Moraine, a broad clay ridge on which the older portions of Detroit and Windsor sit atop, rising approximately 62 feet (19 m) above the river at its highest point. The highest elevation in the city is located directly north of Gorham Playground on the northwest side approximately three blocks south of 8 Mile Road, at a height of 675 to 680 feet (206 to 207 m). Detroit's lowest elevation is along the Detroit River, at a surface height of 572 feet (174 m).\n\nInstruction:\n\nHow tall is the tallest point in Detroit?\n\nAnswer:\n\n675 to 680 feet\n\n",
    "Context:\n\nThe Greco-Egyptian scientist Claudius Ptolemy referred to the larger island as great Britain (μεγάλης Βρεττανίας - megális Brettanias) and to Ireland as little Britain (μικρής Βρεττανίας - mikris Brettanias) in his work Almagest (147–148 AD). In his later work, Geography (c. 150 AD), he gave these islands the names Alwion, Iwernia, and Mona (the Isle of Man), suggesting these may have been names of the individual islands not known to him at the time of writing Almagest. The name Albion appears to have fallen out of use sometime after the Roman conquest of Great Britain, after which Britain became the more commonplace name for the island called Great Britain.\n\nInstruction:\n\nIn what year did the British scientist Claudius Ptolemy complete his work, Geography?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAccording to the International Energy Agency, cellulosic ethanol biorefineries could allow biofuels to play a much bigger role in the future than organizations such as the IEA previously thought. Cellulosic ethanol can be made from plant matter composed primarily of inedible cellulose fibers that form the stems and branches of most plants. Crop residues (such as corn stalks, wheat straw and rice straw), wood waste, and municipal solid waste are potential sources of cellulosic biomass. Dedicated energy crops, such as switchgrass, are also promising cellulose sources that can be sustainably produced in many regions.\n\nInstruction:\n\n What aren't potential sources of cellulosic biomass?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nVictoria was physically unprepossessing—she was stout, dowdy and no more than five feet tall—but she succeeded in projecting a grand image. She experienced unpopularity during the first years of her widowhood, but was well liked during the 1880s and 1890s, when she embodied the empire as a benevolent matriarchal figure. Only after the release of her diary and letters did the extent of her political influence become known to the wider public. Biographies of Victoria written before much of the primary material became available, such as Lytton Strachey's Queen Victoria of 1921, are now considered out of date. The biographies written by Elizabeth Longford and Cecil Woodham-Smith, in 1964 and 1972 respectively, are still widely admired. They, and others, conclude that as a person Victoria was emotional, obstinate, honest, and straight-talking.\n\nInstruction:\n\nWhat year did Cecil Woodham Smith read Victorias biography\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nLike the Pagan Empire, Ava, Hanthawaddy and the Shan states were all multi-ethnic polities. Despite the wars, cultural synchronisation continued. This period is considered a golden age for Burmese culture. Burmese literature \"grew more confident, popular, and stylistically diverse\", and the second generation of Burmese law codes as well as the earliest pan-Burma chronicles emerged. Hanthawaddy monarchs introduced religious reforms that later spread to the rest of the country. Many splendid temples of Mrauk U were built during this period.\n\nInstruction:\n\nWho increased the spread of religious reforms in Myanmar?\n\nAnswer:\n\nHanthawaddy monarchs\n\n",
    "Context:\n\nIn 1966, Yale began discussions with its sister school Vassar College about merging to foster coeducation at the undergraduate level. Vassar, then all-female and part of the Seven Sisters—elite higher education schools that historically served as sister institutions to the Ivy League when the Ivy League still only admitted men—tentatively accepted, but then declined the invitation. Both schools introduced coeducation independently in 1969. Amy Solomon was the first woman to register as a Yale undergraduate; she was also the first woman at Yale to join an undergraduate society, St. Anthony Hall. The undergraduate class of 1973 was the first class to have women starting from freshman year; at the time, all undergraduate women were housed in Vanderbilt Hall at the south end of Old Campus.[citation needed]\n\nInstruction:\n\nWhat year did the last undergraduate class including women graduate from Yale?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nAfter finishing the first draft and returning it to Lippincott, the manuscript, at that point titled \"Go Set a Watchman\", fell into the hands of Therese von Hohoff Torrey — known professionally as Tay Hohoff — a small, wiry veteran editor in her late 50s. Hohoff was impressed. “[T]he spark of the true writer flashed in every line,” she would later recount in a corporate history of Lippincott. But as Hohoff saw it, the manuscript was by no means fit for publication. It was, as she described it, “more a series of anecdotes than a fully conceived novel.” During the next couple of years, she led Lee from one draft to the next until the book finally achieved its finished form and was retitled To Kill a Mockingbird.\n\nInstruction:\n\nThe first draft of To Kill a Mockingbird was named what?\n\nAnswer:\n\nGo Set a Watchman\n\n",
    "Context:\n\nThe film library of Turner Entertainment would serve as the base form of programming for TCM upon the network's launch. Before the creation of Turner Classic Movies, films from Turner's library of movies aired on the Turner Broadcasting System's advertiser-supported cable network TNT – along with colorized versions of black-and-white classics such as The Maltese Falcon. After the library was acquired, MGM/UA signed a deal with Turner to continue distributing the pre-May 1986 MGM and to begin distributing the pre-1950 Warner Bros. film libraries for video release (the rest of the library went to Turner Home Entertainment).\n\nInstruction:\n\nOn what network did Turner Entertainment's film library air prior to the creation of MGM/UA?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nCharleston's oldest community theater group, the Footlight Players, has provided theatrical productions since 1931. A variety of performing arts venues includes the historic Dock Street Theatre. The annual Charleston Fashion Week held each spring in Marion Square brings in designers, journalists, and clients from across the nation. Charleston is known for its local seafood, which plays a key role in the city's renowned cuisine, comprising staple dishes such as gumbo, she-crab soup, fried oysters, Lowcountry boil, deviled crab cakes, red rice, and shrimp and grits. Rice is the staple in many dishes, reflecting the rice culture of the Low Country. The cuisine in Charleston is also strongly influenced by British and French elements.\n\nInstruction:\n\nWhat is Charleston's newest community theater group?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nWhile Göring was optimistic the Luftwaffe could prevail, Hitler was not. On 17 September he postponed Operation Sea Lion (as it turned out, indefinitely) rather than gamble Germany's newly gained military prestige on a risky cross-Channel operation, particularly in the face of a sceptical Joseph Stalin in the Soviet Union. In the last days of the battle, the bombers became lures in an attempt to draw the RAF into combat with German fighters. But their operations were to no avail; the worsening weather and unsustainable attrition in daylight gave the OKL an excuse to switch to night attacks on 7 October.\n\nInstruction:\n\nWho did the Luftwaffe try to lure into battle using its bombers?\n\nAnswer:\n\nRAF\n\n",
    "Context:\n\nThis combination of cancellations and σ and π overlaps results in dioxygen's double bond character and reactivity, and a triplet electronic ground state. An electron configuration with two unpaired electrons as found in dioxygen (see the filled π* orbitals in the diagram), orbitals that are of equal energy—i.e., degenerate—is a configuration termed a spin triplet state. Hence, the ground state of the O\n2 molecule is referred to as triplet oxygen.[b] The highest energy, partially filled orbitals are antibonding, and so their filling weakens the bond order from three to two. Because of its unpaired electrons, triplet oxygen reacts only slowly with most organic molecules, which have paired electron spins; this prevents spontaneous combustion.\n\nInstruction:\n\nWhat causes triplet oxygen to react slowly?\n\nAnswer:\n\nunpaired electrons\n\n",
    "Context:\n\nDante Alighieri's Divine Comedy, derived features of and episodes about Bolgia from Arabic works on Islamic eschatology: the Hadith and the Kitab al-Miraj (translated into Latin in 1264 or shortly before as Liber Scale Machometi) concerning the ascension to Heaven of Muhammad, and the spiritual writings of Ibn Arabi. The Moors also had a noticeable influence on the works of George Peele and William Shakespeare. Some of their works featured Moorish characters, such as Peele's The Battle of Alcazar and Shakespeare's The Merchant of Venice, Titus Andronicus and Othello, which featured a Moorish Othello as its title character. These works are said to have been inspired by several Moorish delegations from Morocco to Elizabethan England at the beginning of the 17th century.\n\nInstruction:\n\nIn what century is it believed that delegations of Moors began to influence western works by the likes of Shakespeare?\n\nAnswer:\n\n17th century\n\n",
    "Context:\n\nIn addition to city government, numerous commissions and state authorities—including the Massachusetts Department of Conservation and Recreation, the Boston Public Health Commission, the Massachusetts Water Resources Authority (MWRA), and the Massachusetts Port Authority (Massport)—play a role in the life of Bostonians. As the capital of Massachusetts, Boston plays a major role in state politics.\n\nInstruction:\n\nWhat is the name of the massachusetts port authority?\n\nAnswer:\n\nMassport\n\n",
    "Context:\n\nThe Sun switched support to the Labour party on 18 March 1997, six weeks before the General Election victory which saw the New Labour leader Tony Blair become Prime Minister with a large parliamentary majority, despite the paper having attacked Blair and New Labour up to a month earlier. Its front page headline read THE SUN BACKS BLAIR and its front page editorial made clear that while it still opposed some New Labour policies, such as the Minimum Wage and Devolution, it believed Blair to be \"the breath of fresh air this great country needs\". John Major's Conservatives, it said, were \"tired, divided and rudderless\". Blair, who had radically altered his party's image and policies, noting the influence the paper could have over its readers' political thinking, had courted it (and Murdoch) for some time by granting exclusive interviews and writing columns.\n\nInstruction:\n\nHow did The Sun describe John Major's Conservatives?\n\nAnswer:\n\n\"tired, divided and rudderless\"\n\n",
    "Context:\n\nThe development of new technologies has made it dramatically easier and cheaper to do sequencing, and the number of complete genome sequences is growing rapidly. The US National Institutes of Health maintains one of several comprehensive databases of genomic information. Among the thousands of completed genome sequencing projects include those for rice, a mouse, the plant Arabidopsis thaliana, the puffer fish, and the bacteria E. coli. In December 2013, scientists first sequenced the entire genome of a Neanderthal, an extinct species of humans. The genome was extracted from the toe bone of a 130,000-year-old Neanderthal found in a Siberian cave.\n\nInstruction:\n\nWhat is happening with the knowledge gained from sequencing a mouse?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn Ukraine, Russian is seen as a language of inter-ethnic communication, and a minority language, under the 1996 Constitution of Ukraine. According to estimates from Demoskop Weekly, in 2004 there were 14,400,000 native speakers of Russian in the country, and 29 million active speakers. 65% of the population was fluent in Russian in 2006, and 38% used it as the main language with family, friends or at work. Russian is spoken by 29.6% of the population according to a 2001 estimate from the World Factbook. 20% of school students receive their education primarily in Russian.\n\nInstruction:\n\nWhat is Russian's legal status in Ukraine?\n\nAnswer:\n\nminority language, under the 1996 Constitution of Ukraine\n\n",
    "Context:\n\nBy 500 BC, the Persian Empire controlled the Greek city states in Asia Minor and had made territorial gains in the Balkans and Eastern Europe proper as well. Attempts by some of the Greek city-states of Asia Minor to overthrow Persian rule failed, and Persia invaded the states of mainland Greece in 492 BC, but was forced to withdraw after a defeat at the Battle of Marathon in 490 BC. A second invasion by the Persians followed in 480 BC. Despite a heroic resistance at Thermopylae by Spartans and other Greeks led by King Leonidas, and a simultaneous naval engagement at Artemisium,[page needed] Persian forces occupied Athens, which had been evacuated in time, as well as briefly overrunning half of Greece. Following decisive Greek victories in 480 and 479 BC at Salamis, Plataea, and Mycale, the Persians were forced to withdraw for a second time, marking their eventual withdrawal from all of their European territories. Led by Athens and Sparta, the Greek victories in the Greco-Persian Wars are considered a pivotal moment in world history, as the 50 years of peace that followed are known as Golden Age of Athens, the seminal period of ancient Greece that laid many of the foundations of Western civilization.\n\nInstruction:\n\nThe battles between the Greeks and Persians are known as what?\n\nAnswer:\n\nGreco-Persian Wars\n\n",
    "Context:\n\nThough situated in a remote part of the country, Himachal Pradesh has an active community of journalists and publishers. Several newspapers and magazines are published in more than one language, and their reach extends to almost all the Hindi-speaking states. Radio and TV have permeated significantly. Judging by the number of people writing to these media, there is a very large media-aware population in the state. All major English daily newspapers are available in Shimla and district headquarters. Aapka Faisla, Amar Ujala, Panjab Kesari, Divya Himachal are Hindi daily newspaper with local editions are read widely.\n\nInstruction:\n\nWho has an active community of journalists and publishers?\n\nAnswer:\n\nHimachal Pradesh\n\n",
    "Context:\n\nIn a major split in the ranks of Al Qaeda's organization, the Iraqi franchise, known as Al Qaeda in Iraq covertly invaded Syria and the Levant and began participating in the ongoing Syrian Civil War, gaining enough support and strength to re-invade Iraq's western provinces under the name of the Islamic State of Iraq and the Levant (ISIS/ISIL), taking over much of the country in a blitzkrieg-like action and combining the Iraq insurgency and Syrian Civil War into a single conflict. Due to their extreme brutality and a complete change in their overall ideology, Al Qaeda's core organization in Central Asia eventually denounced ISIS and directed their affiliates to cut off all ties with this organization. Many analysts[who?] believe that because of this schism, Al Qaeda and ISIL are now in a competition to retain the title of the world's most powerful terrorist organization.\n\nInstruction:\n\nWhere is ISIS's core organization?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe Spanish language is the second most spoken language in the United States. There are 45 million Hispanophones who speak Spanish as a first or second language in the United States, as well as six million Spanish language students. Together, this makes the United States of America the second largest Hispanophone country in the world after Mexico, and with the United States having more Spanish-speakers than Colombia and Spain (but fewer first language speakers). Spanish is the Romance language and the Indo-European language with the largest number of native speakers in the world. Roughly half of all American Spanish-speakers also speak English \"very well,\" based on their self-assessment in the U.S. Census.\n\nInstruction:\n\nHow many Hispanics speak English too?\n\nAnswer:\n\nRoughly half of all American Spanish-speakers also speak English \"very well,\" based on their self-assessment in the U.S. Census.\n\n",
    "Context:\n\nIn 2001, Jeff Foley published War on the Floor: An Average Guy Plays in the Arena Football League and Lives to Write About It. The book details a journalist's two preseasons (1999 and 2000) as an offensive specialist/writer with the now-defunct Albany Firebirds. The 5-foot-6 (170 cm), self-described \"unathletic writer\" played in three preseason games and had one catch for −2 yards.\n\nInstruction:\n\nAlong with 1999, in what preseason did Foley play for the Firebirds? \n\nAnswer:\n\n2000\n\n",
    "Context:\n\nPope Julius had died in April, 352, and was succeeded by Liberius. For two years Liberius had been favourable to the cause of Athanasius; but driven at last into exile, he was induced to sign an ambiguous formula, from which the great Nicene text, the \"homoousion\", had been studiously omitted. In 355 a council was held at Milan, where in spite of the vigorous opposition of a handful of loyal prelates among the Western bishops, a fourth condemnation of Athanasius was announced to the world. With his friends scattered, the saintly Hosius in exile, and Pope Liberius denounced as acquiescing in Arian formularies, Athanasius could hardly hope to escape. On the night of 8 February, 356, while engaged in services in the Church of St. Thomas, a band of armed men burst in to secure his arrest. It was the beginning of his third exile.\n\nInstruction:\n\nDid Liberius sympathize with Athanasius?\n\nAnswer:\n\nLiberius had been favourable\n\n",
    "Context:\n\nIf a defendant is sentenced to death at the trial level, the case then goes into a direct review. The direct review process is a typical legal appeal. An appellate court examines the record of evidence presented in the trial court and the law that the lower court applied and decides whether the decision was legally sound or not. Direct review of a capital sentencing hearing will result in one of three outcomes. If the appellate court finds that no significant legal errors occurred in the capital sentencing hearing, the appellate court will affirm the judgment, or let the sentence stand. If the appellate court finds that significant legal errors did occur, then it will reverse the judgment, or nullify the sentence and order a new capital sentencing hearing. Lastly, if the appellate court finds that no reasonable juror could find the defendant eligible for the death penalty, a rarity, then it will order the defendant acquitted, or not guilty, of the crime for which he/she was given the death penalty, and order him sentenced to the next most severe punishment for which the offense is eligible. About 60 percent survive the process of direct review intact.\n\nInstruction:\n\n In an indirect review, what type of court looks at the record?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn January 2009, the Green Power Partnership (GPP, sponsored by the EPA) listed Northwestern as one of the top 10 universities in the country in purchasing energy from renewable sources. The university matches 74 million kilowatt hours (kWh) of its annual energy use with Green-e Certified Renewable Energy Certificates (RECs). This green power commitment represents 30 percent of the university's total annual electricity use and places Northwestern in the EPA's Green Power Leadership Club. The 2010 Report by The Sustainable Endowments Institute awarded Northwestern a \"B-\" on its College Sustainability Report Card. The Initiative for Sustainability and Energy at Northwestern (ISEN), supporting research, teaching and outreach in these themes, was launched in 2008.\n\nInstruction:\n\nWho sponsored the Green Power Partnership?\n\nAnswer:\n\nthe EPA\n\n",
    "Context:\n\nOne of the main driving forces in the growth of the University was its football team, the Notre Dame Fighting Irish. Knute Rockne became head coach in 1918. Under Rockne, the Irish would post a record of 105 wins, 12 losses, and five ties. During his 13 years the Irish won three national championships, had five undefeated seasons, won the Rose Bowl in 1925, and produced players such as George Gipp and the \"Four Horsemen\". Knute Rockne has the highest winning percentage (.881) in NCAA Division I/FBS football history. Rockne's offenses employed the Notre Dame Box and his defenses ran a 7–2–2 scheme. The last game Rockne coached was on December 14, 1930 when he led a group of Notre Dame all-stars against the New York Giants in New York City.\n\nInstruction:\n\nThe Notre Dame football team got a new head coach in 1918, who was it?\n\nAnswer:\n\nKnute Rockne\n\n",
    "Context:\n\nIn 2014, the city had an estimated population density of 27,858 people per square mile (10,756/km²), rendering it the most densely populated of all municipalities housing over 100,000 residents in the United States; however, several small cities (of fewer than 100,000) in adjacent Hudson County, New Jersey are more dense overall, as per the 2000 Census. Geographically co-extensive with New York County, the borough of Manhattan's population density of 71,672 people per square mile (27,673/km²) makes it the highest of any county in the United States and higher than the density of any individual American city.\n\nInstruction:\n\nWhat is the population density of Manhattan per square kilometer?\n\nAnswer:\n\n27,673\n\n",
    "Context:\n\nThe boreholes on Funafuti, at the site now called Darwin's Drill, are the result of drilling conducted by the Royal Society of London for the purpose of investigating the formation of coral reefs to determine whether traces of shallow water organisms could be found at depth in the coral of Pacific atolls. This investigation followed the work on The Structure and Distribution of Coral Reefs conducted by Charles Darwin in the Pacific. Drilling occurred in 1896, 1897 and 1898. Professor Edgeworth David of the University of Sydney was a member of the 1896 \"Funafuti Coral Reef Boring Expedition of the Royal Society\", under Professor William Sollas and lead the expedition in 1897. Photographers on these trips recorded people, communities, and scenes at Funafuti.\n\nInstruction:\n\nWhat group conducted a study of coral on Funafuti?\n\nAnswer:\n\nRoyal Society of London\n\n",
    "Context:\n\nScientists do not know the exact cause of sexual orientation, but they believe that it is caused by a complex interplay of genetic, hormonal, and environmental influences. They favor biologically-based theories, which point to genetic factors, the early uterine environment, both, or the inclusion of genetic and social factors. There is no substantive evidence which suggests parenting or early childhood experiences play a role when it comes to sexual orientation. Research over several decades has demonstrated that sexual orientation ranges along a continuum, from exclusive attraction to the opposite sex to exclusive attraction to the same sex.\n\nInstruction:\n\nDo scientists know the cause of sexual orientation?\n\nAnswer:\n\nScientists do not know the exact cause of sexual orientation\n\n",
    "Context:\n\nThe Yoga school builds on the Samkhya school theory that jñāna (knowledge) is a sufficient means to moksha. It suggests that systematic techniques/practice (personal experimentation) combined with Samkhya's approach to knowledge is the path to moksha. Yoga shares several central ideas with Advaita Vedanta, with the difference that Yoga is a form of experimental mysticism while Advaita Vedanta is a form of monistic personalism. Like Advaita Vedanta, the Yoga school of Hindu philosophy states that liberation/freedom in this life is achievable, and this occurs when an individual fully understands and realizes the equivalence of Atman (soul, self) and Brahman.\n\nInstruction:\n\nWhat state in life does yoga believe is achievable?\n\nAnswer:\n\nliberation/freedom\n\n",
    "Context:\n\nNorth Carolina consists of three main geographic sections: the Atlantic Coastal Plain, which occupies the eastern 45% of the state; the Piedmont region, which contains the middle 35%; and the Appalachian Mountains and foothills. The extreme eastern section of the state contains the Outer Banks, a string of sandy, narrow barrier islands between the Atlantic Ocean and two inland waterways or \"sounds\": Albemarle Sound in the north and Pamlico Sound in the south. They are the two largest landlocked sounds in the United States.\n\nInstruction:\n\nHow many main geographical sections make up North Carolina?\n\nAnswer:\n\nthree\n\n",
    "Context:\n\nThe 1910 election saw 42 Labour MPs elected to the House of Commons, a significant victory since, a year before the election, the House of Lords had passed the Osborne judgment ruling that Trades Unions in the United Kingdom could no longer donate money to fund the election campaigns and wages of Labour MPs. The governing Liberals were unwilling to repeal this judicial decision with primary legislation. The height of Liberal compromise was to introduce a wage for Members of Parliament to remove the need to involve the Trade Unions. By 1913, faced with the opposition of the largest Trades Unions, the Liberal government passed the Trade Disputes Act to allow Trade Unions to fund Labour MPs once more.\n\nInstruction:\n\nWho passed the Osborne judgment?\n\nAnswer:\n\nTrade Disputes Act\n\n",
    "Context:\n\nOn 6 April 1941, German forces, with Hungarian and Italian assistance, launched an invasion of Yugoslavia. On 10 April 1941, Slavko Kvaternik proclaimed the Independent State of Croatia, and Tito responded by forming a Military Committee within the Central Committee of the Yugoslav Communist Party. Attacked from all sides, the armed forces of the Kingdom of Yugoslavia quickly crumbled. On 17 April 1941, after King Peter II and other members of the government fled the country, the remaining representatives of the government and military met with the German officials in Belgrade. They quickly agreed to end military resistance. On 1 May 1941, Tito issued a pamphlet calling on the people to unite in a battle against the occupation. On 27 June 1941, the Central Committee of the Communist Party of Yugoslavia appointed Tito Commander in Chief of all project national liberation military forces. On 1 July 1941, the Comintern sent precise instructions calling for immediate action.\n\nInstruction:\n\nWhich king fled the country in 1941?\n\nAnswer:\n\nKing Peter II\n\n",
    "Context:\n\nIn 1045, the Byzantine Empire conquered Bagratid Armenia. Soon, the other Armenian states fell under Byzantine control as well. The Byzantine rule was short lived, as in 1071 Seljuk Turks defeated the Byzantines and conquered Armenia at the Battle of Manzikert, establishing the Seljuk Empire. To escape death or servitude at the hands of those who had assassinated his relative, Gagik II, King of Ani, an Armenian named Roupen, went with some of his countrymen into the gorges of the Taurus Mountains and then into Tarsus of Cilicia. The Byzantine governor of the palace gave them shelter where the Armenian Kingdom of Cilicia was eventually established on 6 January 1198 under King Leo I, a descendant of Prince Roupen.\n\nInstruction:\n\nWhen did the Seljuk Turks beat the Byzantines?\n\nAnswer:\n\n1071\n\n",
    "Context:\n\nSymbiosis played a major role in the co-evolution of flowering plants and the animals that pollinate them. Many plants that are pollinated by insects, bats, or birds have highly specialized flowers modified to promote pollination by a specific pollinator that is also correspondingly adapted. The first flowering plants in the fossil record had relatively simple flowers. Adaptive speciation quickly gave rise to many diverse groups of plants, and, at the same time, corresponding speciation occurred in certain insect groups. Some groups of plants developed nectar and large sticky pollen, while insects evolved more specialized morphologies to access and collect these rich food sources. In some taxa of plants and insects the relationship has become dependent, where the plant species can only be pollinated by one species of insect.\n\nInstruction:\n\nWhat did birds develop to access and collect these rich food sources?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nDevise Minority Party Strategies. The minority leader, in consultation with other party colleagues, has a range of strategic options that he or she can employ to advance minority party objectives. The options selected depend on a wide range of circumstances, such as the visibility or significance of the issue and the degree of cohesion within the majority party. For instance, a majority party riven by internal dissension, as occurred during the early 1900s when Progressive and \"regular\" Republicans were at loggerheads, may provide the minority leader with greater opportunities to achieve his or her priorities than if the majority party exhibited high degrees of party cohesion. Among the variable strategies available to the minority party, which can vary from bill to bill and be used in combination or at different stages of the lawmaking process, are the following:\n\nInstruction:\n\nWhat is usually strongly holding the Progressives together?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThe correlation between capitalism, aristocracy, and imperialism has long been debated among historians and political theorists. Much of the debate was pioneered by such theorists as J. A. Hobson (1858–1940), Joseph Schumpeter (1883–1950), Thorstein Veblen (1857–1929), and Norman Angell (1872–1967). While these non-Marxist writers were at their most prolific before World War I, they remained active in the interwar years. Their combined work informed the study of imperialism and it's impact on Europe, as well as contributed to reflections on the rise of the military-political complex in the United States from the 1950s. Hobson argued that domestic social reforms could cure the international disease of imperialism by removing its economic foundation. Hobson theorized that state intervention through taxation could boost broader consumption, create wealth, and encourage a peaceful, tolerant, multipolar world order.\n\nInstruction:\n\nWhen were Joseph Schumpeter and Norman Angell at their most prolific writing period?\n\nAnswer:\n\nbefore World War I\n\n",
    "Context:\n\nNorthwestern's School of Communication has been especially fruitful in the number of actors, actresses, playwrights, and film and television writers and directors it has produced. Alumni who have made their mark on film and television include Ann-Margret, Warren Beatty, Jodie Markell, Paul Lynde, David Schwimmer, Anne Dudek, Zach Braff, Zooey Deschanel, Marg Helgenberger, Julia Louis-Dreyfus, Jerry Orbach, Jennifer Jones, Megan Mullally, John Cameron Mitchell, Dermot Mulroney, Charlton Heston, Richard Kind, Ana Gasteyer, Brad Hall, Shelley Long, William Daniels, Cloris Leachman, Bonnie Bartlett, Paula Prentiss, Richard Benjamin, Laura Innes, Charles Busch, Stephanie March, Tony Roberts, Jeri Ryan, Kimberly Williams-Paisley, McLean Stevenson, Tony Randall, Charlotte Rae, Paul Lynde, Patricia Neal, Nancy Dussault, Robert Reed, Mara Brock Akil, Greg Berlanti, Bill Nuss, Dusty Kay, Dan Shor, Seth Meyers, Frank DeCaro, Zach Gilford, Nicole Sullivan, Stephen Colbert, Sandra Seacat and Garry Marshall. Directors who were graduated from Northwestern include Gerald Freedman, Stuart Hagmann, Marshall W. Mason, and Mary Zimmerman. Lee Phillip Bell hosted a talk show in Chicago from 1952 to 1986 and co-created the Daytime Emmy Award-winning soap operas The Young and the Restless in 1973 and The Bold and the Beautiful in 1987. Alumni such as Sheldon Harnick, Stephanie D'Abruzzo, Heather Headley, Kristen Schaal, Lily Rabe, and Walter Kerr have distinguished themselves on Broadway, as has designer Bob Mackie. Amsterdam-based comedy theater Boom Chicago was founded by Northwestern alumni, and the school has become a training ground for future The Second City, I.O., ComedySportz, Mad TV and Saturday Night Live talent. Tam Spiva wrote scripts for The Brady Bunch and Gentle Ben. In New York, Los Angeles, and Chicago, the number of Northwestern alumni involved in theater, film, and television is so large that a perception has formed that there's such a thing as a \"Northwestern mafia.\"\n\nInstruction:\n\n Where didn't actor Warren Beatty attend school?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nDavies identifies Paine's The Age of Reason as \"the link between the two major narratives of what Jean-François Lyotard calls the narrative of legitimation\": the rationalism of the 18th-century Philosophes and the radical, historically based German 19th-century Biblical criticism of the Hegelians David Friedrich Strauss and Ludwig Feuerbach. \"The first is political, largely French in inspiration, and projects 'humanity as the hero of liberty'. The second is philosophical, German, seeks the totality and autonomy of knowledge, and stresses understanding rather than freedom as the key to human fulfilment and emancipation. The two themes converged and competed in complex ways in the 19th century and beyond, and between them set the boundaries of its various humanisms. Homo homini deus est (\"The human being is a god to humanity\" or \"god is nothing [other than] the human being to himself\"), Feuerbach had written.\n\nInstruction:\n\nWhich century was the first writing from?\n\nAnswer:\n\n18th-century\n\n",
    "Context:\n\n\nXML databases are a type of structured document-oriented database that allows querying based on XML document attributes. XML databases are mostly used in enterprise database management, where XML is being used as the machine-to-machine data interoperability standard. XML database management systems include commercial software MarkLogic and Oracle Berkeley DB XML, and a free use software Clusterpoint Distributed XML/JSON Database. All are enterprise software database platforms and support industry standard ACID-compliant transaction processing with strong database consistency characteristics and high level of database security.\n\nInstruction:\n\nWhere are XML databases never used?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nBurke was a leading sceptic with respect to democracy. While admitting that theoretically, in some cases it might be desirable, he insisted a democratic government in Britain in his day would not only be inept, but also oppressive. He opposed democracy for three basic reasons. First, government required a degree of intelligence and breadth of knowledge of the sort that occurred rarely among the common people. Second, he thought that if they had the vote, common people had dangerous and angry passions that could be aroused easily by demagogues; he feared that the authoritarian impulses that could be empowered by these passions would undermine cherished traditions and established religion, leading to violence and confiscation of property. Third, Burke warned that democracy would create a tyranny over unpopular minorities, who needed the protection of the upper classes.\n\nInstruction:\n\nWho did Burke think protected unpopular minorities?\n\nAnswer:\n\nthe upper classes\n\n",
    "Context:\n\nThe USA PATRIOT Act of October 2001 dramatically reduces restrictions on law enforcement agencies' ability to search telephone, e-mail communications, medical, financial, and other records; eases restrictions on foreign intelligence gathering within the United States; expands the Secretary of the Treasury's authority to regulate financial transactions, particularly those involving foreign individuals and entities; and broadens the discretion of law enforcement and immigration authorities in detaining and deporting immigrants suspected of terrorism-related acts. The act also expanded the definition of terrorism to include domestic terrorism, thus enlarging the number of activities to which the USA PATRIOT Act's expanded law enforcement powers could be applied. A new Terrorist Finance Tracking Program monitored the movements of terrorists' financial resources (discontinued after being revealed by The New York Times). Global telecommunication usage, including those with no links to terrorism, is being collected and monitored through the NSA electronic surveillance program. The Patriot Act is still in effect.\n\nInstruction:\n\nWhat program does the NSA currently use to monitor financial activity?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nSeveral performing arts groups and facilities are on the University of Michigan's campus, as are museums dedicated to art, archaeology, and natural history and sciences. Founded in 1879, the University Musical Society is an independent performing arts organization that presents over 60 events each year, bringing international artists in music, dance, and theater. Since 2001 Shakespeare in the Arb has presented one play by Shakespeare each June, in a large park near downtown. Regional and local performing arts groups not associated with the university include the Ann Arbor Civic Theatre, the Arbor Opera Theater, the Ann Arbor Symphony Orchestra, the Ann Arbor Ballet Theater, the Ann Arbor Civic Ballet (established in 1954 as Michigan's first chartered ballet company), The Ark, and Performance Network Theatre. Another unique piece of artistic expression in Ann Arbor is the fairy doors. These small portals are examples of installation art and can be found throughout the downtown area.\n\nInstruction:\n\nWhat organization presents over 6 events each year?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nIn 1998, after the return of Steve Jobs, Apple consolidated its multiple consumer-level desktop models into the all-in-one iMac G3, which became a commercial success and revitalized the brand. Since their transition to Intel processors in 2006, the complete lineup is entirely based on said processors and associated systems. Its current lineup comprises three desktops (the all-in-one iMac, entry-level Mac mini, and the Mac Pro tower graphics workstation), and four laptops (the MacBook, MacBook Air, MacBook Pro, and MacBook Pro with Retina display). Its Xserve server was discontinued in 2011 in favor of the Mac Mini and Mac Pro.\n\nInstruction:\n\nWhat did the iMac G2 do to the Mac reputation?\n\nAnswer:\n\nN/A\n\n",
    "Context:\n\nThus, the technological ability to detect any infectious agent rapidly and specifically are currently available. The only remaining blockades to the use of PCR as a standard tool of diagnosis are in its cost and application, neither of which is insurmountable. The diagnosis of a few diseases will not benefit from the development of PCR methods, such as some of the clostridial diseases (tetanus and botulism). These diseases are fundamentally biological poisonings by relatively small numbers of infectious bacteria that produce extremely potent neurotoxins. A significant proliferation of the infectious agent does not occur, this limits the ability of PCR to detect the presence of any bacteria.\n\nInstruction:\n\nWhat are some diseases which help improve PCR methods?\n\nAnswer:\n\nN/A\n\n"
]