[
    "Instruction:\n\nWhat is apartheid, and which country experienced it?\n\nContext:\n\nPortugal's overseas presence in sub-Saharan Africa (most notably in Angola, Cape Verde, Mozambique, Guinea-Bissau, and São Tomé and Príncipe) lasted from the 16th century to 1975, after the Estado Novo regime was overthrown in a military coup in Lisbon. Rhodesia unilaterally declared independence from the United Kingdom in 1965, under the white minority government of Ian Smith, but was not internationally recognized as an independent state (as Zimbabwe) until 1980, when black nationalists gained power after a bitter guerrilla war. Although South Africa was one of the first African countries to gain independence, the state remained under the control of the country's white minority through a system of racial segregation known as apartheid until 1994.\n\nAnswer:\n\nApartheid is a system of racial segregation in South Africa.\n\n",
    "Context:\n\nApple rejected the \"design by committee\" approach that had yielded the Motorola ROKR E1, a largely unsuccessful \"iTunes phone\" made in collaboration with Motorola. Among other deficiencies, the ROKR E1's firmware limited storage to only 100 iTunes songs to avoid competing with Apple's iPod nano. Cingular gave Apple the liberty to develop the iPhone's hardware and software in-house, a rare practice at the time, and paid Apple a fraction of its monthly service revenue (until the iPhone 3G), in exchange for four years of exclusive U.S. sales, until 2011.\n\nThe iPhone was the first mobile phone with multi-touch technology. Since the iPhone's launch, it gained larger screen sizes, video-recording, waterproofing, and many accessibility features. Up to iPhone 8 and 8 Plus, iPhones had a single button on the front panel with the Touch ID fingerprint sensor. Since iPhone X, iPhone models have switched to a nearly bezel-less front screen design with Face ID facial recognition, and app switching activated by gestures. Touch ID is still used for the budget iPhone SE series.\n\nInstruction:\n\nWhy was the iPhone such a successful product?\n\nAnswer:\n\nThe iPhone did away with physical keyboards and instead introduced a multi-touch screen which didn't require a stylus. The iPhone software, iOS, was developed to take advantage of all hardware and design capabilities of the phone, including the touchscreen. Each application presented its customized input options on the touch screen. In addition, the iOS was flexible and expandable through the App Store, giving the iPhone  user a wide choice of third-party apps which were not known before. iPhone hardware quality was also a nice surprise to the users.\n\n",
    "Instruction:\n\nAccording to this paragraph, what are the \"Old Dorms\" at the University of Virginia?\n\nContext:\n\nThe primary housing areas for first-year students are McCormick Road Dormitories, often called \"Old Dorms\", and Alderman Road Dormitories, often called \"New Dorms\". The 1970s-era Alderman Road Dorms are being fully replaced with brand new dormitory buildings in the same area. The replacements feature hall-style living arrangements with common areas and many modern amenities. Instead of being torn down and replaced like the original New Dorms, the Old Dorms will see a $105 million renovation project between 2017 and 2022. They were constructed in 1950, and are also hall-style constructions but with fewer amenities. The Old Dorms are closer to the students' classes.\n\nAnswer:\n\nThe \"Old Dorms\" at the University of Virginia often refer to the primary housing area for first-year students on McCormick Road.\n\n",
    "Context:\n\nThe Open Era is the current era of professional tennis. It began in 1968 when the Grand Slam tournaments allowed professional players to compete with amateurs, ending the division that had persisted since the dawn of the sport in the 19th century. The first open tournament was the 1968 British Hard Court Championships held in April, followed by the inaugural open Grand Slam tournament, the 1968 French Open, a month later. Unless otherwise sourced, all records are based on data from the Association of Tennis Professionals (ATP), the International Tennis Federation (ITF), and the official websites of the four Grand Slam tournaments. All rankings-related records are based on ATP rankings, which began in 1973.\n\nInstruction:\n\nWho has won the most grand slams in men's singles tennis in open era?\n\nAnswer:\n\nRafael Nadal and Novak Djokovic won 22 times.\n\n",
    "Context:\n\nTiramisu appears to have been invented in the 1960s, but where and when exactly is unclear.\n\nThe recipe for tiramisu is not found in cookbooks before the 1960s. It is mentioned in a Sydney Morning Herald restaurant column published in 1978. It is not mentioned in encyclopedias and dictionaries of the 1970s, first appearing in an Italian dictionary in 1980, and in English in 1982. It is mentioned in a 1983 cookbook devoted to cooking of the Veneto.\n\nObituaries for the restaurateur Ado Campeol (1928–2021) reported that it was invented at his restaurant Le Beccherie in Treviso on 24 December 1969 by his wife Alba di Pillo (1929–2021) and the pastry chef Roberto Linguanotto. The dish was added to its menu in 1972. Accounts by Carminantonio Iannaccone claim the tiramisu sold at Le Beccherie was made by him in his bakery, created on 24 December 1969.\n\nIt has been claimed that tiramisu has aphrodisiac effects and was concocted by a 19th-century Treviso brothel madam, as the Accademia Del Tiramisù explains, to \"solve the problems they may have had with their conjugal duties on their return to their wives\".\n\nThere is evidence of a \"Tiremesù\" semi-frozen dessert served by the Vetturino restaurant in Pieris, in the Friuli Venezia Giulia, since 1938. This may be the name's origin, while the recipe for Tiramisu may have originated as a variation of another layered dessert, Zuppa Inglese. Others claim it was created towards the end of the 17th century in Siena in honour of Grand Duke Cosimo III.\n\nOn 29 July 2017, Tiramisu was entered by the Ministry of Agricultural, Food and Forestry Policies on the list of traditional Friulian and Giulian agri-food products in the Friuli Venezia Giulia region. In 2013, Luca Zaia, governor of Veneto sought European Union Protected Status certification for the dessert, based on the ingredients used in 1970, so substitute ingredients, such as strawberries, could not be used in a dish called tiramisu\n\nInstruction:\n\nWhat is better: Tiramisu with chocolate or with Strawberries ?\n\nAnswer:\n\nTiramisu with strawberries can not be called Tiramisu. Only with chocolate.\n\n",
    "Context:\n\nOriginal Joe's is a duo of restaurants in the North Beach neighborhood of San Francisco and the Westlake neighborhood of Daly City. They serve a wide variety of foods, mostly Italian-American cuisine with some mainstream American favorites. Their \"signature\" dishes include Joe's Special, Chicken Parmigiana, the Joe's Famous Hamburger Sandwich and a variety of steaks and chops.\n\nInstruction:\n\nWhat is Original Joe's restaurant and where are they located?\n\nAnswer:\n\nOriginal Joe's is a duo of restaurants in the North Beach neighborhood of San Francisco and the Westlake neighborhood of Daly City.\n\n",
    "Instruction:\n\nWhat is Wimbledon?\n\nContext:\n\nThe Wimbledon Championships, commonly known simply as Wimbledon, is the oldest tennis tournament in the world and is widely regarded as the most prestigious. It has been held at the All England Club in Wimbledon, London, since 1877 and is played on outdoor grass courts, with retractable roofs over the two main courts since 2019.\n\nAnswer:\n\nThe Wimbledon Championships is the oldest tennis tournament in the world. Commonly referred to as Wimbledon, it is one of the four Gran Slam tennis tournaments, alongside the Australian Open, the French Open, and the US Open.\n\n",
    "Instruction:\n\nBased on the following paragraph about the campuses of the University of Georgia, which types of trees can be found on the campus?\n\nContext:\n\nThe campuses' dominant architectural themes are Federal, Classical and Antebellum style. Though there have been many additions, changes, and augmentations, the University of Georgia's campus maintains its historic character. In 2000, the entire campus was designated as an arboretum, the University of Georgia Campus Arboretum. It is estimated to be home to about 9,000 trees with over 154 identified species including native trees such magnolias, red oaks, white oaks, and beeches, as well as non-native trees such as the North Africa Atlas cedar, the Chinese parasol and royal paulownia, and the Japanese zelkova and black pine\n\nAnswer:\n\nOn the campuses of the University of Georgia one can find native tree species such as magnolias, red oaks, white oaks, and beeches. There are also non-native tree species to be found such as the North Africa Atlas cedar, the Chinese parasol and royal paulownia, and the Japanese zelkova and black pine.\n\n",
    "Context:\n\nA volleyball court is 9 m × 18 m (29.5 ft × 59.1 ft), divided into equal square halves by a net with a width of one meter (39.4 in). The top of the net is 2.43 m (7 ft 11+11⁄16 in) above the centre of the court for men's competition, and 2.24 m (7 ft 4+3⁄16 in) for women's competition, varied for veterans and junior competitions.\n\nInstruction:\n\nGiven this paragraph about the dimensions of a volleyball court, is there a difference between the hight of the net for men's competitions vs women's competitions?\n\nAnswer:\n\nThe net is 19 cm higher for men's competitions (243 cm) than for women's competitions (224 cm).\n\n",
    "Context:\n\nThe Wimbledon Championships, commonly known simply as Wimbledon, is the oldest tennis tournament in the world and is widely regarded as the most prestigious. It has been held at the All England Club in Wimbledon, London, since 1877 and is played on outdoor grass courts, with retractable roofs over the two main courts since 2019.\n\nInstruction:\n\nWhat is Wimbledon?\n\nAnswer:\n\nThe Wimbledon Championships is the oldest tennis tournament in the world. Commonly referred to as Wimbledon, it is one of the four Gran Slam tennis tournaments, alongside the Australian Open, the French Open, and the US Open.\n\n",
    "Instruction:\n\nGiven this paragraph about Drangajökull, tell me where it's located.\n\nContext:\n\nDrangajökull (pronounced [ˈtrauŋkaˌjœːkʏtl̥], regionally also [ˈtraŋk-]) is the northernmost glacier of Iceland. It is situated southwest of the peninsula Hornstrandir in the Westfjords region. The glacier covers an area of 160–200 km2 (62–77 sq mi), at an altitude of up to 925 m (3,035 ft). It is the only Icelandic glacier which lies entirely below an altitude of 1000 metres and also the only one that has not shrunk in recent years.\n\nAnswer:\n\nDrangajökull is located in Iceland in the Westfjords region.\n\n",
    "Instruction:\n\nGiven this paragraph about the dimensions of a volleyball court, is there a difference between the hight of the net for men's competitions vs women's competitions?\n\nContext:\n\nA volleyball court is 9 m × 18 m (29.5 ft × 59.1 ft), divided into equal square halves by a net with a width of one meter (39.4 in). The top of the net is 2.43 m (7 ft 11+11⁄16 in) above the centre of the court for men's competition, and 2.24 m (7 ft 4+3⁄16 in) for women's competition, varied for veterans and junior competitions.\n\nAnswer:\n\nThe net is 19 cm higher for men's competitions (243 cm) than for women's competitions (224 cm).\n\n",
    "Instruction:\n\nWhat is the least common birthday in the US other than Feb 29?\n\nContext:\n\nIn the United States between 1973 and 1999, September 16 is the most common birthday in the United States and December 25 the least common birthday (other than February 29, because of leap years). In 2011, October 5 and 6 were reported as the most frequently occurring birthdays.\n\nAnswer:\n\nThe least common birthday in the United States between 1973 and 1999, excluding February 29, is December 25.\n\n",
    "Context:\n\nLeptodactylus tapiti is a species of frog in the family Leptodactylidae. It is endemic to Brazil. Its natural habitats are moist savanna, subtropical or tropical high-altitude grassland, and rivers.\n\nInstruction:\n\nWhere can I find Leptodactylus tapiti?\n\nAnswer:\n\nLeptodactylus tapiti is a species of frog that are native to Brazil. Its natural habitats are moist savanna, subtropical or tropical high-altitude grassland, and rivers.\n\n",
    "Context:\n\nIn the United States between 1973 and 1999, September 16 is the most common birthday in the United States and December 25 the least common birthday (other than February 29, because of leap years). In 2011, October 5 and 6 were reported as the most frequently occurring birthdays.\n\nInstruction:\n\nWhat is the least common birthday in the US other than Feb 29?\n\nAnswer:\n\nThe least common birthday in the United States between 1973 and 1999, excluding February 29, is December 25.\n\n",
    "Instruction:\n\nGiven this text about gradient descent, what is gradient descent, and who invented it?\n\nContext:\n\nIn mathematics, gradient descent (also often called steepest descent) is a first-order iterative optimization algorithm for finding a local minimum of a differentiable function. The idea is to take repeated steps in the opposite direction of the gradient (or approximate gradient) of the function at the current point, because this is the direction of steepest descent. Conversely, stepping in the direction of the gradient will lead to a local maximum of that function; the procedure is then known as gradient ascent.\n\nGradient descent is generally attributed to Augustin-Louis Cauchy, who first suggested it in 1847. Jacques Hadamard independently proposed a similar method in 1907. Its convergence properties for non-linear optimization problems were first studied by Haskell Curry in 1944, with the method becoming increasingly well-studied and used in the following decades.\n\nAnswer:\n\nIn mathematics,  gradient descent (also often called steepest descent) is a first-order iterative optimization algorithm for finding a local minimum of a differentiable function. Gradient descent is generally attributed to Augustin-Louis Cauchy, who first suggested it in 1847\n\n",
    "Context:\n\nMajor League Baseball (MLB) is a professional baseball organization and the oldest major professional sports league in the world.  MLB is composed of 30 teams, divided equally between the National League (NL) and the American League (AL), with 29 in the United States and 1 in Canada.\n\nInstruction:\n\nHow many teams are in the MLB National League\n\nAnswer:\n\nThe National League (NL) consists of 15 teams aligned in three divisions. In the NL East are the Atlanta Braves, Miami Marlins, New York Mets, Philadelphia Phillies, and Washington (D.C.) Nationals. In the NL Central are the Chicago Cubs, Cincinnati Reds, Milwaukee Brewers, Pittsburgh Pirates, and St. Louis Cardinals.\n\n",
    "Instruction:\n\nWhy was the iPhone such a successful product?\n\nContext:\n\nApple rejected the \"design by committee\" approach that had yielded the Motorola ROKR E1, a largely unsuccessful \"iTunes phone\" made in collaboration with Motorola. Among other deficiencies, the ROKR E1's firmware limited storage to only 100 iTunes songs to avoid competing with Apple's iPod nano. Cingular gave Apple the liberty to develop the iPhone's hardware and software in-house, a rare practice at the time, and paid Apple a fraction of its monthly service revenue (until the iPhone 3G), in exchange for four years of exclusive U.S. sales, until 2011.\n\nThe iPhone was the first mobile phone with multi-touch technology. Since the iPhone's launch, it gained larger screen sizes, video-recording, waterproofing, and many accessibility features. Up to iPhone 8 and 8 Plus, iPhones had a single button on the front panel with the Touch ID fingerprint sensor. Since iPhone X, iPhone models have switched to a nearly bezel-less front screen design with Face ID facial recognition, and app switching activated by gestures. Touch ID is still used for the budget iPhone SE series.\n\nAnswer:\n\nThe iPhone did away with physical keyboards and instead introduced a multi-touch screen which didn't require a stylus. The iPhone software, iOS, was developed to take advantage of all hardware and design capabilities of the phone, including the touchscreen. Each application presented its customized input options on the touch screen. In addition, the iOS was flexible and expandable through the App Store, giving the iPhone  user a wide choice of third-party apps which were not known before. iPhone hardware quality was also a nice surprise to the users.\n\n",
    "Context:\n\nAfter decades of development, ASML shipped the first production extreme ultraviolet lithography machine in 2013. These machines produce light in the 13.5 nm wavelength range when a high-energy laser is focused on microscopic droplets of molten tin to produce a plasma, which then emits EUV light. The light is bounced off Zeiss mirrors that are the flattest mirrors in the world, on to the surface of a silicon wafer to deliver the designs for the chip. ASML's best-selling EUV product has been the Twinscan NXE:3600D, which costs up to $200 million. Shipping the machine requires 40 shipping containers, 20 trucks and three Boeing 747s. As of 2022, ASML has shipped around 140 EUV systems, and it is the only company to manufacture them.\n\nASML is working on the next generation of EUV systems, with the first shipments to customers for R&D purposes expected to take place at the end of 2023. The platform is designated High-NA as it will increase the numerical aperture (NA) from 0.33 to 0.55, and each system is expected to cost $300 million.\n\nInstruction:\n\nBased on this passage, how many Boeing 747s are required to ship 10 of ASML's best-selling EUVs?\n\nAnswer:\n\nThe best-selling EUV is the Twinscan NXE:3600D, and it takes 3 Boeing 747s per EUV, so 30 Boeing 747s are required to ship ten Twinscan NXE:3600Ds.\n\n",
    "Instruction:\n\nGiven this reference text about Jane Goodall, tell me how old she is, and her most notable accomplishments.\n\nContext:\n\nDame Jane Morris Goodall DBE (/ˈɡʊdɔːl/; born Valerie Jane Morris-Goodall on 3 April 1934), formerly Baroness Jane van Lawick-Goodall, is an English primatologist and anthropologist. She is considered the world's foremost expert on chimpanzees, after 60 years studying the social and family interactions of wild chimpanzees. Goodall first went to Gombe Stream National Park in Tanzania in 1960, where she witnessed human-like behaviours amongst chimpanzees, including armed conflict.[failed verification]\n\nShe is the founder of the Jane Goodall Institute and the Roots & Shoots programme, and she has worked extensively on conservation and animal welfare issues. As of 2022, she is on the board of the Nonhuman Rights Project. In April 2002, she was named a UN Messenger of Peace. Goodall is an honorary member of the World Future Council.\n\nAnswer:\n\nJane Goodall, 89, is a world-renown primatologist, famous for her study of chimpanzees. She has dedicated her life to conservation and animal welfare issues, and founded the Jane Goodall Institute and the Roots & Shoots programme. She was named a UN Messenger of Peace in 2002, and is an honorary member of the World Future Council.\n\n",
    "Instruction:\n\nWhat is Original Joe's restaurant and where are they located?\n\nContext:\n\nOriginal Joe's is a duo of restaurants in the North Beach neighborhood of San Francisco and the Westlake neighborhood of Daly City. They serve a wide variety of foods, mostly Italian-American cuisine with some mainstream American favorites. Their \"signature\" dishes include Joe's Special, Chicken Parmigiana, the Joe's Famous Hamburger Sandwich and a variety of steaks and chops.\n\nAnswer:\n\nOriginal Joe's is a duo of restaurants in the North Beach neighborhood of San Francisco and the Westlake neighborhood of Daly City.\n\n",
    "Instruction:\n\nWhat are the four major subregions in Central Otago?\n\nContext:\n\n\"The Central Otago wine region is broken into multiple sub-regions, each with its own climate and characteristics.\n\nBannockburn is a small Geographical Indication on the southern banks of the Kawarau River near Cromwell and is a very warm area that was known by gold miners as \"\"the Heart of the Desert\"\". Grapes ripen early on sandy, silty loam soils. The elevation ranges from 220 to 370 metres (720 to 1,210 ft).\nBendigo lies east of the Clutha River / Mata-Au and Lake Dunstan, with grapes planted at both medium elevation (220 metres (720 ft)) and high elevation terraces (330 to 350 metres (1,080 to 1,150 ft)). This warm area has semi arid soils at variable depths, with free draining soils at the lower levels and shallower soils at higher elevations. The Bendigo sub-region includes the vineyards at Tarras and Maori Point.\nGibbston is a tight valley enclosed by mountainous terrain. About 250 hectares of vines are planted on sloping land on the southern bank of the Kawarau River. Gibbston is the coolest and highest of the sub-regions with vineyards between 320 and 420 metres (1,050 and 1,380 ft) altitude. It is sometimes referred to as the Queenstown subregion.\nWānaka, the smallest of the sub-regions, has vineyards planted between the banks of Lake Wānaka and the town of Luggate to the east. Ranging between 290 to 320 metres (950 to 1,050 ft) above sea level, the vineyards have a similar but slightly warmer climate than those at Gibbston.\nThe Alexandra Basin is surrounded by the Clutha River / Mata-Au and Manuherikia River and regularly records New Zealand's hottest summer temperatures. Schist outcrops dominate the arid landscape. A wide diurnal shift moderates the high temperatures.\nThe Cromwell Basin contains the highest concentration of vines, in an area bounded by the Kawarau River, Lake Dunstan and the Pisa mountain range. It is a warm district characterised by semi arid, high terraces and moraines and gently sloping fans.\"\n\nAnswer:\n\nThe Central Otago wine region is broken into multiple sub-regions: Bannockburn, Bendigo, Bendigo and Wānaka\n\n",
    "Instruction:\n\nWhat are some examples of tasks performed by AI?\n\nContext:\n\nArtificial intelligence (AI) is intelligence demonstrated by machines, as opposed to intelligence of humans and other animals. Example tasks in which this is done include speech recognition, computer vision, translation between (natural) languages, as well as other mappings of inputs.\n\nAnswer:\n\nExamples of tasks performed by AI include speech recognition, computer vision, translation between (natural) languages, and other mappings of inputs.\n\n",
    "Instruction:\n\nWhat college did David Gilhooly go to?\n\nContext:\n\nHe enrolled in University of California, Davis (UC Davis) initially studying biology, followed by anthropology, and ending with a focus on fine art. While attending UC Davis, Gilhooly served as artist Robert Arneson's assistant starting in 1963. He graduated from UC Davis with a BA degree in 1965, and an MA degree in 1967.\n\nAnswer:\n\nDavid Gilhooly went to the University of California, Davis (UC Davis).\n\n",
    "Instruction:\n\nHow many seasons of Survivor has there been?\n\nContext:\n\nThe United States version is produced by Mark Burnett and hosted by Jeff Probst, who also serves as an executive producer. Each competition is called a season, has a unique name, and lasts from 13 to 16 episodes. The first season, Survivor: Borneo, was broadcast as a summer replacement show in 2000. Starting with the third season, Survivor: Africa, there have been two seasons aired during each U.S. television season. Starting with the forty-first season, no subtitle has been used in promotion of the season. Instead, the show began following a number format similar to Big Brother and The Amazing Race.\n\nIn the first season, there was a 75-person crew. By season 22, the crew had grown to 325 people.\n\nA total of 662 contestants have competed on Survivor's 44 seasons.\n\nAnswer:\n\nThere have been 44 seasons of Survivor.\n\n",
    "Context:\n\nHe enrolled in University of California, Davis (UC Davis) initially studying biology, followed by anthropology, and ending with a focus on fine art. While attending UC Davis, Gilhooly served as artist Robert Arneson's assistant starting in 1963. He graduated from UC Davis with a BA degree in 1965, and an MA degree in 1967.\n\nInstruction:\n\nWhat college did David Gilhooly go to?\n\nAnswer:\n\nDavid Gilhooly went to the University of California, Davis (UC Davis).\n\n",
    "Instruction:\n\nGiven this paragraph, can you tell me why Santa Barbara is referred to as The American Riviera?\n\nContext:\n\nSanta Barbara is a coastal city in Santa Barbara County, California, of which it is also the county seat. Situated on a south-facing section of coastline, the longest such section on the West Coast of the United States, the city lies between the steeply rising Santa Ynez Mountains and the Pacific Ocean. Santa Barbara's climate is often described as Mediterranean, and the city has been dubbed \"The American Riviera\".\n\nAnswer:\n\nSanta Barbara is referred to as The American Riviera because of it's temperate climate and south-facing orientation to the coastline.\n\n",
    "Instruction:\n\nWho has won the most grand slams in men's singles tennis in open era?\n\nContext:\n\nThe Open Era is the current era of professional tennis. It began in 1968 when the Grand Slam tournaments allowed professional players to compete with amateurs, ending the division that had persisted since the dawn of the sport in the 19th century. The first open tournament was the 1968 British Hard Court Championships held in April, followed by the inaugural open Grand Slam tournament, the 1968 French Open, a month later. Unless otherwise sourced, all records are based on data from the Association of Tennis Professionals (ATP), the International Tennis Federation (ITF), and the official websites of the four Grand Slam tournaments. All rankings-related records are based on ATP rankings, which began in 1973.\n\nAnswer:\n\nRafael Nadal and Novak Djokovic won 22 times.\n\n",
    "Instruction:\n\nDid José Altuve cheat in 2017?\n\nContext:\n\nIn 2019, Altuve's role in the 2017 World Series gained nationwide attention in the Houston Astros sign stealing scandal. With regard to the scandal, Altuve said, \"I'm not going to say to you that it was good — it was wrong. We feel bad, we feel remorse, like I said, the impact on the fans, the impact on the game — we feel bad.\" According to the website signstealingscandal.com, Altuve's instances of hearing the trash can banging were significantly lower than those of any other everyday player. Peter Gammons noted in 2022 that when he talked to Altuve in 2020 about how players, coaches, and members in the organization believed that Altuve did not participate in the stealing, Altuve declined to talk about it. He stated that it would be a \"betrayal of my teammates\" to discuss the matter and asked that Gammons not write about it. Despite this, many Astros players have defended Altuve in particular of any wrongdoing. Carlos Correa, in an interview with Ken Rosenthal, stated of Altuve's role in the scandal: \"The few times that the trash can was banged was without his consent, and he would go inside the clubhouse and inside the dugout to whoever was banging the trash can and he would get pissed. He would get mad. He would say, 'I don't want this. I can't hit like this. Don't you do that to me.' He played the game clean\"; Correa's comments came after Dodgers outfielder Cody Bellinger accused Altuve of stealing the MVP Award from runner-up Aaron Judge.\n\nAnswer:\n\nJosé Altuve played for the 2017 Astros, who are known to have used an illegal sign stealing system, but Altuve himself did not participate in the system and did not cheat.\n\n",
    "Context:\n\nDrangajökull (pronounced [ˈtrauŋkaˌjœːkʏtl̥], regionally also [ˈtraŋk-]) is the northernmost glacier of Iceland. It is situated southwest of the peninsula Hornstrandir in the Westfjords region. The glacier covers an area of 160–200 km2 (62–77 sq mi), at an altitude of up to 925 m (3,035 ft). It is the only Icelandic glacier which lies entirely below an altitude of 1000 metres and also the only one that has not shrunk in recent years.\n\nInstruction:\n\nGiven this paragraph about Drangajökull, tell me where it's located.\n\nAnswer:\n\nDrangajökull is located in Iceland in the Westfjords region.\n\n",
    "Context:\n\nIn mathematics, gradient descent (also often called steepest descent) is a first-order iterative optimization algorithm for finding a local minimum of a differentiable function. The idea is to take repeated steps in the opposite direction of the gradient (or approximate gradient) of the function at the current point, because this is the direction of steepest descent. Conversely, stepping in the direction of the gradient will lead to a local maximum of that function; the procedure is then known as gradient ascent.\n\nGradient descent is generally attributed to Augustin-Louis Cauchy, who first suggested it in 1847. Jacques Hadamard independently proposed a similar method in 1907. Its convergence properties for non-linear optimization problems were first studied by Haskell Curry in 1944, with the method becoming increasingly well-studied and used in the following decades.\n\nInstruction:\n\nGiven this text about gradient descent, what is gradient descent, and who invented it?\n\nAnswer:\n\nIn mathematics,  gradient descent (also often called steepest descent) is a first-order iterative optimization algorithm for finding a local minimum of a differentiable function. Gradient descent is generally attributed to Augustin-Louis Cauchy, who first suggested it in 1847\n\n",
    "Context:\n\nThe King's Building is a Grade I listed building that forms part of the Strand Campus of King's College London in the United Kingdom. Originally named the College Building, the King's Building was designed by Sir Robert Smirke in the course of the College's foundation in 1829. As the founding building, it was built between 1829 and 1831 on land granted to King's College by the Government to complete the riverside frontage of Somerset House.\n\nThere are today a total of eight floors in the King's Building: Basement level, Ground level, Levels 1 to 4, Level 4U and Level 6. The King's Building houses a number of administrative departments (Estates & Facilities Offices, Admissions Office, Accommodation and Cashiers' Office), lecture theatres (most notably the Edmond J. Safra Lecture Theatre and Anatomy Lecture Theatre), the College Chapel, the Great Hall, various function rooms (Old Council Room, Committee Room, River Room, Somerset Room, St David's Room), study rooms and a catering outlet.\n\nInstruction:\n\nWhat is the top floor of the King's Building based on this article? What floor is found below that?\n\nAnswer:\n\nThe top floor is Level 6, and below that is level 4U.\n\n",
    "Context:\n\nThe wraparound process is an intensive, individualized care management process for youths with serious or complex needs. Wraparound was initially developed in the 1980s as a means for maintaining youth with the most serious emotional and behavioral problems in their home and community. During the wraparound process, a team of individuals who are relevant to the well-being of the child or youth (e.g., family members, other natural supports, service providers, and agency representatives) collaboratively develop an individualized plan of care, implement this plan, and evaluate success over time. The wraparound plan typically includes formal services and interventions, together with community services and interpersonal support and assistance provided by friends, kin, and other people drawn from the family's social networks. The team convenes frequently to measure the plan's components against relevant indicators of success. Plan components and strategies are revised when outcomes are not being achieved.\n\nThe process of engaging the family, convening the team, developing the plan, implementing the plan, and transitioning the youth out of formal wraparound is typically facilitated by a trained care manager or “wraparound facilitator,” sometimes with the assistance of a family support worker. The wraparound process, and the plan itself, is designed to be culturally competent, strengths based, and organized around family members’ own perceptions of needs, goals, and likelihood of success of specific strategies.\n\nInstruction:\n\nGiven a reference text about the wraparound process, tell me what is included in a wraparound plan.\n\nAnswer:\n\nA wraparound plan usually includes formal services and interventions along with community services and interpersonal support.\n\n",
    "Instruction:\n\nWhat is the top floor of the King's Building based on this article? What floor is found below that?\n\nContext:\n\nThe King's Building is a Grade I listed building that forms part of the Strand Campus of King's College London in the United Kingdom. Originally named the College Building, the King's Building was designed by Sir Robert Smirke in the course of the College's foundation in 1829. As the founding building, it was built between 1829 and 1831 on land granted to King's College by the Government to complete the riverside frontage of Somerset House.\n\nThere are today a total of eight floors in the King's Building: Basement level, Ground level, Levels 1 to 4, Level 4U and Level 6. The King's Building houses a number of administrative departments (Estates & Facilities Offices, Admissions Office, Accommodation and Cashiers' Office), lecture theatres (most notably the Edmond J. Safra Lecture Theatre and Anatomy Lecture Theatre), the College Chapel, the Great Hall, various function rooms (Old Council Room, Committee Room, River Room, Somerset Room, St David's Room), study rooms and a catering outlet.\n\nAnswer:\n\nThe top floor is Level 6, and below that is level 4U.\n\n",
    "Instruction:\n\nWhere can I find Leptodactylus tapiti?\n\nContext:\n\nLeptodactylus tapiti is a species of frog in the family Leptodactylidae. It is endemic to Brazil. Its natural habitats are moist savanna, subtropical or tropical high-altitude grassland, and rivers.\n\nAnswer:\n\nLeptodactylus tapiti is a species of frog that are native to Brazil. Its natural habitats are moist savanna, subtropical or tropical high-altitude grassland, and rivers.\n\n",
    "Instruction:\n\nGiven a reference text about the wraparound process, tell me what is included in a wraparound plan.\n\nContext:\n\nThe wraparound process is an intensive, individualized care management process for youths with serious or complex needs. Wraparound was initially developed in the 1980s as a means for maintaining youth with the most serious emotional and behavioral problems in their home and community. During the wraparound process, a team of individuals who are relevant to the well-being of the child or youth (e.g., family members, other natural supports, service providers, and agency representatives) collaboratively develop an individualized plan of care, implement this plan, and evaluate success over time. The wraparound plan typically includes formal services and interventions, together with community services and interpersonal support and assistance provided by friends, kin, and other people drawn from the family's social networks. The team convenes frequently to measure the plan's components against relevant indicators of success. Plan components and strategies are revised when outcomes are not being achieved.\n\nThe process of engaging the family, convening the team, developing the plan, implementing the plan, and transitioning the youth out of formal wraparound is typically facilitated by a trained care manager or “wraparound facilitator,” sometimes with the assistance of a family support worker. The wraparound process, and the plan itself, is designed to be culturally competent, strengths based, and organized around family members’ own perceptions of needs, goals, and likelihood of success of specific strategies.\n\nAnswer:\n\nA wraparound plan usually includes formal services and interventions along with community services and interpersonal support.\n\n",
    "Context:\n\nThe primary housing areas for first-year students are McCormick Road Dormitories, often called \"Old Dorms\", and Alderman Road Dormitories, often called \"New Dorms\". The 1970s-era Alderman Road Dorms are being fully replaced with brand new dormitory buildings in the same area. The replacements feature hall-style living arrangements with common areas and many modern amenities. Instead of being torn down and replaced like the original New Dorms, the Old Dorms will see a $105 million renovation project between 2017 and 2022. They were constructed in 1950, and are also hall-style constructions but with fewer amenities. The Old Dorms are closer to the students' classes.\n\nInstruction:\n\nAccording to this paragraph, what are the \"Old Dorms\" at the University of Virginia?\n\nAnswer:\n\nThe \"Old Dorms\" at the University of Virginia often refer to the primary housing area for first-year students on McCormick Road.\n\n",
    "Context:\n\nSanta Barbara is a coastal city in Santa Barbara County, California, of which it is also the county seat. Situated on a south-facing section of coastline, the longest such section on the West Coast of the United States, the city lies between the steeply rising Santa Ynez Mountains and the Pacific Ocean. Santa Barbara's climate is often described as Mediterranean, and the city has been dubbed \"The American Riviera\".\n\nInstruction:\n\nGiven this paragraph, can you tell me why Santa Barbara is referred to as The American Riviera?\n\nAnswer:\n\nSanta Barbara is referred to as The American Riviera because of it's temperate climate and south-facing orientation to the coastline.\n\n",
    "Context:\n\nThe campuses' dominant architectural themes are Federal, Classical and Antebellum style. Though there have been many additions, changes, and augmentations, the University of Georgia's campus maintains its historic character. In 2000, the entire campus was designated as an arboretum, the University of Georgia Campus Arboretum. It is estimated to be home to about 9,000 trees with over 154 identified species including native trees such magnolias, red oaks, white oaks, and beeches, as well as non-native trees such as the North Africa Atlas cedar, the Chinese parasol and royal paulownia, and the Japanese zelkova and black pine\n\nInstruction:\n\nBased on the following paragraph about the campuses of the University of Georgia, which types of trees can be found on the campus?\n\nAnswer:\n\nOn the campuses of the University of Georgia one can find native tree species such as magnolias, red oaks, white oaks, and beeches. There are also non-native tree species to be found such as the North Africa Atlas cedar, the Chinese parasol and royal paulownia, and the Japanese zelkova and black pine.\n\n",
    "Context:\n\nArtificial intelligence (AI) is intelligence demonstrated by machines, as opposed to intelligence of humans and other animals. Example tasks in which this is done include speech recognition, computer vision, translation between (natural) languages, as well as other mappings of inputs.\n\nInstruction:\n\nWhat are some examples of tasks performed by AI?\n\nAnswer:\n\nExamples of tasks performed by AI include speech recognition, computer vision, translation between (natural) languages, and other mappings of inputs.\n\n",
    "Context:\n\nDavid Moses ben Meir Dyte (c. 1770–1830) was an English Jewish quill merchant who distinguished himself by preventing the assassination attempt on George III by James Hadfield on 15 May 1800.\n\nDyte was attending Colley Cibber's play She Would and She Would Not at the Theatre Royal, Drury Lane when Hadfield fired a horsepistol at the King. Dyte, seated directly behind the shooter, struck the assailant and deflected the shot. It is said that Dyte asked as his sole reward the right to sell opera tickets, then a monopoly at the royal disposal. In 1802 he was appointed 'Purveyor of Pens and Quills to the Royal Household'. The incident was immortalised in the play Jew Dyte by Harold Rubinstein.\n\nDyte was the father of Henry Dyte, who served as Honorary Secretary to the Blind Society; and the grandfather of D. H. Dyte, Surgeon to the Jewish Board of Guardians, and Charles Dyte, a parliamentarian in the colony of Victoria.\n\nInstruction:\n\nGiven a reference text about David Moses ben Meir Dyte, tell me what he is known for.\n\nAnswer:\n\nDavid Moses ben Meir Dyte is known for preventing an assassination attempt by James Hadfield on George III.\n\n",
    "Context:\n\nPortugal's overseas presence in sub-Saharan Africa (most notably in Angola, Cape Verde, Mozambique, Guinea-Bissau, and São Tomé and Príncipe) lasted from the 16th century to 1975, after the Estado Novo regime was overthrown in a military coup in Lisbon. Rhodesia unilaterally declared independence from the United Kingdom in 1965, under the white minority government of Ian Smith, but was not internationally recognized as an independent state (as Zimbabwe) until 1980, when black nationalists gained power after a bitter guerrilla war. Although South Africa was one of the first African countries to gain independence, the state remained under the control of the country's white minority through a system of racial segregation known as apartheid until 1994.\n\nInstruction:\n\nWhat is apartheid, and which country experienced it?\n\nAnswer:\n\nApartheid is a system of racial segregation in South Africa.\n\n",
    "Instruction:\n\nGiven a reference text about David Moses ben Meir Dyte, tell me what he is known for.\n\nContext:\n\nDavid Moses ben Meir Dyte (c. 1770–1830) was an English Jewish quill merchant who distinguished himself by preventing the assassination attempt on George III by James Hadfield on 15 May 1800.\n\nDyte was attending Colley Cibber's play She Would and She Would Not at the Theatre Royal, Drury Lane when Hadfield fired a horsepistol at the King. Dyte, seated directly behind the shooter, struck the assailant and deflected the shot. It is said that Dyte asked as his sole reward the right to sell opera tickets, then a monopoly at the royal disposal. In 1802 he was appointed 'Purveyor of Pens and Quills to the Royal Household'. The incident was immortalised in the play Jew Dyte by Harold Rubinstein.\n\nDyte was the father of Henry Dyte, who served as Honorary Secretary to the Blind Society; and the grandfather of D. H. Dyte, Surgeon to the Jewish Board of Guardians, and Charles Dyte, a parliamentarian in the colony of Victoria.\n\nAnswer:\n\nDavid Moses ben Meir Dyte is known for preventing an assassination attempt by James Hadfield on George III.\n\n",
    "Context:\n\n\"The Central Otago wine region is broken into multiple sub-regions, each with its own climate and characteristics.\n\nBannockburn is a small Geographical Indication on the southern banks of the Kawarau River near Cromwell and is a very warm area that was known by gold miners as \"\"the Heart of the Desert\"\". Grapes ripen early on sandy, silty loam soils. The elevation ranges from 220 to 370 metres (720 to 1,210 ft).\nBendigo lies east of the Clutha River / Mata-Au and Lake Dunstan, with grapes planted at both medium elevation (220 metres (720 ft)) and high elevation terraces (330 to 350 metres (1,080 to 1,150 ft)). This warm area has semi arid soils at variable depths, with free draining soils at the lower levels and shallower soils at higher elevations. The Bendigo sub-region includes the vineyards at Tarras and Maori Point.\nGibbston is a tight valley enclosed by mountainous terrain. About 250 hectares of vines are planted on sloping land on the southern bank of the Kawarau River. Gibbston is the coolest and highest of the sub-regions with vineyards between 320 and 420 metres (1,050 and 1,380 ft) altitude. It is sometimes referred to as the Queenstown subregion.\nWānaka, the smallest of the sub-regions, has vineyards planted between the banks of Lake Wānaka and the town of Luggate to the east. Ranging between 290 to 320 metres (950 to 1,050 ft) above sea level, the vineyards have a similar but slightly warmer climate than those at Gibbston.\nThe Alexandra Basin is surrounded by the Clutha River / Mata-Au and Manuherikia River and regularly records New Zealand's hottest summer temperatures. Schist outcrops dominate the arid landscape. A wide diurnal shift moderates the high temperatures.\nThe Cromwell Basin contains the highest concentration of vines, in an area bounded by the Kawarau River, Lake Dunstan and the Pisa mountain range. It is a warm district characterised by semi arid, high terraces and moraines and gently sloping fans.\"\n\nInstruction:\n\nWhat are the four major subregions in Central Otago?\n\nAnswer:\n\nThe Central Otago wine region is broken into multiple sub-regions: Bannockburn, Bendigo, Bendigo and Wānaka\n\n",
    "Instruction:\n\nBased on this passage, how many Boeing 747s are required to ship 10 of ASML's best-selling EUVs?\n\nContext:\n\nAfter decades of development, ASML shipped the first production extreme ultraviolet lithography machine in 2013. These machines produce light in the 13.5 nm wavelength range when a high-energy laser is focused on microscopic droplets of molten tin to produce a plasma, which then emits EUV light. The light is bounced off Zeiss mirrors that are the flattest mirrors in the world, on to the surface of a silicon wafer to deliver the designs for the chip. ASML's best-selling EUV product has been the Twinscan NXE:3600D, which costs up to $200 million. Shipping the machine requires 40 shipping containers, 20 trucks and three Boeing 747s. As of 2022, ASML has shipped around 140 EUV systems, and it is the only company to manufacture them.\n\nASML is working on the next generation of EUV systems, with the first shipments to customers for R&D purposes expected to take place at the end of 2023. The platform is designated High-NA as it will increase the numerical aperture (NA) from 0.33 to 0.55, and each system is expected to cost $300 million.\n\nAnswer:\n\nThe best-selling EUV is the Twinscan NXE:3600D, and it takes 3 Boeing 747s per EUV, so 30 Boeing 747s are required to ship ten Twinscan NXE:3600Ds.\n\n",
    "Context:\n\nIn 2019, Altuve's role in the 2017 World Series gained nationwide attention in the Houston Astros sign stealing scandal. With regard to the scandal, Altuve said, \"I'm not going to say to you that it was good — it was wrong. We feel bad, we feel remorse, like I said, the impact on the fans, the impact on the game — we feel bad.\" According to the website signstealingscandal.com, Altuve's instances of hearing the trash can banging were significantly lower than those of any other everyday player. Peter Gammons noted in 2022 that when he talked to Altuve in 2020 about how players, coaches, and members in the organization believed that Altuve did not participate in the stealing, Altuve declined to talk about it. He stated that it would be a \"betrayal of my teammates\" to discuss the matter and asked that Gammons not write about it. Despite this, many Astros players have defended Altuve in particular of any wrongdoing. Carlos Correa, in an interview with Ken Rosenthal, stated of Altuve's role in the scandal: \"The few times that the trash can was banged was without his consent, and he would go inside the clubhouse and inside the dugout to whoever was banging the trash can and he would get pissed. He would get mad. He would say, 'I don't want this. I can't hit like this. Don't you do that to me.' He played the game clean\"; Correa's comments came after Dodgers outfielder Cody Bellinger accused Altuve of stealing the MVP Award from runner-up Aaron Judge.\n\nInstruction:\n\nDid José Altuve cheat in 2017?\n\nAnswer:\n\nJosé Altuve played for the 2017 Astros, who are known to have used an illegal sign stealing system, but Altuve himself did not participate in the system and did not cheat.\n\n",
    "Instruction:\n\nWhat is better: Tiramisu with chocolate or with Strawberries ?\n\nContext:\n\nTiramisu appears to have been invented in the 1960s, but where and when exactly is unclear.\n\nThe recipe for tiramisu is not found in cookbooks before the 1960s. It is mentioned in a Sydney Morning Herald restaurant column published in 1978. It is not mentioned in encyclopedias and dictionaries of the 1970s, first appearing in an Italian dictionary in 1980, and in English in 1982. It is mentioned in a 1983 cookbook devoted to cooking of the Veneto.\n\nObituaries for the restaurateur Ado Campeol (1928–2021) reported that it was invented at his restaurant Le Beccherie in Treviso on 24 December 1969 by his wife Alba di Pillo (1929–2021) and the pastry chef Roberto Linguanotto. The dish was added to its menu in 1972. Accounts by Carminantonio Iannaccone claim the tiramisu sold at Le Beccherie was made by him in his bakery, created on 24 December 1969.\n\nIt has been claimed that tiramisu has aphrodisiac effects and was concocted by a 19th-century Treviso brothel madam, as the Accademia Del Tiramisù explains, to \"solve the problems they may have had with their conjugal duties on their return to their wives\".\n\nThere is evidence of a \"Tiremesù\" semi-frozen dessert served by the Vetturino restaurant in Pieris, in the Friuli Venezia Giulia, since 1938. This may be the name's origin, while the recipe for Tiramisu may have originated as a variation of another layered dessert, Zuppa Inglese. Others claim it was created towards the end of the 17th century in Siena in honour of Grand Duke Cosimo III.\n\nOn 29 July 2017, Tiramisu was entered by the Ministry of Agricultural, Food and Forestry Policies on the list of traditional Friulian and Giulian agri-food products in the Friuli Venezia Giulia region. In 2013, Luca Zaia, governor of Veneto sought European Union Protected Status certification for the dessert, based on the ingredients used in 1970, so substitute ingredients, such as strawberries, could not be used in a dish called tiramisu\n\nAnswer:\n\nTiramisu with strawberries can not be called Tiramisu. Only with chocolate.\n\n",
    "Instruction:\n\nHow many teams are in the MLB National League\n\nContext:\n\nMajor League Baseball (MLB) is a professional baseball organization and the oldest major professional sports league in the world.  MLB is composed of 30 teams, divided equally between the National League (NL) and the American League (AL), with 29 in the United States and 1 in Canada.\n\nAnswer:\n\nThe National League (NL) consists of 15 teams aligned in three divisions. In the NL East are the Atlanta Braves, Miami Marlins, New York Mets, Philadelphia Phillies, and Washington (D.C.) Nationals. In the NL Central are the Chicago Cubs, Cincinnati Reds, Milwaukee Brewers, Pittsburgh Pirates, and St. Louis Cardinals.\n\n",
    "Context:\n\nThe United States version is produced by Mark Burnett and hosted by Jeff Probst, who also serves as an executive producer. Each competition is called a season, has a unique name, and lasts from 13 to 16 episodes. The first season, Survivor: Borneo, was broadcast as a summer replacement show in 2000. Starting with the third season, Survivor: Africa, there have been two seasons aired during each U.S. television season. Starting with the forty-first season, no subtitle has been used in promotion of the season. Instead, the show began following a number format similar to Big Brother and The Amazing Race.\n\nIn the first season, there was a 75-person crew. By season 22, the crew had grown to 325 people.\n\nA total of 662 contestants have competed on Survivor's 44 seasons.\n\nInstruction:\n\nHow many seasons of Survivor has there been?\n\nAnswer:\n\nThere have been 44 seasons of Survivor.\n\n",
    "Context:\n\nDame Jane Morris Goodall DBE (/ˈɡʊdɔːl/; born Valerie Jane Morris-Goodall on 3 April 1934), formerly Baroness Jane van Lawick-Goodall, is an English primatologist and anthropologist. She is considered the world's foremost expert on chimpanzees, after 60 years studying the social and family interactions of wild chimpanzees. Goodall first went to Gombe Stream National Park in Tanzania in 1960, where she witnessed human-like behaviours amongst chimpanzees, including armed conflict.[failed verification]\n\nShe is the founder of the Jane Goodall Institute and the Roots & Shoots programme, and she has worked extensively on conservation and animal welfare issues. As of 2022, she is on the board of the Nonhuman Rights Project. In April 2002, she was named a UN Messenger of Peace. Goodall is an honorary member of the World Future Council.\n\nInstruction:\n\nGiven this reference text about Jane Goodall, tell me how old she is, and her most notable accomplishments.\n\nAnswer:\n\nJane Goodall, 89, is a world-renown primatologist, famous for her study of chimpanzees. She has dedicated her life to conservation and animal welfare issues, and founded the Jane Goodall Institute and the Roots & Shoots programme. She was named a UN Messenger of Peace in 2002, and is an honorary member of the World Future Council.\n\n"
]