[
    "Context:\n\nZigalga National Park (Russian: Национальный парк «Зигальга») is located on the high Zigalga Ridge of the Southern Ural Mountains in Russia, on the transition between Europe and Siberia. Much of the territory is untouched by human activity and so supports Ice Age relict floral communities through all altitude zones - pine and birch forest, dark coniferous taiga, alpine meadows and mountain tundra. The park was officially created in 2019. The park is located in the Katav-Ivanovsky District of Chelyabinsk Oblast.\n\nTopography\nZiglalga National Park connects two large protected areas on the main ridge of the Southern Urals, with Zyuratkul National Park to the northeast, and the South Ural Nature Reserve to the southwest. The park includes headwaters of the Yuryuzan River and the Kutkurka River. The highest point is at Mount Poperechnaya (1,387 metres (4,551 ft))\n\nInstruction:\n\nWhat are common florals found in Zigalga National Park?\n\nAnswer:\n\nZigalga National Park has the majority of its territory untouched by human activity and includes pine and birch forest, dark coniferous taiga, alpine meadows and mountain tundra.\n\n",
    "Context:\n\nDelta Lambda Phi (ΔΛΦ) is an international social fraternity for gay, bisexual, transgender and progressive men. It offers a social environment and structure similar to other Greek-model college fraternities. The fraternity was founded on October 15, 1986, by Vernon L. Strickland III in Washington, D.C.: becoming the first national social fraternity for gay, bisexual, and straight progressive men. The full, corporate name of the fraternity is Delta Lambda Phi Social Fraternity, but it is commonly referred to as \"DLP\" by its members. As of 2007, DLP was one of the fastest-growing fraternities in the United States.\n\nInstruction:\n\nGiven this reference text about Delta Lambda Phi, during which years was the DLP fraternity not the fastest growing fraternity in the US?\n\nAnswer:\n\nBetween 1986 and 2007, DLP was available, but not the fastest growing fraternity.\n\n",
    "Context:\n\nJames grew up playing basketball for St. Vincent–St. Mary High School in his hometown of Akron, Ohio. He was heavily touted by the national media as a future NBA superstar. A prep-to-pro, he was selected by the Cleveland Cavaliers with the first overall pick of the 2003 NBA draft. Named the 2004 NBA Rookie of the Year, he soon established himself as one of the league's premier players, leading the Cavaliers to their first NBA Finals appearance in 2007 and winning the NBA MVP award in 2009 and 2010. After failing to win a championship with Cleveland, James left in 2010 as a free agent to join the Miami Heat; this was announced in a nationally televised special titled The Decision and is among the most controversial free agency moves in sports history.\n\nInstruction:\n\nGiven this paragraph on LeBron James' early career, when did he win his first NBA MVP?\n\nAnswer:\n\nLeBron James won his first NBA MVP in 2009.\n\n",
    "Context:\n\nThe stride scheduling is a type of scheduling mechanism that has been introduced as a simple concept to achieve proportional CPU capacity reservation among concurrent processes. Stride scheduling aims to sequentially allocate a resource for the duration of standard time-slices (quantum) in a fashion, that performs periodic recurrences of allocations. Thus, a process p1 which has reserved twice the share of a process p2 will be allocated twice as often as p2. In particular, process p1 will even be allocated two times every time p2 is waiting for allocation, assuming that neither of the two processes performs a blocking operation.\n\nInstruction:\n\nWhat would cause stride scheduling to cause inefficiency in CPU operations?\n\nAnswer:\n\nBlocking operations would cause dependency issues between p1 and p2 if either is blocking the other.\n\n",
    "Context:\n\nJesus Shuttlesworth, the top high-school basketball player in the United States, is being pursued by the top college basketball programs in the nation. His father, Jake, is a convicted felon serving time at Attica Correctional Facility for accidentally killing his wife, Martha, Jesus' mother, six years earlier. Jake is granted a work release by the governor, an influential alumnus of \"Big State,\" one of the colleges Jesus is considering, so that he might persuade his son to sign with Big State. If successful, he'll get an early release from prison.\nhttps://en.wikipedia.org/wiki/He_Got_Game\n\nInstruction:\n\nBased on this paragraph, why was Jake released from prison?\n\nAnswer:\n\nJake was released from prison to try to help convince his son to play basketball for the governor's alma mater.\n\n",
    "Context:\n\nWolfgang Amadeus Mozart (27 January 1756 – 5 December 1791) was a prolific and influential composer of the Classical period. Despite his short life, his rapid pace of composition resulted in more than 800 works of virtually every genre of his time. Many of these compositions are acknowledged as pinnacles of the symphonic, concertante, chamber, operatic, and choral repertoire. Mozart is widely regarded as among the greatest composers in the history of Western music, with his music admired for its \"melodic beauty, its formal elegance and its richness of harmony and texture\".\n\nInstruction:\n\nWhat is Mozart’s contribution to the music?\n\nAnswer:\n\nMozart contributed more than 800 pieces of music that are known for melodic beauty, elegance and richness.\n\n",
    "Context:\n\nA diploma is a document awarded by an educational institution (such as a college or university) testifying the recipient has graduated by successfully completing their courses of studies. Historically, it has also referred to a charter or official document of diplomacy.\n\nInstruction:\n\nWhat is the significance of a diploma?\n\nAnswer:\n\nA diploma testifies the recipient has graduated by successfully completing their courses of studies.\n\n",
    "Context:\n\nPearl Mill Village Historic District is a national historic district located at Durham, Durham County, North Carolina. The district encompasses 26 contributing residential buildings built by owners of Pearl Cotton Mills. The mill village dwellings are either two-story duplex type built about 1905 or a one-story bungalow constructed about 1924.\n\nInstruction:\n\nGiven this paragraph about the Pearl Mill Village Historic District, tell me where it is located.\n\nAnswer:\n\nThe Pearl Mill Village Historic District is in Durham, North Carolina.\n\n",
    "Context:\n\nThe French Revolution (French: Révolution française [ʁevɔlysjɔ̃ fʁɑ̃sɛːz]) was a period of radical political and societal change in France that began with the Estates General of 1789 and ended with the formation of the French Consulate in November 1799.\n\nInstruction:\n\nWhen was the french revolution\n\nAnswer:\n\nThe French revolution started in 1789 and ended in November 1799\n\n",
    "Context:\n\nThe following are non-definitive lists of the actors with the highest career-film grosses. There are box-office gross revenue lists, which are not adjusted for inflation, as well as lists for the number of box-office ticket sales. Because of the long-term effects of inflation on movie theater ticket prices, a list unadjusted for inflation gives far more weight to later actors. Therefore, the gross revenue lists are largely meaningless for comparing acting careers widely separated in time, as many actors from earlier eras will never appear on a modern unadjusted list, despite their films' achieving higher commercial success when adjusted for price increases.\n\nInstruction:\n\nList 10 highest-grossing actors in the world.\n\nAnswer:\n\nThe following are non-definitive lists of the actors with the highest career-film grosses. There are box-office gross revenue lists, which are not adjusted for inflation, as well as lists for the number of box-office ticket sales. Because of the long-term effects of inflation on movie theater ticket prices, a list unadjusted for inflation gives far more weight to later actors. Therefore, the gross revenue lists are largely meaningless for comparing acting careers widely separated in time, as many actors from earlier eras will never appear on a modern unadjusted list, despite their films' achieving higher commercial success when adjusted for price increases.\n\nLead roles\nThis list only includes leading roles and lead ensemble roles, including voice acting. The list is updated as of 12 January 2023.\n\nRank\tActor\tWorldwide total\tTop-grossing film\tFilms\tAverage\n1\tScarlett Johansson\t$14,519,031,650\tAvengers: Endgame ($2,794,731,755)\t33\t$439,970,656\n2\tRobert Downey Jr.\t$14,393,065,668\tAvengers: Endgame ($2,794,731,755)\t43\t$334,722,457\n3\tSamuel L. Jackson\t$14,376,505,937\tAvengers: Endgame ($2,794,731,755)\t64\t$224,632,905\n4\tZoe Saldaña\t$12,805,874,340\tAvatar ($2,899,384,102)\t30\t$426,862,478\n5\tChris Hemsworth\t$11,958,567,765\tAvengers: Endgame ($2,794,731,755)\t25\t$478,342,711\n6\tChris Pratt\t$11,742,796,476\tAvengers: Endgame ($2,794,731,755)\t23\t$510,556,369\n7\tTom Cruise\t$11,547,725,996\tTop Gun: Maverick ($1,487,575,965)\t43\t$268,551,767\n8\tChris Evans\t$11,277,890,989\tAvengers: Endgame ($2,794,731,755)\t29\t$388,892,793\n9\tTom Hanks\t$10,704,310,520\tToy Story 4 ($1,073,064,540)\t55\t$194,623,828\n10\tVin Diesel\t$10,537,096,327\tAvengers: Infinity War ($2,048,359,754)\t27\t$390,262,827\n\n",
    "Context:\n\nThe General Data Protection Regulation (2016/679, \"GDPR\") is a Regulation in EU law on data protection and privacy in the EU and the European Economic Area (EEA). The GDPR is an important component of EU privacy law and of human rights law, in particular Article 8(1) of the Charter of Fundamental Rights of the European Union. It also addresses the transfer of personal data outside the EU and EEA areas. The GDPR's primary aim is to enhance individuals' control and rights over their personal data and to simplify the regulatory environment for international business. Superseding the Data Protection Directive 95/46/EC, the regulation contains provisions and requirements related to the processing of personal data of individuals, formally called \"data subjects\", who are located in the EEA, and applies to any enterprise—regardless of its location and the data subjects' citizenship or residence—that is processing the personal information of individuals inside the EEA.\nThe GDPR was adopted on 14 April 2016 and became enforceable beginning 25 May 2018. As the GDPR is a regulation, not a directive, it is directly binding and applicable, and provides flexibility for certain aspects of the regulation to be adjusted by individual member states.\n\nAccording to the European Commission, \"Personal data is information that relates to an identified or identifiable individual. If you cannot directly identify an individual from that information, then you need to consider whether the individual is still identifiable. You should take into account the information you are processing together with all the means reasonably likely to be used by either you or any other person to identify that individual.\" The precise definitions of terms such as \"personal data\", \"processing\", \"data subject\", \"controller\", and \"processor\" are stated in Article 4 of the Regulation. \n\nPrinciples\nPersonal data may not be processed unless there is at least one legal basis to do so. Article 6 states the lawful purposes are:\n\n(a) If the data subject has given consent to the processing of his or her personal data;\n(b) To fulfill contractual obligations with a data subject, or for tasks at the request of a data subject who is in the process of entering into a contract;\n(c) To comply with a data controller's legal obligations;\n(d) To protect the vital interests of a data subject or another individual;\n(e) To perform a task in the public interest or in official authority;\n(f) For the legitimate interests of a data controller or a third party, unless these interests are overridden by interests of the data subject or her or his rights according to the Charter of Fundamental Rights (especially in the case of children).\n\nSecurity of personal data\nControllers and processors of personal data must put in place appropriate technical and organizational measures to implement the data protection principles. Business processes that handle personal data must be designed and built with consideration of the principles and provide safeguards to protect data (for example, using pseudonymization or full anonymization where appropriate). Data controllers must design information systems with privacy in mind. For instance, using the highest-possible privacy settings by default, so that the datasets are not publicly available by default and cannot be used to identify a subject. No personal data may be processed unless this processing is done under one of the six lawful bases specified by the regulation (consent, contract, public task, vital interest, legitimate interest or legal requirement). When the processing is based on consent the data subject has the right to revoke it at any time.\n\nArticle 33 states the data controller is under a legal obligation to notify the supervisory authority without undue delay unless the breach is unlikely to result in a risk to the rights and freedoms of the individuals. There is a maximum of 72 hours after becoming aware of the data breach to make the report. Individuals have to be notified if a high risk of an adverse impact is determined (Article 34). In addition, the data processor will have to notify the controller without undue delay after becoming aware of a personal data breach (Article 33). However, the notice to data subjects is not required if the data controller has implemented appropriate technical and organisational protection measures that render the personal data unintelligible to any person who is not authorised to access it, such as encryption (Article 34).\n\nData protection officer\n\nArticle 37 requires appointment of a data protection officer. If processing is carried out by a public authority (except for courts or independent judicial authorities when acting in their judicial capacity), or if processing operations involve regular and systematic monitoring of data subjects on a large scale, or if processing on a large scale of special categories of data and personal data relating to criminal convictions and offences (Articles 9 and Article 10) a data protection officer (DPO)—a person with expert knowledge of data protection law and practices—must be designated to assist the controller or processor in monitoring their internal compliance with the Regulation.\n\nA designated DPO can be a current member of staff of a controller or processor, or the role can be outsourced to an external person or agency through a service contract. In any case, the processing body must make sure that there is no conflict of interest in other roles or interests that a DPO may hold. The contact details for the DPO must be published by the processing organisation (for example, in a privacy notice) and registered with the supervisory authority.\n\nThe DPO is similar to a compliance officer and is also expected to be proficient at managing IT processes, data security (including dealing with cyberattacks) and other critical business continuity issues associated with the holding and processing of personal and sensitive data. The skill set required stretches beyond understanding legal compliance with data protection laws and regulations. The DPO must maintain a living data inventory of all data collected and stored on behalf of the organization. More details on the function and the role of data protection officer were given on 13 December 2016 (revised 5 April 2017) in a guideline document.\n\nOrganisations based outside the EU must also appoint an EU-based person as a representative and point of contact for their GDPR obligations (Article 27). This is a distinct role from a DPO, although there is overlap in responsibilities that suggest that this role can also be held by the designated DPO.\n\nInstruction:\n\nGiven a reference text about GDPR, tell me how GDPR helps to secure personal data.\n\nAnswer:\n\nGeneral Data Protection Regulation provides guidelines on storing and processing personal data. Personal data is any information about an identified or identifiable person, also known as the data subject. Personal data includes information such as their:\n\nname\naddress\nID card/passport number\nincome\ncultural profile\nInternet Protocol (IP) address\ndata held by a hospital or doctor (which uniquely identifies a person for health purposes).\n\nSpecial categories of data\nYou may not process personal data about someone's:\n\nracial or ethnic origin\nsexual orientation\npolitical opinions\nreligious or philosophical beliefs\ntrade-union membership\ngenetic, biometric or health data except in specific cases (e.g. when you've been given explicit consent or when processing is needed for reasons of substantial public interest, on the basis of EU or national law)\npersonal data related to criminal convictions and offences unless this is authorised by EU or national law.\n\nWho processes the personal data?\nDuring processing, personal data can pass through various different companies or organisations. Within this cycle there are two main profiles that deal with processing personal data:\n\nThe data controller - decides the purpose and way in which personal data is processed.\nThe data processor - holds and processes data on behalf of a data controller.\nWho monitors how personal data is processed within a company?\nThe Data Protection Officer (DPO), who may have been designated by the company, is responsible for monitoring how personal data is processed and to inform and advise employees who process personal data about their obligations. The DPO also cooperates with the Data Protection Authority (DPA), serving as a contact point towards the DPA and individuals.\n\nProcessing data for another company\nA data controller can only use a data processor who offers sufficient guarantees, these should be included in a written contract between the parties involved. The contract must also contain a number of mandatory clauses, e.g. that the data processor will only process personal data when instructed to do so by the data controller.\n\nData transfer outside the EU\nWhen personal data is transferred outside the EU, the protection offered by the GDPR should travel with the data. This means that if you export data abroad, your company must ensure one of the following measures are adhered to:\n\nThe non-EU country's protections are deemed adequate by the EU.\nYour company takes the necessary measures to provide appropriate safeguards, such as including specific clauses in the agreed contract with the non-European importer of the personal data.\nYour company relies on specific grounds for the transfer (derogations) such as the consent of the individual.\nWhen is data processing allowed?\nEU data protection rules mean you should process data in a fair and lawful manner, for a specified and legitimate purpose and only process the data necessary to fulfil this purpose. You must ensure that you fulfil one of the following conditions to process the personal data; you:\n\nhave been given the consent of the individual concerned\nneed the personal data to fulfil a contractual obligation with the individual\nneed the personal data to satisfy a legal obligation\nneed the personal data to protect the vital interests of the individual\nprocess personal data to carry out the task in the interest of the public\nare acting in your company's legitimate interests, as long as the fundamental rights and freedoms of the individual whose data are processed are not seriously impacted. If the person's rights override your company's interests, then you cannot process the personal data.\n\n\nAgreeing to data processing - consent\nRight to access and right to data portability\nRight to correct and right to object\nRight to erasure (right to be forgotten)\nAutomated decision-making and profiling\nData breaches – providing proper notification\nResponding to requests\nImpact assessments\nKeeping a record\n\n",
    "Context:\n\nArtificial neural networks (ANNs), usually simply called neural networks (NNs) or neural nets, are computing systems inspired by the biological neural networks that constitute animal brains. An ANN is based on a collection of connected units or nodes called artificial neurons, which loosely model the neurons in a biological brain. Each connection, like the synapses in a biological brain, can transmit a signal to other neurons. An artificial neuron receives signals then processes them and can signal neurons connected to it. The \"signal\" at a connection is a real number, and the output of each neuron is computed by some non-linear function of the sum of its inputs. The connections are called edges. Neurons and edges typically have a weight that adjusts as learning proceeds. The weight increases or decreases the strength of the signal at a connection. Neurons may have a threshold such that a signal is sent only if the aggregate signal crosses that threshold.\nutomatically generate identifying characteristics from the examples that they process.Typically, neurons are aggregated into layers. Different layers may perform different transformations on their inputs. Signals travel from the first layer (the input layer), to the last layer (the output layer), possibly after traversing the layers multiple times.\n\nInstruction:\n\nWhat are artificial neural networks?\n\nAnswer:\n\nNeural networks are computer systems inspired by the biological neural networks that constitute animal brains\n\n",
    "Context:\n\nThe blood hammer phenomenon is a sudden increase of the upstream blood pressure in a blood vessel (especially artery or arteriole) when the bloodstream is abruptly blocked by vessel obstruction. The term \"blood-hammer\" was introduced in cerebral hemodynamics by analogy with the hydraulic expression \"water hammer\", already used in vascular physiology to designate an arterial pulse variety, the \"water-hammer pulse\". Complete understanding of the relationship between mechanical parameters in vascular occlusions is a critical issue, which can play an important role in the future diagnosis, understanding and treatment of vascular diseases.\n\nInstruction:\n\nGiven a reference text about the blood hammer phenomenon, tell me the background of the term \"blood-hammer\".\n\nAnswer:\n\nThe term \"blood-hammer\" was introduced by analogy with the hydraulic expression \"water hammer\" that was already used in vascular physiology.\n\n",
    "Context:\n\nCisco Systems, Inc., commonly known as Cisco, is an American-based multinational digital communications technology conglomerate corporation headquartered in San Jose, California. Cisco develops, manufactures, and sells networking hardware, software, telecommunications equipment and other high-technology services and products. Cisco specializes in specific tech markets, such as the Internet of Things (IoT), domain security, videoconferencing, and energy management with leading products including Webex, OpenDNS, Jabber, Duo Security, and Jasper. Cisco is one of the largest technology companies in the world ranking 74 on the Fortune 100 with over $51 billion in revenue and nearly 80,000 employees.\n\nInstruction:\n\nWhat is Cisco's formal company name, where is their headquarters, and how many employees are there in the company?\n\nAnswer:\n\nCisco Systems, Inc. is located in San Jose, California and has nearly 80,000 employees.\n\n",
    "Context:\n\nArsenal was the first club from the South of England to join the Football League in 1893, and they reached the First Division in 1904. Relegated only once, in 1913, they continue the longest streak in the top division, and have won the second-most top-flight matches in English football history. In the 1930s, Arsenal won five League Championships and two FA Cups, and another FA Cup and two Championships after the war. In 1970–71, they won their first League and FA Cup Double. Between 1989 and 2005, they won five League titles and five FA Cups, including two more Doubles. They completed the 20th century with the highest average league position. Between 1998 and 2017, Arsenal qualified for the UEFA Champions League for nineteen consecutive seasons.\n\nInstruction:\n\nWhen did Arsenal first reach the first division? How many league titles did they win between 1989 and 2005 and how many FA cups? How many trophies in total for that period?\n\nAnswer:\n\nArsenal reached the first division in 1904. Between 1989 and 2005, Arsenal won 5 league titles and 5 FA cups. That’s a total of 10 trophies.\n\n",
    "Context:\n\nKilwa is an administrative ward in Kilindi District of Tanga Region in Tanzania. The ward covers an area of 153 km2 (59 sq mi), and has an average elevation of 858 m (2,815 ft). According to the 2012 census, the ward has a total population of 6,835.\n\nInstruction:\n\nWhere is the Kilwa Tanga\n\nAnswer:\n\nKilwa is an administrative ward in Kilindi District of Tanga Region in Tanzania. The ward covers an area of 153 km2 (59 sq mi), and has an average elevation of 858 m (2,815 ft).\n\nAccording to the 2012 census, the ward has a total population of 6,835.\n\n",
    "Context:\n\nIn 2012 Safeway invested $350 million into retrofitting 800 locations with clinics that would offer in-store blood tests. After many missed deadlines and questionable results from a trial clinic at Safeway's corporate offices, the deal was terminated in 2015. In 2013, Theranos partnered with Walgreens to offer in-store blood tests at more than 40 locations. Although Theranos blood tests were reportedly used on drug trial patients for GlaxoSmithKline and Pfizer, both companies stated that there were no active projects with Theranos in October 2015. In June 2016, Walgreens terminated its partnership with Theranos. In November 2016 it filed suit against Theranos in federal court in Delaware for breach of contract. In June 2017, Theranos reported to investors that the suit, which originally sought $140 million in damages, was settled for less than $30 million.\n\nIn March 2015 the Cleveland Clinic announced a partnership with Theranos to test its technology and decrease the cost of lab tests. In July 2015, Theranos became the lab-work provider for Pennsylvania insurers AmeriHealth Caritas and Capital Blue Cross.\n\nIn July 2015 the Food and Drug Administration approved the use of the company's fingerstick blood testing device for the herpes simplex virus (HSV-1) outside a clinical laboratory setting. Theranos was named the 2015 Bioscience Company of the Year by the Arizona BioIndustry Association (AzBio).\n\nInstruction:\n\nWhich companies did Theranos partner with in 2015?\n\nAnswer:\n\nTheranos partnered with Cleveland Clinic in March 2015 to test its technology and decrease the cost of lab tests. In July 2015, Theranos became the lab-work provider for Pennsylvania insurers AmeriHealth Caritas and Capital Blue Cross.\n\n",
    "Context:\n\nHeads I Win, Tails You Lose (Italian: Testa o Croce, also known as Heads or Tails) is a 1982 Italian comedy film written and directed by Nanni Loy.\n\nThe film consists in two back-to-back stories that deals with two \"taboo\" themes, the celibacy of the clergy in the episode of Renato Pozzetto and the homosexuality in the one with Nino Manfredi.\n\nInstruction:\n\nGiven this paragraph, who wrote and directed Heads I Win, Tails You Lose\n\nAnswer:\n\nBased on this passage of text, Nanni Loy wrote and directed the movie Heads I Win, Tails You Lose.\n\n",
    "Context:\n\nSaint-Germain-les-Belles is a railway station in Saint-Germain-les-Belles, Nouvelle-Aquitaine, France. The station is located on the Orléans–Montauban railway line. The station is served by TER (local) services operated by SNCF.\n\nInstruction:\n\nWho services the Saint-Germain-les-Belles station?\n\nAnswer:\n\nSaint-Germain-les-Belles station is serviced by the TER services operated by SNCF.\n\n",
    "Context:\n\nTelugu cinema, also known as Tollywood, is the segment of Indian cinema dedicated to the production of motion pictures in the Telugu language, widely spoken in the states of Andhra Pradesh and Telangana. Telugu cinema is based in Film Nagar, Hyderabad. As of 2021, Telugu cinema is the largest film industry in India in terms of box-office. Telugu films sold 23.3 crore (233 million) tickets in 2022, the highest among various film industries in India.\n\nInstruction:\n\nWhat is tollywood?\n\nAnswer:\n\nTollywood is a nickname for movies made by Telugu cinema in India.\n\n",
    "Context:\n\nChris Kuroda, who has been Phish's lighting director since 1989, creates elaborate light displays during the band's concerts that are sometimes improvised in a similar fashion to their music. Justin Taylor of The Baffler wrote, \"You could hate this music with every fiber of your being and still be ready to give Chris Kuroda a MacArthur \"genius\" grant for what he achieves with his light rig.\" Kuroda is often referred to by fans as the unofficial fifth member of the band, and has been given the nickname \"CK5\".\n\nInstruction:\n\nBased on this passage, why is Chris Kuroda's nickname CK5?\n\nAnswer:\n\nChris Kuroda's nickname, CK5, adds the number 5 to his initial. That is because his improvised light shows during Phish concerts give him a role comparable to a fifth member of the band.\n\n",
    "Context:\n\nSwimming under ice. On 16 March 2000, Hof set the Guinness World Record for farthest swim under ice on his second attempt, with a distance of 57.5 metres (188.6 feet). Hof's first attempt the day before failed when he began his swim without goggles and his corneas froze solid and blinded him. A rescue diver pulled him to the surface after he passed out. The record has been broken several times since and is 265 feet (81 m) as of 2022.\"\n\nInstruction:\n\nWho set the first Guinness World Record for swimming under ice?\n\nAnswer:\n\nOn 16 March 2000, Wim Hof set the Guinness World Record for thre farthest swim under ice, with a distance of 57.5 metres (188.6 feet).\n\n",
    "Context:\n\nMulti-spectral camouflage is the use of counter-surveillance techniques to conceal objects from detection across several parts of the electromagnetic spectrum at the same time. While traditional military camouflage attempts to hide an object in the visible spectrum, multi-spectral camouflage also tries to simultaneously hide objects from detection methods such as infrared, radar, and millimetre-wave radar imaging.\n\nInstruction:\n\nBased on this article, what is a potential weakness of traditional military camouflage?\n\nAnswer:\n\nTraditional military camouflage only protects against tools which use the visual spectrum to detect objects, and so if a tool is based on infrared or radar the traditional camouflage doesn't offer any protection.\n\n",
    "Context:\n\n\"Vegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, insects, and the flesh of any other animal). It may also include abstaining from eating all by-products of animal slaughter.\n\nVegetarianism may be adopted for various reasons. Many people object to eating meat out of respect for sentient animal life. Such ethical motivations have been codified under various religious beliefs as well as animal rights advocacy. Other motivations for vegetarianism are health-related, political, environmental, cultural, economic, taste-related, or relate to other personal preferences.\"\n\nInstruction:\n\nWhat is the definition of Vegetarian?\n\nAnswer:\n\nVegetarianism is the practice of abstaining from the consumption of meat (red meat, poultry, seafood, insects, and the flesh of any other animal).\n\n",
    "Context:\n\nMarquez Phillips Pope (born October 29, 1970 in Nashville, Tennessee) is a former professional American football player who was drafted by the San Diego Chargers in the 2nd round (33rd overall) of the 1992 NFL Draft. A 5'11\" cornerback-safety from Fresno State University, Pope played for 5 teams in 10 NFL seasons from 1992 to 2001. His best year as a pro came during the 1996 season for the San Francisco 49ers, intercepting 6 passes with 1 touchdown. During his pro career, Pope was known to be among the hardest hitters in the NFL.\n\nInstruction:\n\nWhich team drafted Marques Pope?\n\nAnswer:\n\nThe team that drafted Marquez Pope was the San Diego Chargers in the 1992 NFL Draft.\n\n"
]