[
    "Context:\n\nAt the 2004 Summer Olympics, she originally won the gold medal in shot put, but tested positive for stanozolol and was stripped of the medal. She later received a life ban from the IAAF in a Memorandum of 21 September 2005. Korzhanenko refused to return the gold medal, despite the pressure of the International Athletics Federation's officials. As of 2023, she has not returned the gold medal.\n\nInstruction:\n\nDoes Irina Korzhanenko still have her gold medal?Answer:\n\nYes, although she was stripped of the medal she refused to return it.\n\n",
    "Context:\n\nGary C. Butler was the CEO and president of Automatic Data Processing. He held this position from August 2006 through November 2011, and had been with the company for 37 years. From 1990 to 1995, he served as Group President for ADP's Dealer Services Group; and from 1995 to 1998 he served in the same capacity for ADP's Employer Services Group. Prior to assuming his role as CEO in 2006, Butler was President and Chief Operating Officer of the company.\n\nInstruction:\n\nWhat did Gary C. Butler do?Answer:\n\nGary C. Butler was the CEO and president of Automatic Data Processing.\n\n",
    "Context:\n\nThe Legislative Council consisted of six official members appointed by the High Commissioner and twelve elected members, three of which were Muslims and nine of which were non-Muslims.\n\nThe island was divided into three constituencies, each formed of two districts. Each constituency elected one Muslim and three non-Muslims. Muslim voters had one vote, whilst non-Muslims could vote for up to three candidates. Due to the high levels of illiteracy, voting was not secret, with voters required to tell the polling officers their candidates of choice, often in front of agents of the candidates.\n\nSuffrage was limited to men aged over 21 who had been permanent residents during the five years prior to the elections, and who had paid either the verghi tax (which was levied as an annual payment of one four-thousandth of a property's value, 4% of rental income or 3% on profits or salaries) or rent for a dwelling or shop within the last year. However, of the estimated 40,000 taxpayers in the territory at the time of the elections, only those that had been able to pay their taxes on time were able to register to vote. The number of registered voters for the non-Muslim seats dropped from 15,408 in 1886 to 10,030.\n\nInstruction:\n\ngiven this reference text about 1891 Cypriot legislative election, What caused the non-Muslim seats to drop in 1886 to 10,030?Answer:\n\nDue to the requirement of paying your taxes on time in the previous year to be able to register to vote, the number of voters that were non-Muslim dropped.\n\n",
    "Context:\n\nThe Parliamentary Commissioner for Standards is an officer of the British House of Commons. The work of the officer is overseen by the Commons Select Committee on Standards.\n\nThe current commissioner is Daniel Greenberg.\n\nDuties\nThe commissioner is in charge of regulating MPs' conduct and propriety. One of the commissioner's main tasks is overseeing the Register of Members' Financial Interests, which is intended to ensure disclosure of financial interests that may be of relevance to MPs' work.\n\nThe Commissioner is the decision-maker in cases from the Independent Complaints and Grievance Scheme where the respondent is a Member of Parliament. If the Commissioner deems a sanction warranted, they refer cases to the Independent Expert Panel so the appropriate sanction can be determined.\n\nThe Parliamentary Commissioner for Standards is appointed by a resolution of the House of Commons for a fixed term of five years and is an independent officer of the House, working a four-day week. The remit of the Parliamentary Commissioner for Standards does not extend to the House of Lords: the post of Lords Commissioner for Standards was created in 2010.\n\nInstruction:\n\nGiven a reference text about the Parliamentary Commissioner for Standards, how is the position appointed?Answer:\n\nThe Parliamentary Commissioner for Standards is appointed by a resolution of the House of Commons for a fixed term of five years.\n\n",
    "Context:\n\nSanderson rose to prominence in late 2007 when Harriet McDougal, the wife and editor of author Robert Jordan, chose Sanderson to complete the final books in Jordan's epic fantasy series The Wheel of Time after Jordan's death. McDougal asked Sanderson to finish the series after being deeply impressed by his first Mistborn novel, The Final Empire. Tor Books made the announcement on December 7, 2007. After reviewing what was necessary to complete the series, Sanderson and Tor announced on March 30, 2009, that a final three books would be published instead of just one.\n\nThe first of these, The Gathering Storm, was published on October 27, 2009, and reached the number-one spot on the New York Times bestseller list for hardcover fiction.Towers of Midnight, the second-to-last Wheel of Time book, was published just over a year after The Gathering Storm on November 2, 2010, debuting at number one on the bestseller list. In early 2013, the series was completed with the publication of A Memory of Light.\n\nInstruction:\n\nWho finished the Wheel of Time series?Answer:\n\nThe death of Robert Jordan, the original author of the Wheel of Time series, prompted his wife and editor, Harriet McDougal, to find someone to complete her late husband's work. She chose Brandon Sanderson, who had recently released the popular first novel of the Mistborn series, The Final Empire. Sanderson agreed after reviewing Jordan's notes.\n\n",
    "Context:\n\nPasteur married Marie Pasteur (née Laurent) in 1849. She was the daughter of the rector of the University of Strasbourg, and was Pasteur's scientific assistant. They had five children together, three of whom died as children. Their eldest daughter, Jeanne, was born in 1850. She died from typhoid fever, aged 9, whilst at the boarding school Arbois in 1859. In 1865, 2-year-old Camille died of a liver tumour. Shortly after they decided to bring Cécile home from boarding school, but she too died of typhoid fever on 23 May 1866 at the age of 12. Only Jean Baptiste (b. 1851) and Marie Louise (b. 1858) survived to adulthood. Jean Baptiste would be a soldier in the Franco-Prussian War between France and Prussia.\n\nInstruction:\n\nHow many children did Louis Pasteur have, and how many died of typhoid fever?Answer:\n\nLouis Pasteur had 5 children, 2 of which died from Typhoid fever\n\n",
    "Context:\n\nElson joined the Hilltoppers staff as a defensive backs coach in 1996. He served as defensive coordinator for the 2001 and 2002 season before he was promoted to head coach. The rise to college football's highest level was difficult for the program, and Hilltoppers went 2-20 in Elson's final two seasons.\n\nOn November 9, 2009 Elson was fired by the university, finishing out the 2009 season. WKU alumnus and Stanford running backs coach Willie Taggart replaced him.\n\nIn March 2010, Indiana University head football coach Bill Lynch announced that Elson will be a defensive quality control coach. Coach Lynch noted this would mainly be an administrative role, but that he would be involved in coaching decisions. The Hoosiers made their first road trip of the year to play Elson's former team, the WKU Hilltoppers in Bowling Green, Kentucky.\n\nElson spent the 2011 football season as defensive coordinator for KHSAA state finalist Franklin-Simpson High School in Franklin, Kentucky.\n\nOn January 4, 2012, Elson was announced as the defensive coordinator at New Mexico State University.\n\nOn January 13, 2013, Elson was announced as the new secondary coach for the Southern Illinois University Carbondale, where he was a graduate assistant from 94 to 95. On January 20, 2016, after two years at Southern Illinois, Elson accepted the position as defensive coordinator at Western Illinois under new head coach Charlie Fisher.\n\nInstruction:\n\nWhat was the first road trip after Elson joined Indiana University?Answer:\n\nThe roadtrip was to play the WKU Hilltoppers in Bowling Green, Kentucky\n\n",
    "Context:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nWrestling career\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. He had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\nInstruction:\n\nWas Wilbur Snyder a good wrestlerAnswer:\n\nWilbur Snyder (September 15, 1929 – December 25, 1991) was an American football player and professional wrestler.\n\nSnyder's wrestling debut occurred during football's 1953 off-season. He was trained by Sandor Szabo and Warren Bockwinkel in Southern California. In 1954, Snyder retired from football completely to pursue a full-time career in wrestling. Part of his in-ring persona included the use of many football tactics, and it garnered Snyder a lot of national attention. \n\nHe had already been a regional champion in Montreal, Quebec, Canada when he made a name for himself by defeating Verne Gagne and winning the United States Championship at Marigold Arena in Chicago on April 7, 1956.\n\n",
    "Context:\n\nZoom Video Communications, Inc. (commonly shortened to Zoom, and stylized as zoom) is a communications technology company headquartered in San Jose, California. It provides videotelephony and online chat services through a cloud-based peer-to-peer software platform used for video communications (Meetings), messaging (Chat), voice calls (Phone), conference rooms for video meetings (Rooms), virtual events (Events) and contact centers (Contact Center), and offers an open platform allowing third-party developers to build custom applications on its unified communications platform (Developer Platform). The company was founded in 2011 by Eric Yuan, a former Cisco engineer and executive. It launched its software in 2013.\n\nInstruction:\n\nGiven this paragraph about Zoom, where is the company based and when was the Zoom software released?Answer:\n\nZoom Video Communications, Inc is based in San Jose, California. The software launched by the company was released in 2013.\n\n",
    "Context:\n\nPinot noir (French: [pino nwaʁ]) is a red-wine grape variety of the species Vitis vinifera. The name may also refer to wines created predominantly from pinot noir grapes. The name is derived from the French words for pine and black. The word pine alludes to the grape variety having tightly clustered, pinecone–shaped bunches of fruit.\n\nInstruction:\n\nWhat does Pinot Noir mean?Answer:\n\nThe name Pinot Noir is derived from the French words for pine and black.\n\n",
    "Context:\n\nAlibaba is one of the world's largest retailers and e-commerce companies. In 2020, it was also rated as the fifth-largest artificial intelligence company. It is also one of the biggest venture capital firms and investment corporations in the world, as well as the second largest financial services group behind Visa via its fintech arm Ant Group. The company hosts the largest B2B (Alibaba.com), C2C (Taobao), and B2C (Tmall) marketplaces in the world. It has been expanding into the media industry, with revenues rising by triple percentage points year after year. It also set the record on the 2018 edition of China's Singles' Day, the world's biggest online and offline shopping day.\n\nInstruction:\n\nWhat is the largest retailers and e-commerce companies?Answer:\n\nAlibaba is one of the world's largest retailers and e-commerce companies. It consists of many business including B2B (Alibaba.com), C2C (Taobao) and B2C (Tmall). Alibaba is also one of the largest financial companies and AI companies.\n\n",
    "Context:\n\nPenguins (order Sphenisciformes /sfɪˈnɪsəfɔːrmiːz/, family Spheniscidae /sfɪˈnɪsɪdiː, -daɪ/) are a group of aquatic flightless birds. They live almost exclusively in the Southern Hemisphere: only one species, the Galápagos penguin, is found north of the Equator. Highly adapted for life in the water, penguins have countershaded dark and white plumage and flippers for swimming. Most penguins feed on krill, fish, squid and other forms of sea life which they catch with their bills and swallow whole while swimming. A penguin has a spiny tongue and powerful jaws to grip slippery prey.\n\nInstruction:\n\nCan Penguins fly?Answer:\n\nPenguins are a group of aquatic flightless birds.\n\n",
    "Context:\n\nThe giant panda is a bear species endemic to China. It is a Carnivora, the giant panda is a folivore, with bamboo shoots and leaves making up more than 99% of its diet.\n\nInstruction:\n\nWhat do giant Pandas eats?Answer:\n\nthe giant panda is a folivore, with bamboo shoots and leaves making up more than 99% of its diet.\n\n",
    "Context:\n\nExtended ASCII is a repertoire of character encodings that include (most of) the original 96 ASCII character set, plus up to 128 additional characters. There is no formal definition of \"extended ASCII\", and even use of the term is sometimes criticized, because it can be mistakenly interpreted to mean that the American National Standards Institute (ANSI) had updated its ANSI X3.4-1986 standard to include more characters, or that the term identifies a single unambiguous encoding, neither of which is the case.\n\nThe ISO standard ISO 8859 was the first international standard to formalize a (limited) expansion of the ASCII character set: of the many language variants it encoded, ISO 8859-1 (\"ISO Latin 1\") – which supports most Western European languages – is best known in the West. There are many other extended ASCII encodings (more than 220 DOS and Windows codepages). EBCDIC (\"the other\" major character code) likewise developed many extended variants (more than 186 EBCDIC codepages) over the decades.\n\nThe technology has largely been rendered technically obsolete by Unicode, which has code points for all the characters encoded in the various attempts to extend ASCII. All modern operating systems use this technology. Nevertheless, the topic remains important in the history of computing.\n\nInstruction:\n\nBased on the provided text, what technology rendered Extended ASCII obsolete?Answer:\n\nUnicode rendered extended ASCII obsolete.\n\n",
    "Context:\n\nIn 1931 the Ford Motor Company relocated from Trafford Park in Manchester, to a larger new plant in Dagenham, which was already the location of supplier Briggs Motorway Bodies. A 500-acre (200 ha) riverside site was developed to become Europe's largest car plant, a vast vertically integrated site with its own blast furnaces and power station, importing iron ore and exporting finished vehicles. By the 1950s Ford had taken over Briggs at Dagenham and its other sites at Doncaster, Southampton, Croydon and Romford. At its peak the Dagenham plant had 4,000,000 square feet (370,000 m2) of floor space and employed over 40,000 people, although this number gradually fell during the final three decades of the 20th century as production methods advanced and Ford invested in other European factories as well. Some of Britain's best selling cars, including the Fiesta, Escort, Cortina and Sierra, were produced at the plant over the next 71 years.\n\nInstruction:\n\nTo which town in the UK did the Ford Motor Company relocate to in 1931?Answer:\n\nDagenham\n\n",
    "Context:\n\nThis article is about 21st century genre and overarching term for West African pop music. For the 1960s/1970s genre made by artists such as Fela Kuti and Tony Allen, see Afrobeat. For the British genre popularised by J Hus, see Afroswing.\n\nInstruction:\n\nWhat is the history of Afrobeats?Answer:\n\nAfrobeats (not to be confused with Afrobeat or Afroswing), or Afro-pop or Afro-fusion (or Afropop or Afrofusion), is an umbrella term to describe popular music from West Africa and the diaspora that initially developed in Nigeria, Ghana, and the UK in the 2000s and 2010s. Afrobeats is less of a style per se, and more of a descriptor for the fusion of sounds flowing out of Ghana and Nigeria. Genres such as hiplife, jùjú music, highlife and naija beats, among others, were amalgamated under the 'Afrobeats' umbrella.\n\n",
    "Context:\n\nScholars generally acknowledge six cradles of civilization. Mesopotamia, Ancient Egypt, Indus Valley, and Ancient China are believed to be the earliest in the Old World. Cradles of civilization in the New World are the Caral-Supe civilization of coastal Peru and the Olmec civilization of Mexico. All of the cradles of civilization depended upon agriculture for sustenance (except possibly Caral-Supe which may have depended initially on marine resources). All depended upon farmers producing an agricultural surplus to support the centralized government, political leaders, priests, and public works of the urban centers of the civilization.\n\nLess formally, the term \"cradle of civilization\" is often used to refer to other historic ancient civilizations, such as Greece or Rome, which have both been called the \"cradle of Western civilization\".\n\nInstruction:\n\nWhat is the oldest known civilization?Answer:\n\nThe oldest known human civilizations are known to exist in Mesopotamia (Modern day Iraq), Indus Valley (a region located in modern-day Pakistan), Ancient Egypt and Ancient China.\n\n",
    "Context:\n\nHawaii became a unified, internationally recognized kingdom in 1810, remaining independent until American and European businessmen overthrew the monarchy in 1893; this led to annexation by the U.S. in 1898. As a strategically valuable U.S. territory, Hawaii was attacked by Japan on December 7, 1941, which brought it global and historical significance, and contributed to America's decisive entry into World War II. Hawaii is the most recent state to join the union, on August 21, 1959. In 1993, the U.S. government formally apologized for its role in the overthrow of Hawaii's government, which spurred the Hawaiian sovereignty movement.\n\nHistorically dominated by a plantation economy, Hawaii remains a major agricultural exporter due to its fertile soil and uniquely tropical climate in the U.S. Its economy has gradually diversified since the mid-20th century, with tourism and military defense becoming the two largest sectors. The state attracts tourists, surfers, and scientists with its diverse natural scenery, warm tropical climate, abundance of public beaches, oceanic surroundings, active volcanoes, and clear skies on the Big Island. Hawaii hosts the U.S. Pacific Fleet, the world's largest naval command, as well as 75,000 employees of the Defense Department.\n\nIts relative isolation results in one of the highest costs of living in the United States, and Hawaii is the third-wealthiest state.\n\nInstruction:\n\nGiven this text, what is the third wealthiest state in the USA?Answer:\n\nAccording to this text, Hawaii is the third wealthiest state in the United States of America.\n\n",
    "Context:\n\nThe company was incorporated as Tesla Motors, Inc. on July 1, 2003, by Martin Eberhard and Marc Tarpenning. Eberhard and Tarpenning served as CEO and CFO, respectively. Eberhard said he wanted to build \"a car manufacturer that is also a technology company\", with its core technologies as \"the battery, the computer software, and the proprietary motor\".\n\nIan Wright was Tesla's third employee, joining a few months later. In February 2004, the company raised $7.5 million in series A funding, including $6.5 million from Elon Musk, who had received $100 million from the sale of his interest in PayPal two years earlier. Musk became the chairman of the board of directors and the largest shareholder of Tesla. J. B. Straubel joined Tesla in May 2004 as chief technical officer.\n\nA lawsuit settlement agreed to by Eberhard and Tesla in September 2009 allows all five – Eberhard, Tarpenning, Wright, Musk, and Straubel – to call themselves co-founders.\n\nInstruction:\n\nWho was chairman of the board of directors of Tesla as of March 2004?Answer:\n\nElon Musk\n\n",
    "Context:\n\nIn computing, a materialized view is a database object that contains the results of a query. For example, it may be a local copy of data located remotely, or may be a subset of the rows and/or columns of a table or join result, or may be a summary using an aggregate function.\n\nInstruction:\n\nWhat is Materialized View?Answer:\n\nIn Database, a materialized view (MV) is a database object that stores the results of a query. It can be a copy of data from a remote location, a subset of rows and/or columns from a table or join result, or a summary using an aggregate function. MV is normally used for frequent queries of based tables.\n\n",
    "Context:\n\nIrina Vysheslavska was born in Kiev on February 20, 1939, into a family of great cultural traditions. Her father Leonid Vysheslavsky was a noted poet and her mother Agnes Baltaga was a writer. Several of her ancestors were priests in Greece, Romania and Ukraine.\n\nInstruction:\n\nWhen was Irina Vysheslavska born?Answer:\n\nIrina Vysheslavska was born on February 20, 1939.\n\n",
    "Context:\n\nThe XYZ Affair was a political and diplomatic episode in 1797 and 1798, early in the presidency of John Adams, involving a confrontation between the United States and Republican France that led to the Quasi-War. The name derives from the substitution of the letters X, Y, and Z for the names of French diplomats Jean-Conrad Hottinguer (X), Pierre Bellamy (Y), and Lucien Hauteval (Z) in documents released by the Adams administration.\n\nInstruction:\n\nWhat was the \"X.Y.Z. fever\"?Answer:\n\nThe \"X.Y.Z. fevor\" is a reference to a diplomatic incident that occurred during the administration of the second President of the United Status, John Adams.   Adams sent a diplomatic delegation to France to negotiate a resolution of issues that were threatening to lead to war.  The French foreign minister, Charles-Maurice de Talleyrand-Périgord (Talleyrand) demanded a bribe and a loan to begin the negotiations.   President Adams refused Tallyrand's request and reported the solicitation to Congress.  The Senate printed President Adam's report which referred to the three French diplomats involved, Jean-Conrad Hottinguer, Pierre Bellamy, and Lucien Hauteval as \"X,Y, and Z\" respectively.   \nThe populace supported Adams decision to refuse Tallyrand's bribe request.  Vice-President Thomas Jefferson referred to the outpouring of support for Adam's political party that followed  as \"X.Y.Z. fevor\".\n\n",
    "Context:\n\nMeaghan Benfeito (born March 2, 1989) is a Canadian diver. She used to compete in the 10m synchronized event with Roseline Filion before the latter retired in January 2017. Benfeito and Filion won bronze medals in the 10 m platform synchro event at the 2012 and 2016 Summer Olympics, and in the latter event Benfeito also won a bronze medal in the 10 m platform individual event.\n\nEarly life\nBenfeito was born on March 2, 1989, in Montreal, Quebec to Portuguese parents, Arthur Benfeito and Margarida Correia. She has younger twin sisters, Alicia and Chelsea.\n\nCareer\nShe began diving for Canada in 2005 and credits Emilie Heymans and Alexandre Despatie for inspiring her to take up the sport. She won a bronze medal at the 2005 World Aquatics Championships in her hometown of Montreal, but she and Filion have been unable to return to the medal podium at the Worlds since. In 2006, they won a bronze at the Commonwealth Games. Benfeito won a bronze medal at the 2007 Pan American Games in the 3m Synchronized event with Kelly MacDonald.\n\nBenfeito and Filion qualified for the Beijing Olympics after they beat teammates Heymans and Marie-Eve Marleau which was considered a dramatic upset, particularly at defeating Canadian diving legend Heymans. At the 2008 Summer Olympics, the diving partners finished in 7th place. She did not compete in the 2010 Commonwealth Games due to a lingering shoulder injury that had not healed in time.\n\nBoth the ladies failed to medal at any events leading into the 2012 Summer Olympics in London. At the 2012 edition the two Canadians managed to hold third place through nearly the whole competition in the 10 m platform synchro event. After the medal clinching dive she said that \"We gave it all we had and we came away with a bronze medal. We're pretty happy with that.\" A Quebec politician from a provincially sovereigntist party, the Parti Québécois, commented on the medals won by Benfeito and others as the first four medals won were from Quebec athletes. Pauline Marois said that \"\"This means, among other things, that it’s another example of how Quebec could shine among the brightest ... as an independent country. We could continue to win our medals, I’m sure of that.\" Benfeito responded to a similar question from Canadian media when asked if she was as proud of the day as all the day's medalists were from Quebec athletes by saying that \"No, we are one big happy gang. We are equally as proud of our home in Quebec as we are of our home in Canada.\"\n\nAt the 2014 Commonwealth Games, she won a gold medal in the 10 m platform synchronised with Fillion, and gold in the 10 m platform individual.\n\nAt the 2016 Summer Olympics in Rio de Janeiro, Benfeito and Filion repeated their bronze medal performance in the 10 m platform synchro event, while Benfeito won an additional individual medal in the individual platform diving event. Fillion placed sixth in the latter event.\n\nBenfeito was named as Canada's flag bearer for the 2018 Commonwealth Games in the Gold Coast, Australia.\n\nShe has qualified to represent Canada at the 2020 Summer Olympics. After successfully completing the preliminaries of the 10 metre tower, she finished 13th in the semi-finals and did not advance to the final. She announced her last Olympics were Tokyo and plans to retired from diving.\n\nIn April 2022, she announced her retirement from diving.\n\nInstruction:\n\nhere is a blurb about Meaghan Benfeito, Between which years was Benfeito actively competing in the Olympics?Answer:\n\nBetween the Olympics of 2008 and 2020, in 2022 she retired from Diving.\n\n",
    "Context:\n\nThe Night Buffalo (orig. Spanish El Búfalo de la Noche) is a novel by Guillermo Arriaga.\n\nPlot summary\nAfter Gregorio commits suicide, his friend Manuel finds himself unraveling his late friend’s world, and what led him to suicide. Gregorio’s tortuous relationship with his girlfriend is now inherited by Manuel; he becomes involved with his late friend’s girlfriend. Gregorio has missed appointments, left strange messages, and has been harassed by a vengeful policeman.\n\nInstruction:\n\nGiven this plot summary from The Night Buffalo, what caused Manuel to discover these occurrences caused by his late friend?Answer:\n\nGregorio committed suicide, this caused Manuel to go down a path of discoveries uncovering what led him to suicide.\n\n",
    "Context:\n\nFabio Garriba (13 November 1944 – 9 August 2016) was an Italian stage, film and television actor.\n\nLife and career\nBorn in Soave, Garriba started his career on stage, and in 1969 he made his film debut in Dziga Vertov Group's Wind from the East. He later worked with prominent directors such as Roberto Rossellini, Bernardo Bertolucci, Ettore Scola, Marco Bellocchio and Luigi Magni. He also had leading roles in films directed by his twin brother Mario, notably the Golden Leopard winner On the Point of Death.\n\nGarriba also worked as assistant director for Bernardo Bertolucci, Pier Paolo Pasolini, Marco Ferreri and Carmelo Bene. His only work as director, the short film I parenti tutti, was screened at the 68th Venice International Film Festival alongside his brother's works in the retrospective \"Orizzonti 1960-1978\". Garriba also published several collections of poetries.\n\nInstruction:\n\nWho was On the Point of Death directed by, given the following information?Answer:\n\nMario Garriba directed On the Point of Death which stars his brother Fabio in a leading role.\n\n"
]