[
    "Context:\n\nASML produces the photolithography machines used in the production of computer chips. In these machines, patterns are optically imaged onto a silicon wafer that is covered with a film of light-sensitive material (photoresist). This procedure is repeated dozens of times on a single wafer. The photoresist is then further processed to create the actual electronic circuits on the silicon. The optical imaging that ASML's machines deal with is used in the fabrication of nearly all integrated circuits and, as of 2011, ASML had 67 percent of the worldwide sales of lithography machines.\n\nASML's competition consisted of Ultratech, Canon and Nikon, MKS Instruments, Lam Research and Cadence Design Systems.[citation needed]\n\nInstruction:\n\nAccording to this passage, what percent of the lithography machine market do Ultratech, Canon and Nikon, MKS Instruments, Lam Research and Cadence Design Systems have in aggregate?\n\nAnswer:\n\nIf ASML has 67 percent of the worldwide sales of lithography machines and if Ultratech, Canon and Nikon, MKS Instruments, Lam Research and Cadence Design Systems represent their sole competition, than these companies must share the remaining 33 percent of the market.\n\n",
    "Context:\n\nThere are ten different eye layouts—indeed every technological method of capturing an optical image commonly used by human beings, with the exceptions of zoom and Fresnel lenses, occur in nature. Eye types can be categorised into \"simple eyes\", with one concave photoreceptive surface, and \"compound eyes\", which comprise a number of individual lenses laid out on a convex surface. Note that \"simple\" does not imply a reduced level of complexity or acuity. Indeed, any eye type can be adapted for almost any behaviour or environment. The only limitations specific to eye types are that of resolution—the physics of compound eyes prevents them from achieving a resolution better than 1°. Also, superposition eyes can achieve greater sensitivity than apposition eyes, so are better suited to dark-dwelling creatures. Eyes also fall into two groups on the basis of their photoreceptor's cellular construction, with the photoreceptor cells either being cilliated (as in the vertebrates) or rhabdomeric. These two groups are not monophyletic; the cnidaria also possess cilliated cells,  and some gastropods, as well as some annelids possess both.\n\nSome organisms have photosensitive cells that do nothing but detect whether the surroundings are light or dark, which is sufficient for the entrainment of circadian rhythms. These are not considered eyes because they lack enough structure to be considered an organ, and do not produce an image.\n\nInstruction:\n\nGiven this paragraph about different types of eyes, how are eye types categorized and why?\n\nAnswer:\n\nEyes are categorized into two types, \"simple eyes\" and \"compound eyes\". In this case, \"simple eyes\" do not mean that they have reduced complexity or acuity, but rather that they have one concave photoreceptive surface. This is in contrast to \"compound eyes\" which are comprised of a number of individual lenses on a convex surface. In other words, eyes fall into two groups based on their photoreceptor's cellular construction either being cilliated (as in the vertebrates) or rhabdomeric.\n\n",
    "Context:\n\nZoom Video Communications, Inc. (commonly shortened to Zoom, and stylized as zoom) is a communications technology company headquartered in San Jose, California. It provides videotelephony and online chat services through a cloud-based peer-to-peer software platform used for video communications (Meetings), messaging (Chat), voice calls (Phone), conference rooms for video meetings (Rooms), virtual events (Events) and contact centers (Contact Center), and offers an open platform allowing third-party developers to build custom applications on its unified communications platform (Developer Platform). The company was founded in 2011 by Eric Yuan, a former Cisco engineer and executive. It launched its software in 2013.\n\nInstruction:\n\nGiven this paragraph about Zoom, where is the company based and when was the Zoom software released?\n\nAnswer:\n\nZoom Video Communications, Inc is based in San Jose, California. The software launched by the company was released in 2013.\n\n",
    "Context:\n\nIn the United States, the Recording Industry Association of America (RIAA) awards certification based on the number of albums and singles sold through retail and other ancillary markets. Other countries have similar awards (see music recording certification). Certification is not automatic; for an award to be made, the record label must first request certification. The audit is conducted against net shipments after returns (most often an artist's royalty statement is used), which includes albums sold directly to retailers and one-stops, direct-to-consumer sales (music clubs and mail order) and other outlets.\n\nDescription and qualifications\n\nA platinum award for the album GHV2 of Madonna\nA Gold record is a song or album that sells 500,000 units (records, tapes, and compact discs). The award was launched in 1958; originally, the requirement for a Gold single was one million units sold and a Gold album represented $1 million in sales (at wholesale value, around a third of the list price). In 1975, the additional requirement of 500,000 units sold was added for Gold albums. Reflecting growth in record sales, the Platinum award was added in 1976, for albums able to sell one million units, and singles selling two million units. The Multi-Platinum award was introduced in 1984, signifying multiple Platinum levels of albums and singles. In 1989, the sales thresholds for singles were reduced to 500,000 for Gold and 1,000,000 for Platinum, reflecting a decrease in sales of singles. In 1992, RIAA began counting each disc in a multi-disc set as one unit toward certification. Reflecting additional growth in music sales, the Diamond award was instituted in 1999 for albums or singles selling ten million units. Because of these changes in criteria, the sales level associated with a particular award depends on when the award was made.\n\nInstruction:\n\nGiven a reference text about the Recording Industry Association of America (RIAA) awards, tell me how many albums need to be sold to get an award.\n\nAnswer:\n\nAs of 1989, a song or album needed to exceed a sales threshold of 500,000 for Gold and 1,000,000 for Platinum. In 1999 after a growth in music sales, the Diamond award was introduced for songs or albums that sold over 10,000,000 units.\n\n",
    "Context:\n\nAs of 2023 the SR-71 holds the world record it set in 1976 as the fastest air-breathing manned aircraft.\n\nInstruction:\n\nWhat is the fastest air-breathing manned aircraft?\n\nAnswer:\n\nAs of 2023 the SR-71 is the fastest air-breathing manned aircraft. It can reach a maximum speed of Mach 3.3\n\n",
    "Context:\n\nMohammed Shah I (reigned 1358–1375) was the second ruler of the Bahmani Sultanate, a late medieval kingdom of India. He succeeded his father Ala-ud-Din Bahman Shah. His reign was marked by a series of wars between his kingdom and two neighboring kingdoms, the Vijayanagara and the Warangal under Kapaya Nayaka. He was succeeded by his son Alauddin Mujahid Shah.\n\nInstruction:\n\nBased on this article, what was the relationship between Ala-ud-Din Bahman Shah and Alauddin Mujahid Shah?\n\nAnswer:\n\nAlauddin Mujahid Shah was the grandson of Ala-ud-Din Bahman Shah by his son Mohammed Shah I.\n\n",
    "Context:\n\nThe Kubernetes master node handles the Kubernetes control plane of the cluster, managing its workload and directing communication across the system. The Kubernetes control plane consists of various components, each its own process, that can run both on a single master node or on multiple masters supporting high-availability clusters. The various components of the Kubernetes control plane are as follows:\n\netcd is a persistent, lightweight, distributed, key-value data store that CoreOS has developed. It reliably stores the configuration data of the cluster, representing the overall state of the cluster at any given point of time. etcd favors consistency over availability in the event of a network partition (see CAP theorem). The consistency is crucial for correctly scheduling and operating services.\nThe API server serves the Kubernetes API using JSON over HTTP, which provides both the internal and external interface to Kubernetes. The API server processes and validates REST requests and updates the state of the API objects in etcd, thereby allowing clients to configure workloads and containers across worker nodes. The API server uses etcd's watch API to monitor the cluster, roll out critical configuration changes, or restore any divergences of the state of the cluster back to what the deployer declared. As an example, the deployer may specify that three instances of a particular \"pod\" (see below) need to be running. etcd stores this fact. If the Deployment Controller finds that only two instances are running (conflicting with the etcd declaration), it schedules the creation of an additional instance of that pod.\nThe scheduler is the extensible component that selects on which node an unscheduled pod (the basic entity managed by the scheduler) runs, based on resource availability. The scheduler tracks resource use on each node to ensure that workload is not scheduled in excess of available resources. For this purpose, the scheduler must know the resource requirements, resource availability, and other user-provided constraints or policy directives such as quality-of-service, affinity vs. anti-affinity requirements, and data locality. The scheduler's role is to match resource \"supply\" to workload \"demand\".\nA controller is a reconciliation loop that drives the actual cluster state toward the desired state, communicating with the API server to create, update, and delete the resources it manages (e.g., pods or service endpoints). One kind of controller is a Replication Controller, which handles replication and scaling by running a specified number of copies of a pod across the cluster. It also handles creating replacement pods if the underlying node fails. Other controllers that are part of the core Kubernetes system include a DaemonSet Controller for running exactly one pod on every machine (or some subset of machines), and a Job Controller for running pods that run to completion (e.g., as part of a batch job). Labels selectors that are part of the controller's definition specify the set of pods that a controller manages.\nThe controller manager is a process that manages a set of core Kubernetes controllers.\n\nInstruction:\n\nGiven this paragraph about kubernetes, what is the storage layer of Kubernetes control plane?\n\nAnswer:\n\nETCD\n\n",
    "Context:\n\nThe 149th Boat Race took place on 6 April 2003. Held annually, the Boat Race is a side-by-side rowing race between crews from the Universities of Oxford (in dark blue) and Cambridge (in light greenish blue) along a 4.2-mile (6.8 km) tidal stretch of the River Thames in south-west London. The lead changed twice during the race, which Oxford won by one foot (30 cm), the smallest margin of victory in the history of the event. The close race has been described as \"epic\", while Olympic gold medallist Steve Redgrave suggested that the race was the \"greatest we will see in our lifetimes\".\n\nInstruction:\n\nBased on the reference paragraph, when was the 149th Boat Race?\n\nAnswer:\n\nApril 6, 2003\n\n",
    "Context:\n\nAloy (Ashly Burch) is cast out from the Nora tribe at birth and raised by a fellow outcast named Rost (JB Blanc). As a child (Ava Potter), Aloy obtains a Focus, an augmented reality device that gives her special perceptive abilities. Aloy becomes curious about her origins and is told by Rost that if she wins the Proving, a competition to earn the right to become a member of the Nora, the tribe's Matriarchs might concede this information. Aloy spends some years training in combat and survival under Rost's instruction. After coming of age, Aloy participates in the Proving; she wins the competition, but masked cultists attack the Nora. Rost sacrifices himself to save Aloy from their leader, Helis (Crispin Freeman). When Aloy awakens, the Matriarchs explain that Aloy was found as an infant before a sealed door within the Nora's sacred mountain and that these suspicious origins were the reason for her being an outcast. The Matriarchs name Aloy a \"Seeker,\" allowing her to leave their lands in pursuit of the cultists. Aloy eventually learns that the cultists are part of a splinter Carja faction called the Eclipse and that Aloy was targeted due to her resemblance to an Old World scientist named Elisabet Sobeck (also voiced by Burch). Aloy locates the ruined corporate campus of Faro Automated Solutions and discovers that the Old World was destroyed nearly a thousand years ago after Faro lost control of its automated peacekeeper military robots. The robots, which could self-replicate and consume biomass, overran the planet and engulfed the biosphere, stripping Earth of life. Zero Dawn, a project spearheaded by Sobeck, was initiated to create an automated terraforming system to deactivate the robots and restore life to Earth.\n\nInstruction:\n\nBased on the given passage tell me who masked cultists are?\n\nAnswer:\n\nThe masked cultists attacked the Nora when Aloy won the proving competition. Their leader was named Helis. The cultists were part of a splinter Carja faction called the Eclipse and wanted to kill Aloy due to her resemblance to an Old World scientist named Elisabet Sobeck.\n\n",
    "Context:\n\nAfter the Russo-Japanese War, the First Treaty was signed on 30 July 1907 by Motono Ichirō, the Japanese Ambassador in Moscow, and Alexander Izvolsky, the Foreign Minister of Russian. The treaty was divided into two parts: one is open agreement, which respected the treaties concluded between the two countries and China, respected China's independence, promoted open doors, and achieved equal opportunities and another is secret agreement, which defined the scope of Japan's interests in Southern Manchuria and Russia's interests in Northern Manchuria and Japan recognized Russia's interests in Outer Mongolia, and Russia recognized Japan's interests in the Korean Peninsula.\n\nInstruction:\n\nGiven this paragraph about the First Treaty that was signed after the Russo-Japanese War, was there a secret component?\n\nAnswer:\n\nYes. The second part of the First Treaty contained a secret agreement which defined the political scope of each party's interest.\n\n",
    "Context:\n\nTwitch is an American video live streaming service that focuses on video game live streaming, including broadcasts of esports competitions, in addition to offering music broadcasts, creative content, and \"in real life\" streams. Twitch is operated by Twitch Interactive, a subsidiary of Amazon.com, Inc. It was introduced in June 2011 as a spin-off of the general-interest streaming platform Justin.tv. Content on the site can be viewed either live or via video on demand. The games shown on Twitch's current homepage are listed according to audience preference and include genres such as real-time strategy games (RTS), fighting games, racing games, and first-person shooters.\n\nThe popularity of Twitch eclipsed that of its general-interest counterpart. In October 2013, the website had 45 million unique viewers, and by February 2014, it was considered the fourth-largest source of peak Internet traffic in the United States. At the same time, Justin.tv's parent company was re-branded as Twitch Interactive to represent the shift in focus – Justin.tv was shut down in August 2014. That month, the service was acquired by Amazon for US$970 million, which later led to the introduction of synergies with the company's subscription service Amazon Prime. Twitch acquired Curse LLC in 2016, an operator of online video gaming communities and introduced means to purchase games through links on streams along with a program allowing streamers to receive commissions on the sales of games that they play.\n\nBy 2015, Twitch had more than 100 million viewers per month. In 2017, Twitch remained the leading live streaming video service for video games in the US, and had an advantage over YouTube Gaming, which shut down its standalone app in May 2019. As of February 2020, it had 3 million broadcasters monthly and 15 million daily active users, with 1.4 million average concurrent users. As of May 2018, Twitch had over 27,000 partner channels.[1\n\nInstruction:\n\nGiven this paragraph about Twitch Interactive, in what year did Amazon acquire them?\n\nAnswer:\n\nAmazon acquired Twitch in the year 2014.\n\n",
    "Context:\n\nElizabeth II (Elizabeth Alexandra Mary; 21 April 1926 – 8 September 2022) was Queen of the United Kingdom and other Commonwealth realms from 6 February 1952 until her death in 2022. She was queen regnant of 32 sovereign states during her lifetime and was head of state of 15 realms at the time of her death. Her reign of 70 years and 214 days was the longest of any British monarch and the longest verified reign of any female monarch in history.\n\nInstruction:\n\nWho was Elizabeth II?\n\nAnswer:\n\nElizabeth II was the queen of the United Kingdom and the longest-reigning monarch.\n\n",
    "Context:\n\nEaster eggs, also called Paschal eggs, are eggs that are decorated for the Christian feast of Easter, which celebrates the resurrection of Jesus. As such, Easter eggs are common during the season of Eastertide (Easter season). The oldest tradition, which continues to be used in Central and Eastern Europe, is to use dyed and painted chicken eggs.\n\nAlthough eggs, in general, were a traditional symbol of fertility and rebirth, in Christianity, for the celebration of Eastertide, Easter eggs symbolize the empty tomb of Jesus, from which Jesus was resurrected. In addition, one ancient tradition was the staining of Easter eggs with the colour red \"in memory of the blood of Christ, shed as at that time of his crucifixion.\"\n\nThis custom of the Easter egg, according to many sources, can be traced to early Christians of Mesopotamia, and from there it spread into Eastern Europe and Siberia through the Orthodox Churches, and later into Europe through the Catholic and Protestant Churches. Additionally, the widespread usage of Easter eggs, according to mediaevalist scholars, is due to the prohibition of eggs during Lent after which, on Easter, they have been blessed for the occasion.\n\nA modern custom in some places is to substitute chocolate eggs wrapped in coloured foil, hand-carved wooden eggs, or plastic eggs filled with confectionery such as chocolate.\n\nInstruction:\n\nGiven a reference text about Easter eggs, tell me what they are, what they symbolize, and where they originated from?\n\nAnswer:\n\nEaster eggs are decorated eggs celebrating the Christian holiday of Easter. They symbolize the empty tomb of Jesus. They originated in Mesopotamia.\n\n",
    "Context:\n\nBullimore is a surname. Notable people with the surname include:\n\nTony Bullimore (1939–2018), English sailor and businessman\nWayne Bullimore (born 1970), English footballer\n\nInstruction:\n\nIs Bullimore a first name?\n\nAnswer:\n\nNo, it is a surname.\n\n",
    "Context:\n\nSlater is also a fundraiser and spokesperson for suicide prevention awareness. He has surfed in celebrity events for Surfers Against Suicide, telling sports website 'Athletes Talk': \"I've lost a couple of friends myself to suicide and it's just a horrible thing that can be prevented. People get in this dark place and they don't know what to do so it's always nice to see a non-profit that isn't turning into anything else other than just trying to help people.\"\n\nSlater is passionate about preserving oceans globally and protecting temperate reefs in California through his relationship with Reef Check. Slater is on the Board of Advisors (the Ocean Advocacy Advisory Board) of ocean conservation organization Sea Shepherd Conservation Society.\n\nInstruction:\n\nBased on the paragraph below, please list out the 2 major causes supported by Kelly Slater.\n\nAnswer:\n\nKelly Slater's main activism has been directed towards suicide prevention and ocean conservation.\n\n",
    "Context:\n\nEnrico Silvestrin (born 30 May 1972) is an Italian actor, television and radio presenter and musician.\n\nLife and career\nBorn in Rome, after a supporting role in Michele Placido's Close Friends, in 1994 Silvestrin started working as a VJ on MTV Europe, and later on MTV Italy. In 2000, he refused the Gabriele Muccino's offer of starring in The Last Kiss preferring a role in the Italia 1 sitcom Via Zanardi 33, which eventually turned to be a flop.\n\nIn 2005 Silvestrin left MTV as to focus on his acting career. He then appeared in a number of films and TV-series, getting a personal success with the role of Alessandro Berti in the Canale 5 crime series Distretto di Polizia. In 2007 he presented the Festivalbar. In 2018 he competed in Grande Fratello VIP, the Italian adaptation of Celebrity Big Brother. He was the third contestant to be evicted on day 22.\n\nSilvestrin is also active as a musician. He has been part of the musical groups Agony in Cage, Tempus Fugit, Ilor and Silv3man. He is nephew on his mother's side of actor and playwright Peppino De Filippo.\n\nInstruction:\n\ngiven this article about Enrico Silvestrin, what year did he get evicted from Celebrity Big Brother?\n\nAnswer:\n\n2018\n\n",
    "Context:\n\nHawaii (/həˈwaɪi/ (listen) hə-WY-ee; Hawaiian: Hawaiʻi [həˈvɐjʔi] or [həˈwɐjʔi]) is a state in the Western United States, about 2,000 miles (3,200 km) from the U.S. mainland in the Pacific Ocean. It is the only U.S. state outside North America, the only state that is an archipelago, and the only state in the tropics.\n\nHawaii comprises nearly the entire Hawaiian archipelago, 137 volcanic islands spanning 1,500 miles (2,400 km) that are physiographically and ethnologically part of the Polynesian subregion of Oceania. The state's ocean coastline is consequently the fourth-longest in the U.S., at about 750 miles (1,210 km). The eight main islands, from northwest to southeast, are Niʻihau, Kauaʻi, Oʻahu, Molokaʻi, Lānaʻi, Kahoʻolawe, Maui, and Hawaiʻi—the last of these, after which the state is named, is often called the \"Big Island\" or \"Hawaii Island\" to avoid confusion with the state or archipelago. The uninhabited Northwestern Hawaiian Islands make up most of the Papahānaumokuākea Marine National Monument, the United States' largest protected area and the fourth-largest in the world.\n\nInstruction:\n\nAccording to this paragraph, what is the only state in North America that is an archpelago?\n\nAnswer:\n\nHawaii is the only state in North America that is an archipelago, according to this text.\n\n",
    "Context:\n\nECharts Java is a lightweight but comprehensive library for Java developers to easily use JavaScript visualization library Apache ECharts. The simple chart mode facilitates users to write visualization fast and easily, empowered by the clean APIs provided by ECharts Java. The advanced mode helps create an Option object and its Json representation in chainable Java codes, which includes almost all the features defined in Apache ECharts. Now ECharts Java supports Apache ECharts version 5.x.\n\nFeatures\n\n- Simple, clean and organized APIs, supporting method chaining\n- Full coverage of Apache ECharts functionalities\n- Easily integrate with Web Frameworks\n- Flexible export format, including HTML and images\n- Complete and detailed documentation and examples\n\nInstruction:\n\nWhat is ECharts Java?\n\nAnswer:\n\nECharts Java is a lightweight, comprehensive library for Java developers to easily integrate JavaScript visualization library Apache ECharts into their web frameworks. The simple and clean APIs facilitate users to develop visualization components fast and easily. For complex and advanced usage, it allows developers to create an Option object and its Json representation. It is compatible with Apache ECharts version 5.x and provides almost full coverage of Apache ECharts functionalities. \n\nHere are some highlights of ECharts Java:\n\n- Simple, clean, organized APIs with method chaining\n- Full coverage of Apache ECharts functionalities\n- Easily integrate with Web Frameworks\n- Flexible export format, including HTML and images\n- Complete and detailed documentation and examples\n\n",
    "Context:\n\nPalm Cove is located in Far North Queensland on the Australian coast. It has a long sandy beach along most of its seafront except for the rocky headland around Buchan Point in the north of the suburb.\n\nInstruction:\n\nWhere in Australia is Palm Cove located?\n\nAnswer:\n\nPalm Cove is located in Far North Queensland on the Australian coast.\n\n",
    "Context:\n\nGeling Yan (simplified Chinese: 严歌苓; traditional Chinese: 嚴歌苓; pinyin: Yán Gēlíng; born 16 November 1958]) is a Chinese-American author and screenwriter. Yan began performing as a dancer at age 12. She served in the People's Liberation Army in Chengdu, during the Cultural Revolution in Tibet and later as a journalist in the Sino-Vietnamese War, achieving a rank equivalent to lieutenant colonel.\n\nInstruction:\n\nWhat career did  GeLing Yan have?\n\nAnswer:\n\nShe is an author, screenwriter, and once was a dancer and a journalist.\n\n",
    "Context:\n\nRobyn Rihanna Fenty NH (/riˈænə/ (listen) ree-AN-ə;[n 1] born February 20, 1988) is a Barbadian singer, actress, and businesswoman. Born in Saint Michael and raised in Bridgetown, Barbados, Rihanna auditioned for American record producer Evan Rogers who invited her to the United States to record demo tapes. After signing with Def Jam in 2005, she soon gained recognition with the release of her first two studio albums, Music of the Sun (2005) and A Girl Like Me (2006), both of which were influenced by Caribbean music and peaked within the top ten of the US Billboard 200 chart.\n\nInstruction:\n\nGiven this paragraph about a singer, what was Rihanna's first album?\n\nAnswer:\n\nMusic of the Sun (2005)\n\n",
    "Context:\n\nSimón José Antonio de la Santísima Trinidad Bolívar y Palacios (24 July 1783 – 17 December 1830) was a Venezuelan military and political leader who led what are currently the countries of Colombia, Venezuela, Ecuador, Peru, Panama and Bolivia to independence from the Spanish Empire. He is known colloquially as El Libertador, or the Liberator of America. Simón Bolívar was born in Caracas in the Captaincy General of Venezuela into a wealthy family of American-born Spaniards (criollo), but lost both parents as a child. Bolívar was educated abroad and lived in Spain, as was common for men of upper-class families in his day. While living in Madrid from 1800 to 1802, he was introduced to Enlightenment philosophy and married María Teresa Rodríguez del Toro y Alaysa, who died in Venezuela from yellow fever in 1803. From 1803 to 1805, Bolívar embarked on a Grand Tour that ended in Rome, where he swore to end the Spanish rule in the Americas. In 1807, Bolívar returned to Venezuela and proposed gaining Venezuelan independence to other wealthy creoles. When the Spanish authority in the Americas weakened due to Napoleon's Peninsular War, Bolívar became a zealous combatant and politician in the Spanish American wars of independence.\n\nInstruction:\n\nGiven this paragraph about Simon Bolivar, tell me when and where they were born, and what they are known for\n\nAnswer:\n\nSimon Bolivar was born in Caracas, Venezuela on 24 July 1783. He is known for leading the wars of independence from the Spanish Empire from what are currently the countries of Colombia, Venezuela, Ecuador, Peru, Panama and Bolivia\n\n",
    "Context:\n\nHeat shock proteins (HSP) are a family of proteins produced by cells in response to exposure to stressful conditions. They were first described in relation to heat shock, but are now known to also be expressed during other stresses including exposure to cold, UV light and during wound healing or tissue remodeling. Many members of this group perform chaperone functions by stabilizing new proteins to ensure correct folding or by helping to refold proteins that were damaged by the cell stress. This increase in expression is transcriptionally regulated. The dramatic upregulation of the heat shock proteins is a key part of the heat shock response and is induced primarily by heat shock factor (HSF). HSPs are found in virtually all living organisms, from bacteria to humans.\n\nInstruction:\n\nWhat are Heat Shock proteins?\n\nAnswer:\n\nHeat shock proteins (HSP) are a family of proteins produced by cells in response to exposure to stressful conditions.\n\n",
    "Context:\n\nNintendo was founded in 1889 as Nintendo Karuta by craftsman Fusajiro Yamauchi and originally produced handmade hanafuda playing cards. After venturing into various lines of business during the 1960s and acquiring a legal status as a public company, Nintendo distributed its first console, the Color TV-Game, in 1977. It gained international recognition with the release of Donkey Kong in 1981 and the Nintendo Entertainment System and Super Mario Bros. in 1985.\n\nInstruction:\n\nGiven this reference text about a video game, when was Donkey Kong released?\n\nAnswer:\n\n1981\n\n",
    "Context:\n\nAkins graduated from Union Grove High School in McDonough, Georgia. He earned All-State honors as both a junior and senior, as well as All-Conference as a sophomore. He committed and signed to play football for the UCF Knights, choosing the Knights over schools such as LSU and Georgia. However, after being drafted by the Texas Rangers in the third round of the 2010 MLB Draft, he chose to pursue a baseball career instead of attending UCF and signed with the Rangers. Akins struggled in the minor leagues, hitting .218 over four seasons and never rising above high-A ball. He retired from baseball after the 2013 season and returned to play football at UCF.\n\nInstruction:\n\nWhat did Jordan Akins do after retiring from baseball?\n\nAnswer:\n\nJordan Akins retired baseball after the 2013 season and returned to play football at UCF.\n\n"
]